    "resourcePath": "Đường dẫn đầy đủ của tài nguyên",
    "resourceScheme": "Lược đồ của tài nguyên",
    "resourceSet": "Tài nguyên có tồn tại hay không",
    "sideBarFocus": "Thanh bên có tiêu điểm bàn phím hay không",
    "sideBarVisible": "Thanh bên có hiển thị hay không",
    "sideBySideEditorActive": "Trình chỉnh sửa song song có đang hoạt động hay không",
    "splitEditorsVertically": "Các trình chỉnh sửa có được chia theo chiều dọc hay không",
    "statusBarFocused": "Thanh trạng thái có tiêu điểm bàn phím hay không",
    "temporaryWorkspace": "Lược đồ của không gian làm việc hiện tại đến từ hệ thống tệp tạm thời",
    "textCompareEditorActive": "Trình chỉnh sửa so sánh văn bản có đang hoạt động hay không",
    "textCompareEditorVisible": "Trình chỉnh sửa so sánh văn bản có hiển thị hay không",
    "titleBarStyle": "Kiểu của thanh tiêu đề cửa sổ",
    "titleBarVisible": "Thanh tiêu đề có hiển thị hay không",
    "twoEditorsSelectedInGroup": "Có chính xác hai trình chỉnh sửa được chọn trong một nhóm trình chỉnh sửa hay không",
    "virtualWorkspace": "Lược đồ của không gian làm việc hiện tại đến từ hệ thống tệp ảo hoặc chuỗi rỗng",
    "workbenchState": "Biến thể của không gian làm việc được mở trong cửa sổ, có thể là \"rỗng\" (không có không gian làm việc), \"thư mục\" (thư mục duy nhất) hoặc \"không gian làm việc\" (không gian làm việc với nhiều gốc)",
    "workspaceFolderCount": "Số lượng thư mục gốc trong không gian làm việc"
  },
  "vs/workbench/common/editor": {
    "builtinProviderDisplayName": "Tích hợp",
    "configureEditorLargeFileConfirmation": "Cấu hình giới hạn",
    "openLargeFile": "Mở bất chấp",
    "promptOpenWith.defaultEditor.displayName": "Trình chỉnh sửa văn bản"
  },
  "vs/workbench/common/editor/diffEditorInput": {
    "sideBySideLabels": "{0} ↔ {1}"
  },
  "vs/workbench/common/editor/sideBySideEditorInput": {
    "sideBySideLabels": "{0} - {1}"
  },
  "vs/workbench/common/editor/textEditorModel": {
    "languageAutoDetected": "Ngôn ngữ {0} đã được phát hiện và tự động đặt làm chế độ ngôn ngữ."
  },
  "vs/workbench/common/theme": {
    "activityBarActiveBackground": "Màu nền của thanh hoạt động cho mục đang hoạt động. Thanh hoạt động xuất hiện ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarActiveBorder": "Màu viền của thanh hoạt động cho mục đang hoạt động. Thanh hoạt động xuất hiện ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarActiveFocusBorder": "Màu viền tiêu điểm của thanh hoạt động cho mục đang hoạt động. Thanh hoạt động xuất hiện ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarBackground": "Màu nền của thanh hoạt động, hiển thị ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarBadgeBackground": "Màu nền của huy hiệu thông báo hoạt động. Thanh hoạt động hiển thị ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarBadgeForeground": "Màu chữ của huy hiệu thông báo hoạt động. Thanh hoạt động hiển thị ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarBorder": "Màu viền của thanh hoạt động ngăn cách thanh bên. Thanh hoạt động hiển thị ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarDragAndDropBorder": "Màu viền kéo và thả của thanh hoạt động. Thanh hoạt động hiển thị ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarForeground": "Màu chữ của mục thanh hoạt động khi đang hoạt động. Thanh hoạt động hiển thị ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarInActiveForeground": "Màu chữ của mục thanh hoạt động khi không hoạt động. Thanh hoạt động hiển thị ở bên trái hoặc phải và cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarTop": "Màu chữ hoạt động của mục trong thanh hoạt động khi ở trên hoặc dưới. Thanh hoạt động cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarTopActiveBackground": "Màu nền của mục đang hoạt động trong thanh hoạt động khi ở trên hoặc dưới. Thanh hoạt động cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarTopActiveFocusBorder": "Màu viền tiêu điểm cho mục đang hoạt động trong thanh hoạt động khi ở trên hoặc dưới. Thanh hoạt động cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarTopBackground": "Màu nền của thanh hoạt động khi được đặt ở trên hoặc dưới.",
    "activityBarTopDragAndDropBorder": "Màu viền kéo và thả của các mục trong thanh hoạt động khi ở trên hoặc dưới. Thanh hoạt động cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "activityBarTopInActiveForeground": "Màu chữ không hoạt động của mục trong thanh hoạt động khi ở trên hoặc dưới. Thanh hoạt động cho phép chuyển đổi giữa các chế độ xem của thanh bên.",
    "banner.background": "Màu nền của biểu ngữ. Biểu ngữ hiển thị trên thanh tiêu đề của cửa sổ.",
    "banner.foreground": "Màu chữ của biểu ngữ. Biểu ngữ hiển thị trên thanh tiêu đề của cửa sổ.",
    "banner.iconForeground": "Màu biểu tượng của biểu ngữ. Biểu ngữ hiển thị trên thanh tiêu đề của cửa sổ.",
    "commandCenter-activeBackground": "Màu nền hoạt động của trung tâm lệnh",
    "commandCenter-activeBorder": "Màu viền hoạt động của trung tâm lệnh",
    "commandCenter-activeForeground": "Màu chữ hoạt động của trung tâm lệnh",
    "commandCenter-background": "Màu nền của trung tâm lệnh",
    "commandCenter-border": "Màu viền của trung tâm lệnh",
    "commandCenter-foreground": "Màu chữ của trung tâm lệnh",
    "commandCenter-inactiveBorder": "Màu viền của trung tâm lệnh khi cửa sổ không hoạt động",
    "commandCenter-inactiveForeground": "Màu chữ của trung tâm lệnh khi cửa sổ không hoạt động",
    "editorDragAndDropBackground": "Màu nền khi kéo các trình chỉnh sửa. Màu nên có độ trong suốt để nội dung trình chỉnh sửa có thể hiển thị xuyên qua.",
    "editorDropIntoPromptBackground": "Màu nền của văn bản hiển thị trên các trình chỉnh sửa khi kéo tệp. Văn bản này thông báo cho người dùng rằng họ có thể giữ phím Shift để đặt vào trình chỉnh sửa.",
    "editorDropIntoPromptBorder": "Màu viền của văn bản hiển thị trên các trình chỉnh sửa khi kéo tệp. Văn bản này thông báo cho người dùng rằng họ có thể giữ phím Shift để đặt vào trình chỉnh sửa.",
    "editorDropIntoPromptForeground": "Màu chữ của văn bản hiển thị trên các trình chỉnh sửa khi kéo tệp. Văn bản này thông báo cho người dùng rằng họ có thể giữ phím Shift để đặt vào trình chỉnh sửa.",
    "editorGroupBorder": "Màu để phân tách các nhóm trình chỉnh sửa. Nhóm trình chỉnh sửa là các vùng chứa của trình chỉnh sửa.",
    "editorGroupEmptyBackground": "Màu nền của nhóm trình chỉnh sửa rỗng. Nhóm trình chỉnh sửa là các vùng chứa của trình chỉnh sửa.",
    "editorGroupFocusedEmptyBorder": "Màu viền của nhóm trình chỉnh sửa rỗng khi có tiêu điểm. Nhóm trình chỉnh sửa là các vùng chứa của trình chỉnh sửa.",
    "editorGroupHeaderBackground": "Màu nền của tiêu đề nhóm trình chỉnh sửa khi (`\"workbench.editor.showTabs\": \"single\"`). Nhóm trình chỉnh sửa là các vùng chứa của trình chỉnh sửa.",
    "editorPaneBackground": "Màu nền của bảng trình chỉnh sửa hiển thị ở bên trái và phải của bố cục trình chỉnh sửa trung tâm.",
    "editorTitleContainerBorder": "Màu viền của tiêu đề nhóm trình chỉnh sửa. Nhóm trình chỉnh sửa là các vùng chứa của trình chỉnh sửa.",
    "extensionBadge.remoteBackground": "Màu nền của huy hiệu từ xa trong chế độ xem tiện ích mở rộng.",
    "extensionBadge.remoteForeground": "Màu chữ của huy hiệu từ xa trong chế độ xem tiện ích mở rộng.",
    "lastPinnedTabBorder": "Viền để phân tách các tab với nhau. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "menubarSelectionBackground": "Màu nền của mục menu được chọn trong thanh menu.",
    "menubarSelectionBorder": "Màu viền của mục menu được chọn trong thanh menu.",
    "menubarSelectionForeground": "Màu chữ của mục menu được chọn trong thanh menu.",
    "notificationCenterBorder": "Màu viền của trung tâm thông báo. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationCenterHeaderBackground": "Màu nền của tiêu đề trung tâm thông báo. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationCenterHeaderForeground": "Màu chữ của tiêu đề trung tâm thông báo. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationToastBorder": "Màu viền của thông báo hệ thống. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationsBackground": "Màu nền của thông báo. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationsBorder": "Màu viền phân tách các thông báo trong trung tâm thông báo. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationsErrorIconForeground": "Màu sử dụng cho biểu tượng thông báo lỗi. Các thông báo hiển thị từ góc dưới bên phải của cửa sổ.",
    "notificationsForeground": "Màu chữ của thông báo. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationsInfoIconForeground": "Màu sử dụng cho biểu tượng thông báo thông tin. Các thông báo hiển thị từ góc dưới bên phải của cửa sổ.",
    "notificationsLink": "Màu chữ của liên kết thông báo. Các thông báo trượt từ góc dưới bên phải của cửa sổ.",
    "notificationsWarningIconForeground": "Màu sử dụng cho biểu tượng thông báo cảnh báo. Các thông báo hiển thị từ góc dưới bên phải của cửa sổ.",
    "outputViewBackground": "Màu nền của chế độ xem đầu ra.",
    "outputViewStickyScrollBackground": "Màu nền của cuộn cố định trong chế độ xem đầu ra.",
    "panelActiveTitleBorder": "Màu viền của tiêu đề bảng đang hoạt động. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelActiveTitleForeground": "Màu chữ của tiêu đề bảng đang hoạt động. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelBackground": "Màu nền của bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelBorder": "Màu viền trên của bảng phân tách nó với trình chỉnh sửa. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelDragAndDropBorder": "Màu viền kéo và thả cho các tiêu đề bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelInactiveTitleForeground": "Màu chữ của tiêu đề bảng không hoạt động. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelInputBorder": "Viền của hộp nhập liệu cho các đầu vào bảng.",
    "panelSectionBorder": "Màu viền của phần bảng được sử dụng khi nhiều chế độ xem được xếp chồng theo chiều ngang trong bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp. Các phần bảng là các chế độ xem lồng nhau trong bảng.",
    "panelSectionDragAndDropBackground": "Màu viền kéo và thả cho các phần bảng. Màu nên có độ trong suốt để các phần bảng có thể hiển thị xuyên qua. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp. Các phần bảng là các chế độ xem lồng nhau trong bảng.",
    "panelSectionHeaderBackground": "Màu nền của tiêu đề phần bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp. Các phần bảng là các chế độ xem lồng nhau trong bảng.",
    "panelSectionHeaderBorder": "Màu viền của tiêu đề phần bảng được sử dụng khi nhiều chế độ xem được xếp chồng theo chiều dọc trong bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp. Các phần bảng là các chế độ xem lồng nhau trong bảng.",
    "panelSectionHeaderForeground": "Màu chữ của tiêu đề phần bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp. Các phần bảng là các chế độ xem lồng nhau trong bảng.",
    "panelStickyScrollBackground": "Màu nền của cuộn cố định trong bảng.",
    "panelStickyScrollBorder": "Màu viền của cuộn cố định trong bảng.",
    "panelStickyScrollShadow": "Màu bóng của cuộn cố định trong bảng.",
    "panelTitleBadgeBackground": "Màu nền của huy hiệu tiêu đề bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelTitleBadgeForeground": "Màu chữ của huy hiệu tiêu đề bảng. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "panelTitleBorder": "Màu viền của tiêu đề bảng ở phía dưới, phân tách tiêu đề với các chế độ xem. Các bảng hiển thị dưới khu vực trình chỉnh sửa và chứa các chế độ xem như Đầu ra và Terminal tích hợp.",
    "profileBadgeBackground": "Màu nền của huy hiệu hồ sơ. Huy hiệu hồ sơ hiển thị ở phía trên biểu tượng bánh răng cài đặt của thanh hoạt động.",
    "profileBadgeForeground": "Màu chữ của huy hiệu hồ sơ. Huy hiệu hồ sơ hiển thị ở phía trên biểu tượng bánh răng cài đặt của thanh hoạt động.",
    "sideBarActivityBarTopBorder": "Màu viền giữa thanh hoạt động ở trên hoặc dưới và các chế độ xem.",
    "sideBarBackground": "Màu nền của thanh bên, là vùng chứa các chế độ xem như Explorer và Tìm kiếm.",
    "sideBarBorder": "Màu viền của thanh bên ở phía phân tách với trình chỉnh sửa. Thanh bên là vùng chứa các chế độ xem như Explorer và Tìm kiếm.",
    "sideBarDragAndDropBackground": "Màu viền kéo và thả cho các phần của thanh bên. Màu nên có độ trong suốt để các phần của thanh bên có thể hiển thị xuyên qua, là vùng chứa cho các chế độ xem như Explorer hoặc Tìm kiếm. Các phần thanh bên là các chế độ xem lồng nhau trong thanh bên.",
    "sideBarForeground": "Màu chữ của thanh bên, là vùng chứa các chế độ xem như Explorer và Tìm kiếm.",
    "sideBarSectionHeaderBackground": "Màu nền của tiêu đề phần thanh bên. Thanh bên là vùng chứa các chế độ xem như Explorer và Tìm kiếm. Các phần thanh bên là các chế độ xem lồng nhau trong thanh bên.",
    "sideBarSectionHeaderBorder": "Màu viền của tiêu đề phần thanh bên. Thanh bên là vùng chứa các chế độ xem như Explorer và Tìm kiếm. Các phần thanh bên là các chế độ xem lồng nhau trong thanh bên.",
    "sideBarSectionHeaderForeground": "Màu chữ của tiêu đề phần thanh bên. Thanh bên là vùng chứa các chế độ xem như Explorer và Tìm kiếm. Các phần thanh bên là các chế độ xem lồng nhau trong thanh bên.",
    "sideBarStickyScrollBackground": "Màu nền của cuộn cố định trong thanh bên.",
    "sideBarStickyScrollBorder": "Màu viền của cuộn cố định trong thanh bên.",
    "sideBarStickyScrollShadow": "Màu bóng của cuộn cố định trong thanh bên.",
    "sideBarTitleBackground": "Màu nền tiêu đề thanh bên. Thanh bên là vùng chứa các chế độ xem như Explorer và Tìm kiếm.",
    "sideBarTitleBorder": "Màu viền của tiêu đề thanh bên ở phía dưới, phân tách tiêu đề với các chế độ xem. Thanh bên là vùng chứa các chế độ xem như Explorer và Tìm kiếm.",
    "sideBarTitleForeground": "Màu chữ của tiêu đề thanh bên, là vùng chứa các chế độ xem như Explorer và Tìm kiếm.",
    "sideBySideEditor.horizontalBorder": "Màu để phân tách hai trình chỉnh sửa khi hiển thị song song trong một nhóm trình chỉnh sửa từ trên xuống dưới.",
    "sideBySideEditor.verticalBorder": "Màu để phân tách hai trình chỉnh sửa khi hiển thị song song trong một nhóm trình chỉnh sửa từ trái sang phải.",
    "statusBarBackground": "Màu nền của thanh trạng thái khi mở một không gian làm việc hoặc thư mục. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarBorder": "Màu viền của thanh trạng thái phân tách thanh bên và trình chỉnh sửa. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarErrorItemBackground": "Màu nền của các mục lỗi trong thanh trạng thái. Các mục lỗi được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện lỗi. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarErrorItemForeground": "Màu chữ của các mục lỗi trong thanh trạng thái. Các mục lỗi được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện lỗi. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarErrorItemHoverBackground": "Màu nền của các mục lỗi trong thanh trạng thái khi di chuột qua. Các mục lỗi được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện lỗi. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarErrorItemHoverForeground": "Màu chữ của các mục lỗi trong thanh trạng thái khi di chuột qua. Các mục lỗi được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện lỗi. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarFocusBorder": "Màu viền của thanh trạng thái khi được tập trung trong điều hướng bàn phím. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarForeground": "Màu chữ của thanh trạng thái khi mở một không gian làm việc hoặc thư mục. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarItemActiveBackground": "Màu nền của mục thanh trạng thái khi nhấp chuột. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarItemCompactHoverBackground": "Màu nền của mục thanh trạng thái khi di chuột qua mục chứa nhiều loại thông tin được hiển thị. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarItemFocusBorder": "Màu viền của mục thanh trạng thái khi được tập trung trong điều hướng bàn phím. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarItemHoverBackground": "Màu nền của mục thanh trạng thái khi di chuột qua. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarItemHoverForeground": "Màu chữ của mục thanh trạng thái khi di chuột qua. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarItemOfflineBackground": "Màu nền của mục thanh trạng thái khi không gian làm việc đang ngoại tuyến.",
    "statusBarItemOfflineForeground": "Màu chữ của mục thanh trạng thái khi không gian làm việc đang ngoại tuyến.",
    "statusBarItemRemoteBackground": "Màu nền cho chỉ báo từ xa trong thanh trạng thái.",
    "statusBarItemRemoteForeground": "Màu chữ cho chỉ báo từ xa trong thanh trạng thái.",
    "statusBarNoFolderBackground": "Màu nền của thanh trạng thái khi không có thư mục nào được mở. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarNoFolderBorder": "Màu viền của thanh trạng thái phân tách thanh bên và trình chỉnh sửa khi không có thư mục nào được mở. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarNoFolderForeground": "Màu chữ của thanh trạng thái khi không có thư mục nào được mở. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarOfflineItemHoverBackground": "Màu nền của mục thanh trạng thái khi không gian làm việc đang ngoại tuyến.",
    "statusBarOfflineItemHoverForeground": "Màu chữ của mục thanh trạng thái khi không gian làm việc đang ngoại tuyến.",
    "statusBarProminentItemBackground": "Màu nền của các mục nổi bật trong thanh trạng thái. Các mục nổi bật được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra tầm quan trọng. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarProminentItemForeground": "Màu chữ của các mục nổi bật trong thanh trạng thái. Các mục nổi bật được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra tầm quan trọng. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarProminentItemHoverBackground": "Màu nền của các mục nổi bật trong thanh trạng thái khi di chuột qua. Các mục nổi bật được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra tầm quan trọng. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarProminentItemHoverForeground": "Màu chữ của các mục nổi bật trong thanh trạng thái khi di chuột qua. Các mục nổi bật được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra tầm quan trọng. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarRemoteItemHoverBackground": "Màu nền cho chỉ báo từ xa trong thanh trạng thái khi di chuột qua.",
    "statusBarRemoteItemHoverForeground": "Màu chữ cho chỉ báo từ xa trong thanh trạng thái khi di chuột qua.",
    "statusBarWarningItemBackground": "Màu nền của các mục cảnh báo trong thanh trạng thái. Các mục cảnh báo được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện cảnh báo. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarWarningItemForeground": "Màu chữ của các mục cảnh báo trong thanh trạng thái. Các mục cảnh báo được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện cảnh báo. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarWarningItemHoverBackground": "Màu nền của các mục cảnh báo trong thanh trạng thái khi di chuột qua. Các mục cảnh báo được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện cảnh báo. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "statusBarWarningItemHoverForeground": "Màu chữ của các mục cảnh báo trong thanh trạng thái khi di chuột qua. Các mục cảnh báo được làm nổi bật so với các mục khác trong thanh trạng thái để chỉ ra điều kiện cảnh báo. Thanh trạng thái hiển thị ở phía dưới cửa sổ.",
    "tabActiveBackground": "Màu nền của tab đang hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabActiveBorder": "Viền ở phía dưới của tab đang hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabActiveBorderTop": "Viền ở phía trên của tab đang hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabActiveForeground": "Màu chữ của tab đang hoạt động trong nhóm đang hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabActiveModifiedBorder": "Viền ở phía trên của các tab đang hoạt động đã được sửa đổi trong nhóm đang hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabActiveUnfocusedBorder": "Viền ở phía dưới của tab đang hoạt động cho nhóm không được chọn. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabActiveUnfocusedBorderTop": "Viền ở phía trên của tab đang hoạt động cho nhóm không được chọn. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabBorder": "Viền để phân tách các tab với nhau. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabDragAndDropBorder": "Viền giữa các tab để chỉ ra rằng có thể chèn tab giữa hai tab. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabHoverBackground": "Màu nền của tab đang hoạt động khi di chuột qua. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabHoverBorder": "Viền để làm nổi bật các tab khi di chuột qua. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabHoverForeground": "Màu chữ của tab khi di chuột qua. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabInactiveBackground": "Màu nền của tab không hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabInactiveForeground": "Màu chữ của tab không hoạt động trong nhóm đang hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabInactiveModifiedBorder": "Viền ở phía trên của các tab không hoạt động đã được sửa đổi trong nhóm đang hoạt động. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabSelectedBackground": "Màu nền của tab được chọn. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabSelectedBorderTop": "Viền ở phía trên của tab được chọn. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabSelectedForeground": "Màu chữ của tab được chọn. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabUnfocusedActiveBackground": "Màu nền của tab đang hoạt động trong nhóm không có tiêu điểm. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabUnfocusedActiveForeground": "Màu chữ của tab đang hoạt động trong nhóm không có tiêu điểm. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabUnfocusedHoverBackground": "Màu nền của tab trong nhóm không có tiêu điểm khi di chuột qua. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabUnfocusedHoverBorder": "Viền để làm nổi bật các tab trong nhóm không có tiêu điểm khi di chuột qua. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabUnfocusedHoverForeground": "Màu chữ của tab trong nhóm không có tiêu điểm khi di chuột qua. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabUnfocusedInactiveBackground": "Màu nền của tab không hoạt động trong nhóm không có tiêu điểm. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabUnfocusedInactiveForeground": "Màu chữ của tab không hoạt động trong nhóm không có tiêu điểm. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "tabsContainerBackground": "Màu nền của tiêu đề nhóm trình chỉnh sửa khi các tab được bật. Nhóm trình chỉnh sửa là vùng chứa của trình chỉnh sửa.",
    "tabsContainerBorder": "Màu viền của tiêu đề nhóm trình chỉnh sửa khi các tab được bật. Nhóm trình chỉnh sửa là vùng chứa của trình chỉnh sửa.",
    "titleBarActiveBackground": "Màu nền của thanh tiêu đề khi cửa sổ đang hoạt động.",
    "titleBarActiveForeground": "Màu chữ của thanh tiêu đề khi cửa sổ đang hoạt động.",
    "titleBarBorder": "Màu viền của thanh tiêu đề.",
    "titleBarInactiveBackground": "Màu nền của thanh tiêu đề khi cửa sổ không hoạt động.",
    "titleBarInactiveForeground": "Màu chữ của thanh tiêu đề khi cửa sổ không hoạt động.",
    "unfocusedActiveModifiedBorder": "Viền ở phía trên của các tab đang hoạt động đã được sửa đổi trong nhóm không có tiêu điểm. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "unfocusedINactiveModifiedBorder": "Viền ở phía trên của các tab không hoạt động đã được sửa đổi trong nhóm không có tiêu điểm. Các tab là vùng chứa của trình chỉnh sửa trong khu vực trình chỉnh sửa. Có thể mở nhiều tab trong một nhóm trình chỉnh sửa. Có thể có nhiều nhóm trình chỉnh sửa.",
    "windowActiveBorder": "Màu sử dụng cho viền cửa sổ khi đang hoạt động trên macOS hoặc Linux. Yêu cầu kiểu thanh tiêu đề tùy chỉnh và các điều khiển cửa sổ tùy chỉnh hoặc ẩn trên Linux.",
    "windowInactiveBorder": "Màu sử dụng cho viền cửa sổ khi không hoạt động trên macOS hoặc Linux. Yêu cầu kiểu thanh tiêu đề tùy chỉnh và các điều khiển cửa sổ tùy chỉnh hoặc ẩn trên Linux."
  },
  "vs/workbench/common/views": {
    "defaultViewIcon": "Biểu tượng chế độ xem mặc định.",
    "duplicateId": "Một chế độ xem với id \"{0}\" đã được đăng ký",
    "treeView.notRegistered": "Không có chế độ xem cây nào được đăng ký với id \"{0}\".",
    "views log": "Chế độ xem"
  },
  "vs/workbench/electron-browser/actions/developerActions": {
    "configureRuntimeArguments": "Cấu hình tham số thời gian chạy",
    "reloadWindowWithExtensionsDisabled": "Tải lại với tiện ích mở rộng bị vô hiệu hóa",
    "revealUserDataFolder": "Hiển thị thư mục dữ liệu người dùng",
    "showGPUInfo": "Hiển thị thông tin GPU",
    "stopTracing": "Dừng theo dõi",
    "stopTracing.button": "&&Khởi động lại và bật theo dõi",
    "stopTracing.detail": "Việc này có thể mất đến một phút để hoàn thành.",
    "stopTracing.message": "Theo dõi yêu cầu khởi động với tham số '--trace'",
    "stopTracing.title": "Đang tạo tệp theo dõi...",
    "toggleDevTools": "Chuyển đổi công cụ phát triển"
  },
  "vs/workbench/electron-browser/actions/installActions": {
    "install": "Cài đặt lệnh '{0}' vào PATH",
    "shellCommand": "Lệnh shell",
    "successFrom": "Lệnh shell '{0}' đã được gỡ cài đặt thành công khỏi PATH.",
    "successIn": "Lệnh shell '{0}' đã được cài đặt thành công vào PATH.",
    "uninstall": "Gỡ cài đặt lệnh '{0}' khỏi PATH"
  },
  "vs/workbench/electron-browser/actions/windowActions": {
    "close": "Đóng cửa sổ",
    "closeWindow": "Đóng cửa sổ",
    "current": "Cửa sổ hiện tại",
    "disableWindowAlwaysOnTop": "Tắt Luôn ở trên",
    "enableWindowAlwaysOnTop": "Bật Luôn ở trên",
    "miCloseWindow": "Đ&&óng cửa sổ",
    "miZoomIn": "&&Phóng to",
    "miZoomOut": "&&Thu nhỏ",
    "miZoomReset": "&&Đặt lại tỷ lệ",
    "quickSwitchWindow": "Chuyển đổi cửa sổ nhanh...",
    "switchWindow": "Chuyển đổi cửa sổ...",
    "switchWindowPlaceHolder": "Chọn cửa sổ để chuyển đổi",
    "toggleWindowAlwaysOnTop": "Chuyển đổi cửa sổ luôn ở trên",
    "windowDirtyAriaLabel": "{0}, cửa sổ với các thay đổi chưa lưu",
    "windowGroup": "nhóm cửa sổ",
    "zoomIn": "Phóng to",
    "zoomOut": "Thu nhỏ",
    "zoomReset": "Đặt lại tỷ lệ"
  },
  "vs/workbench/electron-browser/desktop.contribution": {
    "application.shellEnvironmentResolutionTimeout": "Kiểm soát thời gian chờ tính bằng giây trước khi dừng việc giải quyết môi trường shell khi ứng dụng chưa được khởi động từ terminal. Xem [tài liệu](https://go.microsoft.com/fwlink/?linkid=2149667) để biết thêm thông tin.",
    "argv.crashReporterId": "Mã định danh duy nhất dùng để liên kết các báo cáo sự cố được gửi từ phiên bản ứng dụng này.",
    "argv.disableChromiumSandbox": "Vô hiệu hóa sandbox của Chromium. Hữu ích khi chạy VS Code với quyền cao trên Linux và khi chạy trong AppLocker trên Windows.",
    "argv.disableHardwareAcceleration": "Vô hiệu hóa tăng tốc phần cứng. Chỉ thay đổi tùy chọn này nếu gặp vấn đề về đồ họa.",
    "argv.disableLcdText": "Vô hiệu hóa làm mịn phông chữ LCD.",
    "argv.enableCrashReporter": "Cho phép vô hiệu hóa báo cáo sự cố; phải khởi động lại ứng dụng nếu giá trị thay đổi.",
    "argv.enableRDPDisplayTracking": "Đảm bảo các cửa sổ được phóng to được khôi phục vào màn hình đúng trong quá trình kết nối lại RDP.",
    "argv.enebleProposedApi": "Bật API được đề xuất cho danh sách các mã định danh tiện ích mở rộng (như \"vscode.git\"). Các API được đề xuất không ổn định và có thể bị gián đoạn mà không có cảnh báo bất kỳ lúc nào. Tùy chọn này chỉ nên được đặt cho phát triển tiện ích mở rộng và kiểm tra.",
    "argv.force-renderer-accessibility": "Buộc kích hoạt khả năng truy cập trình kết xuất. Chỉ thay đổi tùy chọn này nếu sử dụng trình đọc màn hình trên Linux. Trên các nền tảng khác, trình kết xuất sẽ tự động có khả năng truy cập. Cờ này được tự động đặt nếu có editor.accessibilitySupport: on.",
    "argv.forceColorProfile": "Cho phép ghi đè hồ sơ màu được sử dụng. Nếu thấy màu sắc không đúng, hãy thử đặt giá trị này thành \"srgb\" và khởi động lại.",
    "argv.locale": "Ngôn ngữ hiển thị được sử dụng. Việc chọn ngôn ngữ khác yêu cầu cài đặt gói ngôn ngữ tương ứng.",
    "argv.logLevel": "Mức độ ghi nhật ký được sử dụng. Mặc định là \"info\". Các giá trị được phép là \"error\", \"warn\", \"info\", \"debug\", \"trace\", \"off\".",
    "argv.passwordStore": "Cấu hình back-end được sử dụng để lưu trữ bí mật trên Linux. Tham số này bị bỏ qua trên Windows và macOS.",
    "argv.proxyBypassList": "Bỏ qua bất kỳ proxy nào được chỉ định cho danh sách các host được phân tách bằng dấu chấm phẩy. Ví dụ giá trị \"<local>;*.microsoft.com;*foo.com;1.2.3.4:5678\", sẽ sử dụng máy chủ proxy cho tất cả các host ngoại trừ địa chỉ cục bộ (localhost, 127.0.0.1, v.v.), các miền phụ microsoft.com, các host chứa hậu tố foo.com và bất kỳ thứ gì trên 1.2.3.4:5678",
    "argv.remoteDebuggingPort": "Chỉ định cổng được sử dụng cho gỡ lỗi từ xa.",
    "argv.useInMemorySecretStorage": "Đảm bảo sử dụng kho lưu trữ trong bộ nhớ cho việc lưu trữ bí mật thay vì sử dụng kho chứng chỉ của hệ điều hành. Thường được sử dụng khi chạy các bài kiểm tra tiện ích mở rộng VS Code hoặc khi gặp khó khăn với kho chứng chỉ.",
    "closeWhenEmpty": "Kiểm soát liệu cửa sổ có nên đóng lại khi đóng trình chỉnh sửa cuối cùng. Cài đặt này chỉ áp dụng cho các cửa sổ không hiển thị thư mục.",
    "confirmSaveUntitledWorkspace": "Kiểm soát liệu hộp thoại xác nhận có hiện ra để yêu cầu lưu hoặc hủy không gian làm việc không có tiêu đề đang mở trong cửa sổ khi chuyển sang không gian làm việc khác. Nếu vô hiệu hóa hộp thoại xác nhận, không gian làm việc không có tiêu đề sẽ luôn bị hủy.",
    "controlsStyle": "Điều chỉnh giao diện của các điều khiển cửa sổ để là bản địa của hệ điều hành, tùy chỉnh hoặc ẩn. Thay đổi yêu cầu khởi động lại hoàn toàn để áp dụng.",
    "dialogStyle": "Điều chỉnh giao diện của các hộp thoại để là bản địa của hệ điều hành hoặc tùy chỉnh.",
    "enableCrashReporterDeprecated": "Nếu cài đặt này là false, không có dữ liệu đo từ xa nào được gửi bất kể giá trị của cài đặt mới. Đã lỗi thời do được hợp nhất vào cài đặt {0}.",
    "keyboardConfigurationTitle": "Bàn phím",
    "mergeAllWindowTabs": "Hợp nhất tất cả các cửa sổ",
    "miExit": "Th&&oát",
    "moveWindowTabToNewWindow": "Di chuyển tab cửa sổ sang cửa sổ mới",
    "newTab": "Tab cửa sổ mới",
    "newWindowDimensions": "Kiểm soát kích thước mở của cửa sổ mới khi đã có ít nhất một cửa sổ đang mở. Lưu ý rằng cài đặt này không ảnh hưởng đến cửa sổ đầu tiên được mở, cửa sổ này luôn được khôi phục về kích thước và vị trí trước khi đóng.",
    "openWithoutArgumentsInNewWindow": "Kiểm soát liệu có nên mở cửa sổ mới trống khi khởi động phiên bản thứ hai mà không có tham số hoặc liệu phiên bản đang chạy cuối cùng nên được tập trung.\r\nLưu ý rằng giá trị này vẫn có thể bị bỏ qua trong một số trường hợp (ví dụ, khi sử dụng tùy chọn dòng lệnh \"--new-window\" hoặc \"--reuse-window\").",
    "restoreFullscreen": "Kiểm soát liệu cửa sổ có nên được khôi phục về chế độ toàn màn hình nếu thoát khỏi chế độ đó.",
    "restoreWindows": "Kiểm soát cách các cửa sổ và trình chỉnh sửa bên trong được khôi phục khi mở.",
    "security.promptForLocalFileProtocolHandling": "Nếu được bật, một hộp thoại sẽ yêu cầu xác nhận mỗi khi mở tệp hoặc không gian làm việc cục bộ thông qua trình xử lý giao thức.",
    "security.promptForRemoteFileProtocolHandling": "Nếu được bật, một hộp thoại sẽ yêu cầu xác nhận mỗi khi mở tệp hoặc không gian làm việc từ xa thông qua trình xử lý giao thức.",
    "showNextWindowTab": "Hiển thị tab cửa sổ tiếp theo",
    "showPreviousTab": "Hiển thị tab cửa sổ trước đó",
    "telemetry.enableCrashReporting": "Bật báo cáo sự cố để được thu thập. Điều này giúp chúng tôi cải thiện độ ổn định.\r\nTùy chọn này yêu cầu khởi động lại để có hiệu lực.",
    "telemetryConfigurationTitle": "Đo từ xa",
    "titleBarStyle": "Điều chỉnh giao diện của thanh tiêu đề cửa sổ để là bản địa của hệ điều hành hoặc tùy chỉnh. Thay đổi yêu cầu khởi động lại hoàn toàn để áp dụng.",
    "touchbar.enabled": "Bật các nút macOS Touchbar trên bàn phím nếu có.",
    "touchbar.ignored": "Tập hợp các mã định danh cho các mục Touchbar không nên xuất hiện (ví dụ, \"workbench.action.navigateBack\").",
    "window.border.color": "{0}: màu cụ thể ở định dạng hex, RGB, RGBA, HSL, HSLA",
    "window.border.default": "{0}: tôn trọng cài đặt chủ đề màu, quay lại cài đặt Windows",
    "window.border.off": "{0}: tắt màu viền",
    "window.border.prefix": "Kiểm soát màu viền cửa sổ:",
    "window.border.suffix": "Sử dụng {0} để đặt màu khác nhau cho cửa sổ hoạt động và không hoạt động. Cài đặt này bị bỏ qua khi {1} được đặt thành {2}.",
    "window.border.system": "{0}: chỉ tôn trọng cài đặt Windows",
    "window.clickThroughInactive": "Nếu được bật, nhấp vào cửa sổ không hoạt động sẽ kích hoạt cửa sổ đó và kích hoạt mục dưới con trỏ chuột nếu mục đó có thể nhấp được. Nếu bị vô hiệu hóa, nhấp vào bất kỳ đâu trên cửa sổ không hoạt động chỉ kích hoạt cửa sổ và cần nhấp lần thứ hai vào mục.",
    "window.customTitleBarVisibility": "Điều chỉnh khi nào nên hiển thị thanh tiêu đề tùy chỉnh. Thanh tiêu đề tùy chỉnh có thể bị ẩn khi ở chế độ toàn màn hình với \"windowed\". Thanh tiêu đề tùy chỉnh chỉ có thể bị ẩn nếu không ở chế độ toàn màn hình với \"never\" khi {0} được đặt thành \"native\".",
    "window.customTitleBarVisibility.auto": "Tự động thay đổi khả năng hiển thị của thanh tiêu đề tùy chỉnh.",
    "window.customTitleBarVisibility.never": "Ẩn thanh tiêu đề tùy chỉnh khi {0} được đặt thành \"native\".",
    "window.customTitleBarVisibility.windowed": "Ẩn thanh tiêu đề tùy chỉnh ở chế độ toàn màn hình. Khi không ở chế độ toàn màn hình, tự động thay đổi khả năng hiển thị của thanh tiêu đề tùy chỉnh.",
    "window.doubleClickIconToClose": "Nếu được bật, cài đặt này sẽ đóng cửa sổ khi nhấp đúp vào biểu tượng ứng dụng trên thanh tiêu đề. Biểu tượng sẽ không thể kéo cửa sổ. Cài đặt này chỉ có hiệu lực nếu `{0}` được đặt thành `custom`.",
    "window.menuStyle": "Điều chỉnh kiểu menu để là bản địa của hệ điều hành, tùy chỉnh hoặc kế thừa từ kiểu thanh tiêu đề được xác định trong {0}. Điều này cũng ảnh hưởng đến giao diện của menu ngữ cảnh. Thay đổi yêu cầu khởi động lại hoàn toàn để áp dụng.",
    "window.menuStyle.custom": "Sử dụng menu tùy chỉnh.",
    "window.menuStyle.custom.mac": "Sử dụng menu ngữ cảnh tùy chỉnh.",
    "window.menuStyle.inherit": "Khớp kiểu menu với kiểu thanh tiêu đề được xác định trong {0}.",
    "window.menuStyle.inherit.mac": "Khớp kiểu menu ngữ cảnh với kiểu thanh tiêu đề được xác định trong {0}.",
    "window.menuStyle.mac": "Điều chỉnh giao diện của menu ngữ cảnh để là bản địa của hệ điều hành, tùy chỉnh hoặc kế thừa từ kiểu thanh tiêu đề được xác định trong {0}.",
    "window.menuStyle.native": "Sử dụng menu bản địa. Điều này bị bỏ qua khi {0} được đặt thành {1}.",
    "window.menuStyle.native.mac": "Sử dụng menu ngữ cảnh bản địa.",
    "window.nativeFullScreen": "Kiểm soát liệu có nên sử dụng chế độ toàn màn hình bản địa trên macOS. Vô hiệu hóa tùy chọn này để ngăn macOS tạo không gian mới khi chuyển sang chế độ toàn màn hình.",
    "window.nativeTabs": "Bật các tab cửa sổ bản địa của macOS. Lưu ý rằng thay đổi yêu cầu khởi động lại thiết bị và các tab bản địa vô hiệu hóa bất kỳ kiểu thanh tiêu đề tùy chỉnh nào đã được cấu hình.",
    "window.newWindowDimensions.default": "Mở các cửa sổ mới ở giữa màn hình.",
    "window.newWindowDimensions.fullscreen": "Mở các cửa sổ mới ở chế độ toàn màn hình.",
    "window.newWindowDimensions.inherit": "Mở các cửa sổ mới với kích thước giống như cửa sổ hoạt động cuối cùng.",
    "window.newWindowDimensions.maximized": "Mở các cửa sổ mới ở trạng thái phóng to.",
    "window.newWindowDimensions.offset": "Mở các cửa sổ mới với kích thước giống như cửa sổ hoạt động cuối cùng với vị trí lệch.",
    "window.openWithoutArgumentsInNewWindow.off": "Tập trung vào phiên bản đang chạy cuối cùng.",
    "window.openWithoutArgumentsInNewWindow.on": "Mở cửa sổ mới trống.",
    "window.reopenFolders.all": "Mở lại tất cả các cửa sổ, trừ khi một thư mục, không gian làm việc hoặc tệp được mở (ví dụ, từ dòng lệnh). Nếu một tệp được mở, nó sẽ thay thế bất kỳ trình chỉnh sửa nào đã mở trước đó trong cửa sổ.",
    "window.reopenFolders.folders": "Mở lại tất cả các cửa sổ có thư mục hoặc không gian làm việc được mở, trừ khi một thư mục, không gian làm việc hoặc tệp được mở (ví dụ, từ dòng lệnh). Nếu một tệp được mở, nó sẽ thay thế bất kỳ trình chỉnh sửa nào đã mở trước đó trong cửa sổ.",
    "window.reopenFolders.none": "Không bao giờ mở lại cửa sổ. Nếu không có thư mục hoặc không gian làm việc được mở (ví dụ, từ dòng lệnh), một cửa sổ trống sẽ xuất hiện.",
    "window.reopenFolders.one": "Mở lại cửa sổ hoạt động cuối cùng, trừ khi một thư mục, không gian làm việc hoặc tệp được mở (ví dụ, từ dòng lệnh). Nếu một tệp được mở, nó sẽ thay thế bất kỳ trình chỉnh sửa nào đã mở trước đó trong cửa sổ.",
    "window.reopenFolders.preserve": "Luôn mở lại tất cả các cửa sổ. Nếu một thư mục hoặc không gian làm việc được mở (ví dụ, từ dòng lệnh), nó sẽ mở như một cửa sổ mới, trừ khi nó đã được mở trước đó. Nếu các tệp được mở, chúng sẽ mở trong một trong các cửa sổ được khôi phục cùng với các trình chỉnh sửa đã mở trước đó.",
    "windowConfigurationTitle": "Cửa sổ",
    "zoomLevel": "Điều chỉnh mức thu phóng mặc định cho tất cả các cửa sổ. Mỗi lần tăng trên '0' (ví dụ, '1') hoặc giảm (ví dụ, '-1') đại diện cho mức thu phóng lớn hơn hoặc nhỏ hơn 20%. Cũng có thể nhập số thập phân để điều chỉnh mức thu phóng với độ chi tiết cao hơn. Xem {0} để cấu hình liệu các lệnh \"Phóng to\" và \"Thu nhỏ\" áp dụng mức thu phóng cho tất cả các cửa sổ hay chỉ cửa sổ đang hoạt động.",
    "zoomPerWindow": "Kiểm soát liệu các lệnh \"Phóng to\" và \"Thu nhỏ\" áp dụng mức thu phóng cho tất cả các cửa sổ hay chỉ cửa sổ đang hoạt động. Xem {0} để cấu hình mức thu phóng mặc định cho tất cả các cửa sổ."
  },
  "vs/workbench/electron-browser/desktop.main": {
    "join.closeStorage": "Đang lưu trạng thái giao diện người dùng"
  },
  "vs/workbench/electron-browser/parts/dialogs/dialogHandler": {
    "copy": "&&Sao chép",
    "okButton": "Đồng ý"
  },
  "vs/workbench/electron-browser/window": {
    "appRootWarning.banner": "Các tệp bạn lưu trong thư mục cài đặt ('{0}') có thể bị GHI ĐÈ hoặc XÓA VĨNH VIỄN mà không có cảnh báo trước trong quá trình cập nhật.",
    "configure": "Cấu hình",
    "downloadArmBuild": "Tải xuống",
    "keychainWriteError": "Lỗi khi ghi thông tin đăng nhập vào chuỗi khóa: '{0}'.",
    "learnMore": "Tìm hiểu thêm",
    "loginButton": "&&Đăng nhập",
    "password": "Mật khẩu",
    "proxyAuthRequired": "Yêu cầu xác thực proxy",
    "proxyDetail": "Proxy {0} yêu cầu tên người dùng và mật khẩu.",
    "rememberCredentials": "Ghi nhớ thông tin đăng nhập của tôi",
    "resolveShellEnvironment": "Đang giải quyết môi trường shell...",
    "restart": "Khởi động lại",
    "runningAsRoot": "Không khuyến nghị chạy {0} với tư cách người dùng root.",
    "runningTranslated": "Bạn đang chạy phiên bản mô phỏng của {0}. Để có hiệu suất tốt hơn, hãy tải xuống phiên bản arm64 bản địa của {0} cho máy của bạn.",
    "sharedProcessCrash": "Một quy trình nền được chia sẻ đã kết thúc bất ngờ. Khởi động lại ứng dụng để khôi phục.",
    "showArgvParseWarning": "Tệp tham số thời gian chạy 'argv.json' chứa lỗi. Hãy sửa chúng và khởi động lại.",
    "showArgvParseWarningAction": "Mở tệp",
    "shutdownErrorClose": "Một lỗi bất ngờ đã ngăn cửa sổ đóng lại",
    "shutdownErrorDetail": "Lỗi: {0}",
    "shutdownErrorLoad": "Một lỗi bất ngờ đã ngăn việc thay đổi không gian làm việc",
    "shutdownErrorQuit": "Một lỗi bất ngờ đã ngăn ứng dụng đóng lại",
    "shutdownErrorReload": "Một lỗi bất ngờ đã ngăn cửa sổ tải lại",
    "shutdownForceClose": "Đóng bất chấp",
    "shutdownForceLoad": "Thay đổi bất chấp",
    "shutdownForceQuit": "Thoát bất chấp",
    "shutdownForceReload": "Tải lại bất chấp",
    "shutdownTitleClose": "Việc đóng cửa sổ đang mất nhiều thời gian hơn dự kiến...",
    "shutdownTitleLoad": "Việc thay đổi không gian làm việc đang mất nhiều thời gian hơn dự kiến...",
    "shutdownTitleQuit": "Việc thoát ứng dụng đang mất nhiều thời gian hơn dự kiến...",
    "shutdownTitleReload": "Việc tải lại cửa sổ đang mất nhiều thời gian hơn dự kiến...",
    "status.windowZoom": "Thu phóng cửa sổ",
    "troubleshooting": "Hướng dẫn xử lý sự cố",
    "username": "Tên người dùng",
    "willShutdownDetail": "Các thao tác sau vẫn đang chạy: \r\n{0}",
    "zoomIn": "Phóng to",
    "zoomNumber": "Mức thu phóng: {0} ({1} %)",
    "zoomOut": "Thu nhỏ",
    "zoomReset": "Đặt lại",
    "zoomResetLabel": "{0} ({1})",
    "zoomSettings": "Cài đặt"
  },
  "vs/workbench/contrib/accessibility/browser/accessibilityConfiguration": {
    "accessibility.debugWatchVariableAnnouncements": "Kiểm soát liệu có nên thông báo các thay đổi biến trong chế độ xem kiểm tra gỡ lỗi.",
    "accessibility.hideAccessibleView": "Kiểm soát liệu chế độ xem có thể truy cập có bị ẩn hay không.",
    "accessibility.openChatEditedFiles": "Kiểm soát liệu các tệp có nên được mở khi tác nhân trò chuyện đã áp dụng thay đổi cho chúng.",
    "accessibility.replEditor.readLastExecutedOutput": "Kiểm soát liệu đầu ra của một lần thực thi trong REPL bản địa có được thông báo hay không.",
    "accessibility.signalOptions.debouncePositionChanges": "Có nên giảm tải các thay đổi vị trí hay không",
    "accessibility.signalOptions.delays.errorAtPosition.announcement": "Độ trễ tính bằng mili giây trước khi thông báo được thực hiện khi có lỗi tại vị trí.",
    "accessibility.signalOptions.delays.errorAtPosition.sound": "Độ trễ tính bằng mili giây trước khi âm thanh được phát khi có lỗi tại vị trí.",
    "accessibility.signalOptions.delays.general.announcement": "Độ trễ tính bằng mili giây trước khi thông báo được thực hiện.",
    "accessibility.signalOptions.delays.general.sound": "Độ trễ tính bằng mili giây trước khi âm thanh được phát.",
    "accessibility.signalOptions.delays.warningAtPosition.announcement": "Độ trễ tính bằng mili giây trước khi thông báo được thực hiện khi có cảnh báo tại vị trí.",
    "accessibility.signalOptions.delays.warningAtPosition.sound": "Độ trễ tính bằng mili giây trước khi âm thanh được phát khi có cảnh báo tại vị trí.",
    "accessibility.signalOptions.volume": "Âm lượng của các tín hiệu âm thanh tính bằng phần trăm (0-100).",
    "accessibility.signals.chatEditModifiedFile": "Phát tín hiệu âm thanh hoặc âm thanh khi hiển thị tệp có thay đổi từ chỉnh sửa trò chuyện",
    "accessibility.signals.chatEditModifiedFile.sound": "Phát âm thanh khi hiển thị tệp có thay đổi từ chỉnh sửa trò chuyện",
    "accessibility.signals.chatRequestSent": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi thực hiện yêu cầu trò chuyện.",
    "accessibility.signals.chatRequestSent.announcement": "Thông báo khi thực hiện yêu cầu trò chuyện.",
    "accessibility.signals.chatRequestSent.sound": "Phát âm thanh khi thực hiện yêu cầu trò chuyện.",
    "accessibility.signals.chatResponseReceived": "Phát tín hiệu âm thanh hoặc âm thanh khi nhận được phản hồi.",
    "accessibility.signals.chatResponseReceived.sound": "Phát âm thanh khi nhận được phản hồi.",
    "accessibility.signals.chatUserActionRequired": "Phát tín hiệu, âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi yêu cầu hành động của người dùng trong trò chuyện.",
    "accessibility.signals.chatUserActionRequired.announcement": "Thông báo khi yêu cầu hành động của người dùng trong trò chuyện, bao gồm thông tin về hành động và cách thực hiện.",
    "accessibility.signals.chatUserActionRequired.sound": "Phát âm thanh khi yêu cầu hành động của người dùng trong trò chuyện.",
    "accessibility.signals.clear": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi xóa một tính năng (ví dụ, terminal, Bảng điều khiển gỡ lỗi hoặc Kênh đầu ra).",
    "accessibility.signals.clear.announcement": "Thông báo khi xóa một tính năng.",
    "accessibility.signals.clear.sound": "Phát âm thanh khi xóa một tính năng.",
    "accessibility.signals.codeActionApplied": "Phát tín hiệu âm thanh hoặc âm thanh khi hành động mã được áp dụng.",
    "accessibility.signals.codeActionApplied.sound": "Phát âm thanh khi hành động mã được áp dụng.",
    "accessibility.signals.codeActionTriggered": "Phát tín hiệu âm thanh hoặc âm thanh khi hành động mã được kích hoạt.",
    "accessibility.signals.codeActionTriggered.sound": "Phát âm thanh khi hành động mã được kích hoạt.",
    "accessibility.signals.diffLineDeleted": "Phát âm thanh hoặc gợi ý âm thanh khi tiêu điểm di chuyển đến dòng bị xóa trong chế độ xem khác biệt có thể truy cập hoặc đến thay đổi tiếp theo hoặc trước đó.",
    "accessibility.signals.diffLineDeleted.sound": "Phát âm thanh khi tiêu điểm di chuyển đến dòng bị xóa trong chế độ xem khác biệt có thể truy cập hoặc đến thay đổi tiếp theo hoặc trước đó.",
    "accessibility.signals.diffLineInserted": "Phát âm thanh hoặc gợi ý âm thanh khi tiêu điểm di chuyển đến dòng được chèn trong chế độ xem khác biệt có thể truy cập hoặc đến thay đổi tiếp theo hoặc trước đó.",
    "accessibility.signals.diffLineModified": "Phát âm thanh hoặc gợi ý âm thanh khi tiêu điểm di chuyển đến dòng được sửa đổi trong chế độ xem khác biệt có thể truy cập hoặc đến thay đổi tiếp theo hoặc trước đó.",
    "accessibility.signals.diffLineModified.sound": "Phát âm thanh khi tiêu điểm di chuyển đến dòng được sửa đổi trong chế độ xem khác biệt có thể truy cập hoặc đến thay đổi tiếp theo hoặc trước đó.",
    "accessibility.signals.editsKept": "Phát tín hiệu âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi các chỉnh sửa được giữ lại.",
    "accessibility.signals.editsKept.announcement": "Thông báo khi các chỉnh sửa được giữ lại.",
    "accessibility.signals.editsKept.sound": "Phát âm thanh khi các chỉnh sửa được giữ lại.",
    "accessibility.signals.editsUndone": "Phát tín hiệu âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi các chỉnh sửa bị hoàn tác.",
    "accessibility.signals.editsUndone.announcement": "Thông báo khi các chỉnh sửa bị hoàn tác.",
    "accessibility.signals.editsUndone.sound": "Phát âm thanh khi các chỉnh sửa bị hoàn tác.",
    "accessibility.signals.format": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi định dạng tệp hoặc sổ tay.",
    "accessibility.signals.format.always": "Phát âm thanh mỗi khi định dạng tệp, kể cả khi được đặt thành định dạng khi lưu, gõ, dán hoặc thực thi ô.",
    "accessibility.signals.format.announcement": "Thông báo khi định dạng tệp hoặc sổ tay.",
    "accessibility.signals.format.announcement.always": "Thông báo mỗi khi định dạng tệp, kể cả khi được đặt thành định dạng khi lưu, gõ, dán hoặc thực thi ô.",
    "accessibility.signals.format.announcement.never": "Không bao giờ thông báo.",
    "accessibility.signals.format.announcement.userGesture": "Thông báo khi người dùng định dạng tệp một cách rõ ràng.",
    "accessibility.signals.format.never": "Không bao giờ phát âm thanh.",
    "accessibility.signals.format.sound": "Phát âm thanh khi định dạng tệp hoặc sổ tay.",
    "accessibility.signals.format.userGesture": "Phát âm thanh khi người dùng định dạng tệp một cách rõ ràng.",
    "accessibility.signals.lineHasBreakpoint": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi dòng đang hoạt động có điểm ngắt.",
    "accessibility.signals.lineHasBreakpoint.announcement": "Thông báo khi dòng đang hoạt động có điểm ngắt.",
    "accessibility.signals.lineHasBreakpoint.sound": "Phát âm thanh khi dòng đang hoạt động có điểm ngắt.",
    "accessibility.signals.lineHasError": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi dòng đang hoạt động có lỗi.",
    "accessibility.signals.lineHasError.announcement": "Thông báo khi dòng đang hoạt động có lỗi.",
    "accessibility.signals.lineHasError.sound": "Phát âm thanh khi dòng đang hoạt động có lỗi.",
    "accessibility.signals.lineHasFoldedArea": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo): dòng đang hoạt động có khu vực được gập lại có thể mở rộng.",
    "accessibility.signals.lineHasFoldedArea.announcement": "Thông báo khi dòng đang hoạt động có khu vực được gập lại có thể mở rộng.",
    "accessibility.signals.lineHasFoldedArea.sound": "Phát âm thanh khi dòng đang hoạt động có khu vực được gập lại có thể mở rộng.",
    "accessibility.signals.lineHasInlineSuggestion": "Phát tín hiệu âm thanh hoặc âm thanh khi dòng đang hoạt động có gợi ý nội tuyến.",
    "accessibility.signals.lineHasInlineSuggestion.sound": "Phát âm thanh khi dòng đang hoạt động có gợi ý nội tuyến.",
    "accessibility.signals.lineHasWarning": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.lineHasWarning.announcement": "Thông báo khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.lineHasWarning.sound": "Phát âm thanh khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.nextEditSuggestion": "Phát tín hiệu: âm thanh hoặc thông báo (cảnh báo) khi có gợi ý chỉnh sửa mới.",
    "accessibility.signals.nextEditSuggestion.announcement": "Thông báo khi có gợi ý chỉnh sửa mới.",
    "accessibility.signals.nextEditSuggestion.sound": "Phát âm thanh khi có gợi ý chỉnh sửa mới.",
    "accessibility.signals.noInlayHints": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi cố gắng đọc dòng có gợi ý nội tuyến nhưng không có gợi ý nội tuyến.",
    "accessibility.signals.noInlayHints.announcement": "Thông báo khi cố gắng đọc dòng có gợi ý nội tuyến nhưng không có gợi ý nội tuyến.",
    "accessibility.signals.noInlayHints.sound": "Phát âm thanh khi cố gắng đọc dòng có gợi ý nội tuyến nhưng không có gợi ý nội tuyến.",
    "accessibility.signals.notebookCellCompleted": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi ô sổ tay hoàn thành thực thi thành công.",
    "accessibility.signals.notebookCellCompleted.announcement": "Thông báo khi ô sổ tay hoàn thành thực thi thành công.",
    "accessibility.signals.notebookCellCompleted.sound": "Phát âm thanh khi ô sổ tay hoàn thành thực thi thành công.",
    "accessibility.signals.notebookCellFailed": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi ô sổ tay gặp lỗi trong quá trình thực thi.",
    "accessibility.signals.notebookCellFailed.announcement": "Thông báo khi ô sổ tay gặp lỗi trong quá trình thực thi.",
    "accessibility.signals.notebookCellFailed.sound": "Phát âm thanh khi ô sổ tay gặp lỗi trong quá trình thực thi.",
    "accessibility.signals.onDebugBreak": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi trình gỡ lỗi dừng tại điểm ngắt.",
    "accessibility.signals.onDebugBreak.announcement": "Thông báo khi trình gỡ lỗi dừng tại điểm ngắt.",
    "accessibility.signals.onDebugBreak.sound": "Phát âm thanh khi trình gỡ lỗi dừng tại điểm ngắt.",
    "accessibility.signals.positionHasError": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.positionHasError.announcement": "Thông báo khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.positionHasError.sound": "Phát âm thanh khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.positionHasWarning": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.positionHasWarning.announcement": "Thông báo khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.positionHasWarning.sound": "Phát âm thanh khi dòng đang hoạt động có cảnh báo.",
    "accessibility.signals.progress": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) lặp lại trong khi tiến trình đang diễn ra.",
    "accessibility.signals.progress.announcement": "Cảnh báo lặp lại trong khi tiến trình đang diễn ra.",
    "accessibility.signals.progress.sound": "Phát âm thanh lặp lại trong khi tiến trình đang diễn ra.",
    "accessibility.signals.save": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi tệp được lưu.",
    "accessibility.signals.save.announcement": "Thông báo khi tệp được lưu.",
    "accessibility.signals.save.announcement.always": "Thông báo khi tệp được lưu, kể cả khi lưu tự động.",
    "accessibility.signals.save.announcement.never": "Không bao giờ thông báo.",
    "accessibility.signals.save.announcement.userGesture": "Thông báo khi người dùng lưu tệp một cách rõ ràng.",
    "accessibility.signals.save.sound": "Phát âm thanh khi tệp được lưu.",
    "accessibility.signals.save.sound.always": "Phát âm thanh mỗi khi tệp được lưu, kể cả khi lưu tự động.",
    "accessibility.signals.save.sound.never": "Không bao giờ phát âm thanh.",
    "accessibility.signals.save.sound.userGesture": "Phát âm thanh khi người dùng lưu tệp một cách rõ ràng.",
    "accessibility.signals.sound": "Phát âm thanh khi tiêu điểm di chuyển đến dòng được chèn trong chế độ xem khác biệt có thể truy cập hoặc đến thay đổi tiếp theo hoặc trước đó.",
    "accessibility.signals.taskCompleted": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi nhiệm vụ hoàn thành.",
    "accessibility.signals.taskCompleted.announcement": "Thông báo khi nhiệm vụ hoàn thành.",
    "accessibility.signals.taskCompleted.sound": "Phát âm thanh khi nhiệm vụ hoàn thành.",
    "accessibility.signals.taskFailed": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi nhiệm vụ gặp lỗi (mã thoát không phải là số không).",
    "accessibility.signals.taskFailed.announcement": "Thông báo khi nhiệm vụ gặp lỗi (mã thoát không phải là số không).",
    "accessibility.signals.taskFailed.sound": "Phát âm thanh khi nhiệm vụ gặp lỗi (mã thoát không phải là số không).",
    "accessibility.signals.terminalBell": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi chuông terminal kêu.",
    "accessibility.signals.terminalBell.announcement": "Thông báo khi chuông terminal kêu.",
    "accessibility.signals.terminalBell.sound": "Phát âm thanh khi chuông terminal kêu.",
    "accessibility.signals.terminalCommandFailed": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) khi lệnh terminal gặp lỗi (mã thoát không phải là số không) hoặc khi điều hướng đến lệnh với mã thoát như vậy trong chế độ xem có thể truy cập.",
    "accessibility.signals.terminalCommandFailed.announcement": "Thông báo khi lệnh terminal gặp lỗi (mã thoát không phải là số không) hoặc khi điều hướng đến lệnh với mã thoát như vậy trong chế độ xem có thể truy cập.",
    "accessibility.signals.terminalCommandFailed.sound": "Phát âm thanh khi lệnh terminal gặp lỗi (mã thoát không phải là số không) hoặc khi điều hướng đến lệnh với mã thoát như vậy trong chế độ xem có thể truy cập.",
    "accessibility.signals.terminalCommandSucceeded": "Phát tín hiệu — âm thanh (gợi ý âm thanh) và/hoặc thông báo (cảnh báo) — khi lệnh terminal thực thi thành công (mã thoát bằng không) hoặc khi điều hướng đến lệnh với mã thoát như vậy trong chế độ xem có thể truy cập.",
    "accessibility.signals.terminalCommandSucceeded.announcement": "Thông báo khi lệnh terminal thực thi thành công (mã thoát bằng không) hoặc khi điều hướng đến lệnh với mã thoát như vậy trong chế độ xem có thể truy cập.",
    "accessibility.signals.terminalCommandSucceeded.sound": "Phát âm thanh khi lệnh terminal thực thi thành công (mã thoát bằng không) hoặc khi điều hướng đến lệnh với mã thoát như vậy trong chế độ xem có thể truy cập.",
    "accessibility.signals.terminalQuickFix": "Phát tín hiệu hoặc âm thanh (gợi ý âm thanh) hoặc thông báo (cảnh báo) khi có các sửa lỗi nhanh terminal.",
    "accessibility.signals.terminalQuickFix.announcement": "Thông báo khi có các sửa lỗi nhanh terminal.",
    "accessibility.signals.terminalQuickFix.sound": "Phát âm thanh khi có các sửa lỗi nhanh terminal.",
    "accessibility.signals.voiceRecordingStarted": "Phát âm thanh hoặc gợi ý âm thanh khi bắt đầu ghi âm giọng nói.",
    "accessibility.signals.voiceRecordingStarted.sound": "Phát âm thanh khi bắt đầu ghi âm giọng nói.",
    "accessibility.signals.voiceRecordingStopped": "Phát âm thanh hoặc gợi ý âm thanh khi dừng ghi âm giọng nói.",
    "accessibility.signals.voiceRecordingStopped.sound": "Phát âm thanh khi dừng ghi âm giọng nói.",
    "accessibility.underlineLinks": "Kiểm soát liệu các liên kết có nên được gạch chân trong không gian làm việc hay không.",
    "accessibility.verboseChatProgressUpdates": "Kiểm soát liệu có nên thực hiện các thông báo chi tiết về tiến trình khi có yêu cầu trò chuyện đang diễn ra, bao gồm thông tin như văn bản được tìm kiếm cho <từ khóa tìm kiếm> với X kết quả, tệp được tạo <tên tệp> hoặc tệp được đọc <đường dẫn tệp>.",
    "accessibility.voice.autoSynthesize.off": "Vô hiệu hóa tính năng.",
    "accessibility.voice.autoSynthesize.on": "Bật tính năng. Khi bật trình đọc màn hình, lưu ý rằng điều này sẽ vô hiệu hóa các cập nhật aria.",
    "accessibility.windowTitleOptimized": "Kiểm soát liệu {0} có nên được tối ưu hóa cho trình đọc màn hình trong chế độ đọc màn hình. Khi được bật, tiêu đề cửa sổ sẽ có {1} được thêm vào cuối.",
    "accessibilityConfigurationTitle": "Khả năng truy cập",
    "announcement.enabled.auto": "Bật thông báo. Chỉ phát khi ở chế độ tối ưu hóa trình đọc màn hình.",
    "announcement.enabled.off": "Vô hiệu hóa thông báo.",
    "autoSynthesize": "Liệu phản hồi văn bản có nên được đọc to tự động khi sử dụng giọng nói làm đầu vào. Ví dụ, trong phiên trò chuyện, phản hồi sẽ được tổng hợp tự động khi sử dụng giọng nói làm yêu cầu trò chuyện.",
    "dimUnfocusedEnabled": "Cho biết liệu các terminal và trình chỉnh sửa không có tiêu điểm có bị làm mờ hay không, giúp rõ ràng hơn nơi nhập liệu sẽ được gửi đến. Hoạt động với hầu hết các trình chỉnh sửa, ngoại trừ những trình sử dụng iframe như sổ tay và trình chỉnh sửa chế độ xem web của tiện ích mở rộng.",
    "dimUnfocusedOpacity": "Tỷ lệ độ mờ (từ 0,2 đến 1,0) được sử dụng cho các trình chỉnh sửa và terminal không có tiêu điểm. Điều này chỉ có hiệu lực khi {0} được bật.",
    "replEditor.autoFocusAppendedCell": "Kiểm soát liệu tiêu điểm có nên được gửi tự động đến REPL khi mã được thực thi."
{
  "sound.enabled.auto": "Kích hoạt âm thanh khi kết nối trình đọc màn hình.",
  "sound.enabled.autoWindow": "Kích hoạt âm thanh khi kết nối trình đọc màn hình.",
  "sound.enabled.off": "Tắt âm thanh.",
  "sound.enabled.on": "Bật âm thanh.",
  "speechLanguage.auto": "Tự động (sử dụng ngôn ngữ hiển thị)",
  "terminal.integrated.accessibleView.closeOnKeyPress": "Khi nhấn phím, đóng chế độ xem dễ tiếp cận và tập trung vào phần tử đã gọi.",
  "verbosity.chat.description": "Cung cấp thông tin về cách truy cập menu trợ giúp trò chuyện khi ô nhập trò chuyện được tập trung.",
  "verbosity.comments": "Cung cấp thông tin về các hành động có thể thực hiện trên tiện ích bình luận hoặc tệp chứa bình luận.",
  "verbosity.debug": "Cung cấp thông tin về cách truy cập hộp thoại trợ giúp dễ tiếp cận của bảng điều khiển gỡ lỗi khi bảng điều khiển gỡ lỗi hoặc chế độ xem chạy và gỡ lỗi được tập trung. Lưu ý rằng cần tải lại cửa sổ để áp dụng thay đổi này.",
  "verbosity.diffEditor.description": "Cung cấp thông tin về cách điều hướng các thay đổi trong trình chỉnh sửa khác biệt khi được tập trung.",
  "verbosity.diffEditorActive": "Cho biết khi nào trình chỉnh sửa khác biệt trở thành trình chỉnh sửa đang hoạt động.",
  "verbosity.emptyEditorHint": "Cung cấp thông tin về các hành động liên quan trong trình chỉnh sửa văn bản trống.",
  "verbosity.hover": "Cung cấp thông tin về cách mở con trỏ trong chế độ xem dễ tiếp cận.",
  "verbosity.inlineCompletions.description": "Cung cấp thông tin về cách truy cập giữ chuột trong quá trình hoàn thành nội tuyến và chế độ xem dễ tiếp cận.",
  "verbosity.interactiveEditor.description": "Cung cấp thông tin về cách truy cập menu trợ giúp dễ tiếp cận của trò chuyện trong trình chỉnh sửa nội tuyến và cảnh báo với các gợi ý mô tả cách sử dụng tính năng khi ô nhập được tập trung.",
  "verbosity.keybindingsEditor.description": "Cung cấp thông tin về cách thay đổi phím tắt trong trình chỉnh sửa phím tắt khi một hàng được tập trung.",
  "verbosity.notebook": "Cung cấp thông tin về cách tập trung vào vùng chứa ô hoặc trình chỉnh sửa bên trong khi một ô trong sổ tay được tập trung.",
  "verbosity.notification": "Cung cấp thông tin về cách mở thông báo trong chế độ xem dễ tiếp cận.",
  "verbosity.replEditor.description": "Cung cấp thông tin về cách truy cập menu trợ giúp dễ tiếp cận của trình chỉnh sửa REPL khi trình chỉnh sửa REPL được tập trung.",
  "verbosity.scm": "Cung cấp thông tin về cách truy cập menu trợ giúp dễ tiếp cận của kiểm soát mã nguồn khi ô nhập được tập trung.",
  "verbosity.terminal.description": "Cung cấp thông tin về cách truy cập menu trợ giúp dễ tiếp cận của terminal khi terminal được tập trung.",
  "verbosity.walkthrough": "Cung cấp thông tin về cách mở hướng dẫn trong chế độ xem dễ tiếp cận.",
  "voice.ignoreCodeBlocks": "Cho biết liệu các đoạn mã có nên được bỏ qua trong chuyển đổi văn bản thành giọng nói hay không.",
  "voice.speechLanguage": "Ngôn ngữ sử dụng cho chuyển đổi văn bản thành giọng nói và nhận diện giọng nói thành văn bản. Chọn \"tự động\" để sử dụng ngôn ngữ hiển thị nếu có thể. Lưu ý rằng không phải tất cả các ngôn ngữ hiển thị đều được hỗ trợ cho nhận diện giọng nói và bộ tổng hợp giọng nói.",
  "voice.speechTimeout": "Thời gian tính bằng mili giây mà nhận diện giọng nói vẫn hoạt động sau khi ngừng nói. Ví dụ, trong phiên trò chuyện, văn bản được chuyển thành sẽ tự động gửi khi hết thời gian chờ. Đặt thành \"0\" để tắt tính năng này."
},
"vs/workbench/contrib/accessibility/browser/accessibilityStatus": {
  "screenReaderDetected": "Đã tối ưu hóa cho trình đọc màn hình",
  "screenReaderDetectedExplanation.answerLearnMore": "Tìm hiểu thêm",
  "screenReaderDetectedExplanation.answerNo": "Không",
  "screenReaderDetectedExplanation.answerYes": "Có",
  "screenReaderDetectedExplanation.question": "Đã phát hiện sử dụng trình đọc màn hình. Bạn có muốn bật {0} để tối ưu hóa trình chỉnh sửa cho trình đọc màn hình không?",
  "status.editor.screenReaderMode": "Chế độ trình đọc màn hình"
},
"vs/workbench/contrib/accessibility/browser/accessibleView": {
  "accessibility-help": "Trợ giúp dễ tiếp cận",
  "accessibility-help-hint": "Trợ giúp dễ tiếp cận, {0}",
  "accessible-view": "Chế độ xem dễ tiếp cận",
  "accessible-view-hint": "Chế độ xem dễ tiếp cận, {0}",
  "accessibleHelpToolbar": "Trợ giúp dễ tiếp cận",
  "accessibleViewNextPreviousHint": "Hiển thị phần tử tiếp theo{0} hoặc phần tử trước đó{1}.",
  "accessibleViewSymbolQuickPickPlaceholder": "Nhập để tìm kiếm biểu tượng",
  "accessibleViewSymbolQuickPickTitle": "Đi tới biểu tượng trong chế độ xem dễ tiếp cận",
  "accessibleViewToolbar": "Chế độ xem dễ tiếp cận",
  "acessibleViewDisableHint": "\r\nTắt mức độ chi tiết dễ tiếp cận cho tính năng này{0}.",
  "acessibleViewHint": "Kiểm tra trong chế độ xem dễ tiếp cận với {0}",
  "acessibleViewHintNoKbEither": "Kiểm tra trong chế độ xem dễ tiếp cận bằng lệnh Mở chế độ xem dễ tiếp cận, hiện không thể kích hoạt bằng phím tắt.",
  "ariaAccessibleViewActions": "Khám phá các hành động như tắt gợi ý này (Shift+Tab).",
  "ariaAccessibleViewActionsBottom": "Khám phá các hành động như tắt gợi ý này (Shift+Tab), sử dụng Escape để thoát hộp thoại này.",
  "configureKb": "\r\nCấu hình phím tắt cho các lệnh chưa có phím tắt {0}.",
  "configureKbAssigned": "\r\nCấu hình phím tắt cho các lệnh đã có phím tắt {0}.",
  "disableAccessibilityHelp": "Mức độ chi tiết dễ tiếp cận {0} hiện đã bị tắt",
  "exit": "\r\nThoát hộp thoại này (Escape).",
  "goToSymbolHint": "Đi tới biểu tượng{0}.",
  "insertAtCursor": " - Chèn khối mã tại con trỏ{0}.",
  "insertIntoNewFile": " - Chèn khối mã vào tệp mới{0}.",
  "intro": "Trong chế độ xem dễ tiếp cận, bạn có thể:\r\n",
  "keybindings": "Cấu hình phím tắt",
  "openDoc": "\r\nMở cửa sổ trình duyệt với thông tin liên quan đến dễ tiếp cận{0}.",
  "runInTerminal": " - Chạy khối mã trong terminal{0}.\r\n",
  "selectKeybinding": "Chọn một ID lệnh để cấu hình phím tắt cho nó",
  "symbolLabel": "({0}) {1}",
  "symbolLabelAria": "({0}) {1}",
  "toolbar": "Đi tới thanh công cụ (Shift+Tab)."
},
"vs/workbench/contrib/accessibility/browser/accessibleViewActions": {
  "editor.action.accessibilityHelp": "Mở trợ giúp dễ tiếp cận",
  "editor.action.accessibilityHelpConfigureAssignedKeybindings": "Trợ giúp dễ tiếp cận để cấu hình phím tắt đã gán",
  "editor.action.accessibilityHelpConfigureUnassignedKeybindings": "Trợ giúp dễ tiếp cận để cấu hình phím tắt chưa gán",
  "editor.action.accessibilityHelpOpenHelpLink": "Trợ giúp dễ tiếp cận để mở liên kết trợ giúp",
  "editor.action.accessibleView": "Mở chế độ xem dễ tiếp cận",
  "editor.action.accessibleViewAcceptInlineCompletionAction": "Chấp nhận hoàn thành nội tuyến",
  "editor.action.accessibleViewDisableHint": "Tắt gợi ý chế độ xem dễ tiếp cận",
  "editor.action.accessibleViewGoToSymbol": "Đi tới biểu tượng trong chế độ xem dễ tiếp cận",
  "editor.action.accessibleViewNext": "Hiển thị tiếp theo trong chế độ xem dễ tiếp cận",
  "editor.action.accessibleViewNextCodeBlock": "Chế độ xem dễ tiếp cận: Khối mã tiếp theo",
  "editor.action.accessibleViewPrevious": "Hiển thị trước đó trong chế độ xem dễ tiếp cận",
  "editor.action.accessibleViewPreviousCodeBlock": "Chế độ xem dễ tiếp cận: Khối mã trước đó"
},
"vs/workbench/contrib/accessibilitySignals/browser/commands": {
  "accessibility.announcement.help": "Trợ giúp: liệt kê các thông báo tín hiệu",
  "accessibility.announcement.help.description": "Liệt kê tất cả các thông báo, cảnh báo, thông điệp braille dễ tiếp cận và cấu hình tùy chọn của chúng",
  "accessibility.sound.help.description": "Liệt kê tất cả các âm thanh, tiếng ồn hoặc tín hiệu âm thanh dễ tiếp cận và cấu hình tùy chọn của chúng",
  "announcement.help.placeholder": "Chọn một thông báo để cấu hình",
  "announcement.help.placeholder.disabled": "Trình đọc màn hình không hoạt động. Các thông báo bị tắt theo mặc định.",
  "announcement.help.settings": "Cấu hình thông báo",
  "signals.sound.help": "Trợ giúp: liệt kê âm thanh tín hiệu",
  "sounds.help.placeholder": "Chọn một âm thanh để phát và cấu hình",
  "sounds.help.settings": "Cấu hình âm thanh"
},
"vs/workbench/contrib/accessibilitySignals/browser/openDiffEditorAnnouncement": {
  "openDiffEditorAnnouncement": "Trình chỉnh sửa khác biệt"
},
"vs/workbench/contrib/accountEntitlements/browser/accountsEntitlements.contribution": {
  "workbench.accounts.showEntitlements": "Khi được bật, các quyền lợi có sẵn cho tài khoản sẽ được hiển thị trong menu tài khoản."
},
"vs/workbench/contrib/audioCues/browser/audioCues.contribution": {
  "audioCues.chatRequestSent": "Phát âm thanh khi một yêu cầu trò chuyện được gửi.",
  "audioCues.chatResponsePending": "Phát âm thanh lặp lại khi phản hồi đang chờ xử lý.",
  "audioCues.chatResponseReceived": "Phát âm thanh lặp lại khi phản hồi đã được nhận.",
  "audioCues.clear": "Phát âm thanh khi một tính năng được xóa (ví dụ: terminal, bảng điều khiển gỡ lỗi hoặc kênh đầu ra). Khi tùy chọn này bị tắt, một cảnh báo ARIA sẽ thông báo \"Đã xóa\".",
  "audioCues.debouncePositionChanges": "Có nên hủy các thay đổi vị trí hay không",
  "audioCues.diffLineDeleted": "Phát âm thanh khi tiêu điểm di chuyển đến một dòng bị xóa trong chế độ xem khác biệt dễ tiếp cận hoặc khi chuyển đến thay đổi tiếp theo hoặc trước đó.",
  "audioCues.diffLineInserted": "Phát âm thanh khi tiêu điểm di chuyển đến một dòng được chèn trong chế độ xem khác biệt dễ tiếp cận hoặc khi chuyển đến thay đổi tiếp theo hoặc trước đó.",
  "audioCues.diffLineModified": "Phát âm thanh khi tiêu điểm di chuyển đến một dòng được sửa đổi trong chế độ xem khác biệt dễ tiếp cận hoặc khi chuyển đến thay đổi tiếp theo hoặc trước đó.",
  "audioCues.enabled.auto": "Bật tín hiệu âm thanh khi kết nối trình đọc màn hình.",
  "audioCues.enabled.off": "Tắt tín hiệu âm thanh.",
  "audioCues.enabled.on": "Bật tín hiệu âm thanh.",
  "audioCues.format": "Phát âm thanh khi định dạng tệp hoặc sổ tay. Xem thêm {0}",
  "audioCues.format.always": "Phát tín hiệu âm thanh mỗi khi tệp được định dạng, bao gồm khi định dạng lúc lưu, ghi hoặc dán hoặc thực thi một ô.",
  "audioCues.format.never": "Không bao giờ phát tín hiệu âm thanh.",
  "audioCues.format.userGesture": "Phát tín hiệu âm thanh khi người dùng định dạng tệp một cách rõ ràng.",
  "audioCues.lineHasBreakpoint": "Phát âm thanh khi dòng đang hoạt động có điểm dừng.",
  "audioCues.lineHasError": "Phát âm thanh khi dòng đang hoạt động có lỗi.",
  "audioCues.lineHasFoldedArea": "Phát âm thanh khi dòng đang hoạt động có khu vực gấp có thể mở ra.",
  "audioCues.lineHasInlineSuggestion": "Phát âm thanh khi dòng đang hoạt động có gợi ý nội tuyến.",
  "audioCues.lineHasWarning": "Phát âm thanh khi dòng đang hoạt động có cảnh báo.",
  "audioCues.noInlayHints": "Phát âm thanh khi cố gắng đọc một dòng có gợi ý nội tuyến nhưng không có gợi ý nội tuyến.",
  "audioCues.notebookCellCompleted": "Phát âm thanh khi thực thi một ô trong sổ tay hoàn tất thành công.",
  "audioCues.notebookCellFailed": "Phát âm thanh khi thực thi một ô trong sổ tay gặp lỗi.",
  "audioCues.onDebugBreak": "Phát âm thanh khi trình gỡ lỗi dừng tại một điểm dừng.",
  "audioCues.save": "Phát âm thanh khi một tệp được lưu. Xem thêm {0}",
  "audioCues.save.always": "Phát tín hiệu âm thanh mỗi khi tệp được lưu, bao gồm lưu tự động.",
  "audioCues.save.never": "Không bao giờ phát tín hiệu âm thanh.",
  "audioCues.save.userGesture": "Phát tín hiệu âm thanh khi người dùng lưu tệp một cách rõ ràng.",
  "audioCues.taskCompleted": "Phát âm thanh khi một nhiệm vụ hoàn tất.",
  "audioCues.taskFailed": "Phát âm thanh khi một nhiệm vụ gặp lỗi (mã thoát khác không).",
  "audioCues.terminalCommandFailed": "Phát âm thanh khi một lệnh terminal gặp lỗi (mã thoát khác không).",
  "audioCues.terminalQuickFix": "Phát âm thanh khi có các sửa lỗi nhanh terminal.",
  "audioCues.volume": "Âm lượng của tín hiệu âm thanh theo phần trăm (0-100)."
},
"vs/workbench/contrib/audioCues/browser/commands": {
  "accessibility.alert.help": "Trợ giúp: danh sách cảnh báo",
  "alerts.help.placeholder": "Kiểm tra và cấu hình trạng thái của một cảnh báo",
  "alerts.help.settings": "Bật/tắt tín hiệu âm thanh",
  "audioCues.help": "Trợ giúp: liệt kê tín hiệu âm thanh",
  "audioCues.help.placeholder": "Chọn một tín hiệu âm thanh để phát",
  "audioCues.help.settings": "Bật/tắt tín hiệu âm thanh",
  "disabled": "Đã tắt"
},
"vs/workbench/contrib/authentication/browser/actions/manageAccountPreferencesForExtensionAction": {
  "accounts": "Tài khoản",
  "currentAccount": "Tài khoản hiện tại",
  "manageAccountPreferenceForExtension": "Quản lý tùy chọn tài khoản cho tiện ích mở rộng",
  "noAccountUsage": "Tiện ích mở rộng này chưa được sử dụng trên bất kỳ tài khoản nào.",
  "noAccounts": "Tiện ích mở rộng này hiện không sử dụng tài khoản.",
  "pickAProviderTitle": "Quản lý tùy chọn tài khoản cho tiện ích mở rộng",
  "placeholder v2": "Quản lý tùy chọn tài khoản \"{0}\" cho {1}...",
  "selectExtension": "Chọn một tiện ích mở rộng để quản lý tùy chọn tài khoản",
  "selectProvider": "Chọn một nhà cung cấp xác thực để quản lý tùy chọn tài khoản",
  "title": "Tùy chọn tài khoản '{0}' cho không gian làm việc này",
  "use new account": "Sử dụng tài khoản mới..."
},
"vs/workbench/contrib/authentication/browser/actions/manageAccountPreferencesForMcpServerAction": {
  "accounts": "Tài khoản",
  "currentAccount": "Tài khoản hiện tại",
  "manageAccountPreferenceForMcpServer": "Quản lý tùy chọn tài khoản cho máy chủ MCP",
  "noAccountUsage": "Máy chủ MCP này chưa sử dụng bất kỳ tài khoản nào.",
  "noAccounts": "Máy chủ MCP này hiện không sử dụng tài khoản.",
  "pickAProviderTitle": "Quản lý tùy chọn tài khoản cho máy chủ MCP",
  "placeholder v2": "Quản lý tùy chọn tài khoản \"{0}\" cho {1}...",
  "selectProvider": "Chọn một nhà cung cấp xác thực để quản lý tùy chọn tài khoản",
  "title": "Tùy chọn tài khoản '{0}' cho không gian làm việc này",
  "use new account": "Sử dụng tài khoản mới..."
},
"vs/workbench/contrib/authentication/browser/actions/manageDynamicAuthenticationProvidersAction": {
  "authenticationCategory": "Xác thực",
  "clientId": "ID khách hàng: {0}",
  "confirmDeleteDetail": "Điều này sẽ xóa tất cả dữ liệu xác thực được lưu trữ cho các nhà cung cấp đã chọn. Bạn sẽ phải xác thực lại nếu sử dụng các nhà cung cấp này lần nữa.",
  "confirmDeleteMultipleProviders": "Bạn có chắc chắn muốn xóa {0} nhà cung cấp xác thực động: {1}?",
  "confirmDeleteSingleProvider": "Bạn có chắc chắn muốn xóa nhà cung cấp xác thực động \"{0}\"?",
  "noDynamicProviders": "Không có nhà cung cấp xác thực động",
  "noDynamicProvidersDetail": "Chưa sử dụng nhà cung cấp xác thực động nào.",
  "remove": "Xóa",
  "removeDynamicAuthProviders": "Xóa nhà cung cấp xác thực động",
  "selectProviderToRemove": "Chọn một nhà cung cấp xác thực động để xóa"
},
"vs/workbench/contrib/authentication/browser/actions/manageTrustedExtensionsForAccountAction": {
  "accountLastUsedDate": "Lần sử dụng gần nhất của tài khoản này {0}",
  "accountPreferences": "Quản lý tùy chọn tài khoản cho tiện ích mở rộng này",
  "accounts": "Tài khoản",
  "manageExtensions": "Chọn tiện ích mở rộng nào có thể truy cập tài khoản này",
  "manageTrustedExtensions": "Quản lý tiện ích mở rộng đáng tin cậy",
  "manageTrustedExtensions.cancel": "Hủy",
  "manageTrustedExtensionsForAccount": "Quản lý tiện ích mở rộng đáng tin cậy cho tài khoản",
  "noTrustedExtensions": "Tài khoản này chưa được sử dụng trong bất kỳ tiện ích mở rộng nào.",
  "notUsed": "Chưa sử dụng tài khoản này",
  "pickAccount": "Chọn một tài khoản để quản lý tiện ích mở rộng đáng tin cậy",
  "trustedExtensionTooltip": "Tiện ích mở rộng này được Microsoft tin cậy và\r\nluôn có quyền truy cập vào tài khoản này",
  "trustedExtensions": "Được Microsoft tin cậy"
},
"vs/workbench/contrib/authentication/browser/actions/manageTrustedMcpServersForAccountAction": {
  "accountLastUsedDate": "Lần sử dụng gần nhất của tài khoản này {0}",
  "accountPreferences": "Quản lý tùy chọn tài khoản cho máy chủ MCP này",
  "accounts": "Tài khoản",
  "manageMcpServers": "Chọn máy chủ MCP nào có thể truy cập tài khoản này",
  "manageTrustedMcpServers": "Quản lý máy chủ MCP đáng tin cậy",
  "manageTrustedMcpServers.cancel": "Hủy",
  "manageTrustedMcpServersForAccount": "Quản lý máy chủ MCP đáng tin cậy cho tài khoản",
  "noTrustedMcpServers": "Tài khoản này chưa được sử dụng trong bất kỳ máy chủ MCP nào.",
  "notUsed": "Chưa sử dụng tài khoản này",
  "pickAccount": "Chọn một tài khoản để quản lý máy chủ MCP đáng tin cậy",
  "trustedMcpServerTooltip": "Máy chủ MCP này được Microsoft tin cậy và\r\nluôn có quyền truy cập vào tài khoản này",
  "trustedMcpServers": "Được Microsoft tin cậy"
},
"vs/workbench/contrib/authentication/browser/actions/signOutOfAccountAction": {
  "signOut": "&&Đăng xuất",
  "signOutMessage": "Tài khoản '{0}' đã được sử dụng bởi:\r\n\r\n{1}\r\n\r\n Đăng xuất khỏi các tiện ích mở rộng này?",
  "signOutMessageSimple": "Đăng xuất khỏi \"{0}\"?",
  "signOutOfAccount": "Đăng xuất khỏi tài khoản"
},
"vs/workbench/contrib/authentication/browser/authentication.contribution": {
  "authentication": "Xác thực",
  "authenticationMcpAuthorizationServers": "Máy chủ ủy quyền MCP",
  "authenticationid": "ID",
  "authenticationlabel": "Nhãn"
},
"vs/workbench/contrib/bulkEdit/browser/bulkEditService": {
  "areYouSureQuiteBulkEdit.detail": "\"{0}\" đang được tiến hành.",
  "changeWorkspace.message": "Bạn có chắc chắn muốn thay đổi không gian làm việc?",
  "closeTheWindow.message": "Bạn có chắc chắn muốn đóng cửa sổ?",
  "fileOperation": "Thao tác tệp",
  "nothing": "Không thực hiện chỉnh sửa nào",
  "quitMessage": "Bạn có chắc chắn muốn thoát?",
  "quitMessageMac": "Bạn có chắc chắn muốn thoát?",
  "refactoring.autoSave": "Kiểm soát liệu các tệp thuộc một phần của việc tái cấu trúc có được lưu tự động hay không",
  "reloadTheWindow.message": "Bạn có chắc chắn muốn tải lại cửa sổ?",
  "summary.0": "Không thực hiện chỉnh sửa nào",
  "summary.n0": "{0} chỉnh sửa văn bản trong một tệp",
  "summary.nm": "{0} chỉnh sửa văn bản trong {1} tệp",
  "summary.textFiles": "Đã thực hiện {0} chỉnh sửa văn bản trong {1} tệp, đồng thời tạo hoặc xóa {2} tệp",
  "workspaceEdit": "Chỉnh sửa không gian làm việc"
},
"vs/workbench/contrib/bulkEdit/browser/preview/bulkEdit.contribution": {
  "Discard": "Hủy tái cấu trúc",
  "apply": "Áp dụng tái cấu trúc",
  "cat": "Xem trước tái cấu trúc",
  "continue": "&&Tiếp tục",
  "detail": "Nhấn \"Tiếp tục\" để hủy tái cấu trúc trước đó và tiếp tục với tái cấu trúc hiện tại.",
  "groupByFile": "Nhóm các thay đổi theo tệp",
  "groupByType": "Nhóm các thay đổi theo loại",
  "overlap": "Đang xem trước một tái cấu trúc khác.",
  "panel": "Xem trước tái cấu trúc",
  "refactorPreviewViewIcon": "Xem biểu tượng xem trước tái cấu trúc.",
  "toogleSelection": "Chuyển đổi thay đổi"
},
"vs/workbench/contrib/bulkEdit/browser/preview/bulkEditPane": {
  "cancel": "Hủy",
  "conflict.1": "Không thể áp dụng tái cấu trúc vì \"{0}\" đã thay đổi trong khi đó.",
  "conflict.N": "Không thể áp dụng tái cấu trúc vì {0} tệp khác đã thay đổi trong khi đó.",
  "empty.msg": "Gọi một hành động mã, như đổi tên, để xem trước các thay đổi của bạn tại đây.",
  "ok": "Áp dụng"
},
"vs/workbench/contrib/bulkEdit/browser/preview/bulkEditPreview": {
  "default": "Khác"
},
"vs/workbench/contrib/bulkEdit/browser/preview/bulkEditTree": {
  "aria.create": "Đang tạo {0}",
  "aria.createAndEdit": "Đang tạo {0}, đồng thời chỉnh sửa văn bản",
  "aria.del": "dòng {0}, đang xóa {1}",
  "aria.delete": "Đang xóa {0}",
  "aria.deleteAndEdit": "Đang xóa {0}, đồng thời thực hiện chỉnh sửa văn bản",
  "aria.editOnly": "{0}, đang chỉnh sửa văn bản",
  "aria.insert": "dòng {0}, đang chèn {1}",
  "aria.rename": "Đổi tên {0} thành {1}",
  "aria.renameAndEdit": "Đổi tên {0} thành {1}, đồng thời thực hiện chỉnh sửa văn bản",
  "aria.replace": "Dòng {0}, thay thế {1} bằng {2}",
  "bulkEdit": "Chỉnh sửa hàng loạt",
  "detail.create": "(đang tạo)",
  "detail.del": "(đang xóa)",
  "detail.rename": "(đổi tên)",
  "rename.label": "{0} → {1}",
  "title": "{0} - {1}"
},
"vs/workbench/contrib/callHierarchy/browser/callHierarchy.contribution": {
  "callHierarchyDirection": "Cho biết liệu hệ thống phân cấp cuộc gọi hiển thị các cuộc gọi đến hay đi",
  "callHierarchyVisible": "Cho biết liệu việc kiểm tra hệ thống phân cấp cuộc gọi có được hiển thị hay không",
  "close": "Đóng",
  "editorHasCallHierarchyProvider": "Cho biết liệu có nhà cung cấp hệ thống phân cấp cuộc gọi hay không",
  "error": "Không thể hiển thị hệ thống phân cấp cuộc gọi",
  "no.item": "Không có kết quả",
  "showIncomingCallsIcons": "Biểu tượng cuộc gọi đến trong chế độ xem hệ thống phân cấp cuộc gọi.",
  "showOutgoingCallsIcon": "Biểu tượng cuộc gọi đi trong chế độ xem hệ thống phân cấp cuộc gọi.",
  "title": "Kiểm tra hệ thống phân cấp cuộc gọi",
  "title.incoming": "Hiển thị cuộc gọi đến",
  "title.outgoing": "Hiển thị cuộc gọi đi",
  "title.refocus": "Tập trung lại hệ thống phân cấp cuộc gọi"
},
"vs/workbench/contrib/callHierarchy/browser/callHierarchyPeek": {
  "callFrom": "Cuộc gọi từ \"{0}\"",
  "callsTo": "Cuộc gọi tới \"{0}\"",
  "empt.callsFrom": "Không có cuộc gọi từ \"{0}\"",
  "empt.callsTo": "Không có người gọi tới \"{0}\"",
  "title.loading": "Đang tải..."
},
"vs/workbench/contrib/callHierarchy/browser/callHierarchyTree": {
  "from": "cuộc gọi từ {0}",
  "to": "người gọi tới {0}",
  "tree.aria": "Hệ thống phân cấp cuộc gọi"
},
"vs/workbench/contrib/chat/browser/actions/chatAccessibilityActions": {
  "chat.category": "Trò chuyện",
  "chatNotReady": "Giao diện trò chuyện chưa sẵn sàng.",
  "focusChatConfirmation": "Xác nhận tập trung trò chuyện",
  "noChatSession": "Không tìm thấy phiên trò chuyện nào đang hoạt động.",
  "noConfirmationRequired": "Không yêu cầu xác nhận trò chuyện"
},
"vs/workbench/contrib/chat/browser/actions/chatAccessibilityHelp": {
  "chat.announcement": "Phản hồi trò chuyện sẽ được thông báo khi đến. Một phản hồi sẽ cho biết số lượng khối mã, nếu có, và sau đó là phần còn lại của phản hồi.",
  "chat.differencePanel": "Chế độ xem trò chuyện bảng điều khiển là giao diện cố định, cũng hỗ trợ điều hướng qua các câu hỏi gợi ý tiếp theo, trong khi chế độ xem trò chuyện nhanh là giao diện tạm thời để thực hiện và xem các yêu cầu.",
  "chat.differenceQuick": "Chế độ xem trò chuyện nhanh là giao diện tạm thời để thực hiện và xem các yêu cầu, trong khi chế độ xem trò chuyện bảng điều khiển là giao diện cố định, cũng hỗ trợ điều hướng qua các câu hỏi gợi ý tiếp theo.",
  "chat.followUp": "Trong ô nhập, đi tới câu hỏi gợi ý tiếp theo (Shift+Tab) và nhấn Enter để thực hiện.",
  "chat.inspectResponse": "Trong ô nhập, kiểm tra phản hồi cuối cùng trong chế độ xem dễ tiếp cận{0}.",
  "chat.overview": "Chế độ xem trò chuyện nhanh bao gồm một ô nhập và danh sách các yêu cầu và phản hồi. Ô nhập được sử dụng để gửi yêu cầu và danh sách được sử dụng để hiển thị phản hồi.",
  "chat.progressVerbosity": "Trong khi xử lý yêu cầu trò chuyện, bạn sẽ nhận được cập nhật chi tiết về tiến độ nếu yêu cầu mất hơn 4 giây. Điều này bao gồm thông tin như văn bản đã tìm kiếm cho <search term> với X kết quả, tệp được tạo <file_name> hoặc tệp đã đọc <file path>. Bạn có thể tắt tính năng này bằng accessibility.verboseChatProgressUpdates.",
  "chat.requestHistory": "Trong ô nhập, sử dụng các phím mũi tên lên và xuống để điều hướng qua lịch sử yêu cầu. Chỉnh sửa ô nhập và nhấn Enter hoặc nút Gửi để thực hiện một yêu cầu mới.",
  "chat.signals": "Các tín hiệu dễ tiếp cận có thể được thay đổi qua cài đặt với tiền tố signals.chat. Theo mặc định, nếu một yêu cầu mất hơn 4 giây, bạn sẽ nghe thấy âm thanh cho biết tiến trình vẫn đang diễn ra.",
  "chatAgent.acceptTool": "Để chấp nhận một hành động của công cụ, sử dụng lệnh Chấp nhận xác nhận công cụ {0}.",
  "chatAgent.autoApprove": "Để tự động phê duyệt các hành động của công cụ mà không cần xác nhận thủ công, đặt {0} thành {1} trong cài đặt.",
  "chatAgent.openEditedFilesSetting": "Theo mặc định, khi các tệp được chỉnh sửa, chúng sẽ được mở. Để thay đổi hành vi này, đặt accessibility.openChatEditedFiles thành false trong cài đặt.",
  "chatAgent.overview": "Chế độ xem tác nhân trò chuyện được sử dụng để áp dụng các chỉnh sửa cho các tệp trong không gian làm việc của bạn, cho phép thực thi lệnh trong terminal và nhiều hơn nữa.",
  "chatAgent.runCommand": "Để thực hiện hành động, sử dụng lệnh công cụ Chạy lệnh {0}.",
  "chatAgent.userActionRequired": "Một cảnh báo sẽ thông báo khi cần hành động của người dùng. Ví dụ, nếu tác nhân muốn thực thi điều gì đó trong terminal, bạn sẽ nghe: Hành động cần thiết: Chạy lệnh trong terminal.",
  "chatEditing.acceptAllFiles": "- Giữ tất cả các chỉnh sửa{0}.",
  "chatEditing.acceptFile": "- Giữ{0} và Hoàn tác tệp{1}.",
  "chatEditing.acceptHunk": "Trong trình chỉnh sửa, Giữ{0}, Hoàn tác{1} hoặc Chuyển đổi sự khác biệt{2} cho thay đổi hiện tại.",
  "chatEditing.discardAllFiles": "- Hoàn tác tất cả các chỉnh sửa{0}.",
  "chatEditing.expectation": "Khi một yêu cầu được thực hiện, một chỉ báo tiến độ sẽ được phát trong khi các chỉnh sửa được áp dụng.",
  "chatEditing.format": "Bao gồm một ô nhập và một tập hợp các tệp làm việc (Shift+Tab).",
  "chatEditing.helpfulCommands": "Một số lệnh hữu ích bao gồm:",
  "chatEditing.openFileInDiff": "- Mở tệp trong{0} khác biệt.",
  "chatEditing.overview": "Chế độ xem chỉnh sửa trò chuyện được sử dụng để áp dụng các chỉnh sửa giữa các tệp.",
  "chatEditing.removeFileFromWorkingSet": "- Xóa tệp khỏi không gian làm việc{0}.",
  "chatEditing.review": "Sau khi các chỉnh sửa được áp dụng, một âm thanh sẽ được phát để cho biết tài liệu đã được mở và sẵn sàng để xem xét. Âm thanh có thể được tắt bằng accessibility.signals.chatEditModifiedFile.",
  "chatEditing.saveAllFiles": "- Lưu tất cả các tệp{0}.",
  "chatEditing.sections": "Điều hướng giữa các chỉnh sửa của trình chỉnh sửa với điều hướng{0} trước đó và tiếp theo{1}",
  "chatEditing.undoKeepSounds": "Các âm thanh sẽ được phát khi một thay đổi được chấp nhận hoặc hoàn tác. Các âm thanh có thể được tắt bằng accessibility.signals.editsKept và accessibility.signals.editsUndone.",
  "inlineChat.access": "Có thể được kích hoạt thông qua các hành động mã hoặc trực tiếp bằng lệnh: Trò chuyện nội tuyến: Bắt đầu trò chuyện nội tuyến{0}.",
  "inlineChat.contextActions": "Các hành động menu ngữ cảnh có thể thực hiện một yêu cầu với tiền tố /. Nhập / để phát hiện các lệnh sẵn sàng này.",
  "inlineChat.diff": "Khi ở trong trình chỉnh sửa khác biệt, vào chế độ xem xét với {0}. Sử dụng các phím mũi tên lên và xuống để di chuyển qua các dòng với các thay đổi được đề xuất.",
  "inlineChat.fix": "Nếu một hành động sửa lỗi được gọi, một phản hồi sẽ cho biết vấn đề với mã hiện tại. Một trình chỉnh sửa khác biệt sẽ được hiển thị và có thể được truy cập bằng cách nhấn Tab.",
  "inlineChat.inspectResponse": "Trong ô nhập, kiểm tra phản hồi trong chế độ xem dễ tiếp cận{0}.",
  "inlineChat.overview": "Trò chuyện nội tuyến được thực hiện trong một trình chỉnh sửa mã và tính đến lựa chọn hiện tại. Nó hữu ích cho việc thực hiện các thay đổi trong trình chỉnh sửa hiện tại. Ví dụ, sửa lỗi chẩn đoán, ghi tài liệu hoặc tái cấu trúc mã. Lưu ý rằng mã do AI tạo ra có thể không chính xác.",
  "inlineChat.requestHistory": "Trong ô nhập, sử dụng Hiển thị trước đó{0} và Hiển thị tiếp theo{1} để điều hướng qua lịch sử yêu cầu. Chỉnh sửa ô nhập và sử dụng Enter hoặc nút Gửi để thực hiện một yêu cầu mới.",
  "inlineChat.toolbar": "Sử dụng phím Tab để truy cập các phần điều kiện như lệnh, trạng thái, phản hồi tin nhắn và nhiều hơn nữa.",
  "workbench.action.chat.announceConfirmation": "Để tập trung vào các hộp thoại xác nhận trò chuyện đang chờ xử lý, gọi lệnh Trạng thái xác nhận trò chuyện{0}.",
  "workbench.action.chat.editing.attachFiles": "- Đính kèm tệp{0}.",
  "workbench.action.chat.focus": "Lệnh Tập trung trò chuyện{0} kích hoạt danh sách các yêu cầu và phản hồi của trò chuyện, có thể điều hướng bằng các phím mũi tên Lên và Xuống.",
  "workbench.action.chat.focusInput": "Nếu bạn muốn tập trung vào ô nhập cho các yêu cầu trò chuyện, gọi lệnh Tập trung ô nhập trò chuyện{0}.",
  "workbench.action.chat.newChat": "Để tạo một phiên trò chuyện mới, gọi lệnh{0}Trò chuyện mới.",
  "workbench.action.chat.nextCodeBlock": "Để tập trung vào khối mã tiếp theo trong một phản hồi, gọi lệnh Trò chuyện: Khối mã tiếp theo{0}.",
  "workbench.action.chat.undoEdits": "- Hoàn tác chỉnh sửa{0}."
},
"vs/workbench/contrib/chat/browser/actions/chatActions": {
  "actions.interactiveSession.focus": "Tập trung danh sách trò chuyện",
  "agent.newSession": "Bắt đầu phiên mới?",
  "agent.newSession.confirm": "Có",
  "agent.newSessionMessage": "Việc thay đổi chế độ trò chuyện sẽ kết thúc phiên chỉnh sửa hiện tại của bạn. Bạn có muốn thay đổi chế độ trò chuyện?",
  "chat.category": "Trò chuyện",
  "chat.clear.label": "Xóa tất cả các trò chuyện trong không gian làm việc",
  "chat.editToolApproval.label": "Chỉnh sửa phê duyệt công cụ",
  "chat.editToolApproval.title": "Cài đặt phê duyệt cho {0}",
  "chat.history.label": "Hiển thị các trò chuyện...",
  "chat.history.recent": "Các trò chuyện gần đây",
  "chat.history.rename": "Đổi tên",
  "chat.history.showMore": "Hiển thị thêm...",
  "chat.history.showMoreAgents": "Hiển thị thêm...",
  "chat.openNewChatToTheSide.label": "Mở trình chỉnh sửa trò chuyện mới bên cạnh",
  "chat.toggleDefaultVisibility.label": "Hiển thị chế độ xem theo mặc định",
  "chat.toolApproval.manual": "Luôn yêu cầu phê duyệt thủ công",
  "chat.toolApproval.profile": "Tự động phê duyệt ở cấp độ toàn cầu",
  "chat.toolApproval.session": "Tự động phê duyệt cho phiên này",
  "chat.toolApproval.workspace": "Tự động phê duyệt cho không gian làm việc này",
  "chatAndCompletionsQuotaExceeded": "Bạn đã đạt đến giới hạn hàng tháng của các hoàn thành mã và tin nhắn trò chuyện.",
  "chatQuotaExceeded": "Bạn đã đạt đến giới hạn hàng tháng của tin nhắn trò chuyện. Bạn vẫn còn các hoàn thành mã miễn phí.",
  "chatQuotaExceededButton": "Đã đạt giới hạn tin nhắn trò chuyện của gói GitHub Copilot Free. Nhấn để biết thêm chi tiết.",
  "chatSessions.newChatInSideBar": "Mở trò chuyện mới trong thanh bên",
  "chatSessions.openNewChatInNewWindow": "Mở trò chuyện mới trong cửa sổ mới",
  "chatWith": "Trò chuyện với tiện ích mở rộng",
  "completionsQuotaExceeded": "Bạn đã đạt đến giới hạn hàng tháng của các hoàn thành mã. Bạn vẫn còn các tin nhắn trò chuyện miễn phí.",
  "config.label": "Cấu hình trò chuyện...",
  "configureCompletions": "Cấu hình hoàn thành mã...",
  "copilotQuotaReached": "Đã đạt giới hạn GitHub Copilot",
  "currentChatLabel": "hiện tại",
  "dismiss": "Bỏ qua",
  "explain": "Giải thích",
  "fix": "Sửa lỗi",
  "generateCode": "Tạo mã",
  "generateDocs": "Tạo tài liệu",
  "generateInstructions": "Tạo tệp hướng dẫn không gian làm việc",
  "generateInstructions.short": "Tạo hướng dẫn",
  "generateTests": "Tạo bài kiểm tra",
  "interactiveSession.clearHistory.label": "Xóa lịch sử nhập liệu",
  "interactiveSession.focusInput.label": "Tập trung ô nhập trò chuyện",
  "interactiveSession.history.clear": "Xóa tất cả các trò chuyện trong không gian làm việc",
  "interactiveSession.history.delete": "Xóa",
  "interactiveSession.history.editor": "Mở trong trình chỉnh sửa",
  "interactiveSession.history.pick": "Chuyển sang trò chuyện",
  "interactiveSession.history.title": "Lịch sử trò chuyện trong không gian làm việc",
  "interactiveSession.history.titleAll": "Lịch sử trò chuyện của toàn bộ không gian làm việc",
  "interactiveSession.newChatWindow": "Cửa sổ trò chuyện mới",
  "interactiveSession.open": "Trình chỉnh sửa trò chuyện mới",
  "manageChat": "Quản lý trò chuyện",
  "more": "Thêm...",
  "newChatTitle": "Tiêu đề trò chuyện mới",
  "openChat": "Mở trò chuyện",
  "openChatFeatureSettings": "Cài đặt tính năng trò chuyện",
  "openChatFeatureSettings.short": "Cài đặt trò chuyện",
  "openChatMode": "Mở trò chuyện ({0})",
  "quotaResetDate": "Hạn ngạch sẽ được đặt lại vào {0}.",
  "resetTrustedTools": "Đặt lại xác nhận công cụ",
  "resetTrustedToolsSuccess": "Tùy chọn xác nhận công cụ đã được đặt lại.",
  "review": "Xem xét mã",
  "showCopilotUsageExtensions": "Hiển thị các tiện ích mở rộng sử dụng Copilot",
  "signInToChatSetup": "Đăng nhập để sử dụng các tính năng AI...",
  "switchChat.confirmPhrase": "Việc chuyển đổi trò chuyện sẽ kết thúc phiên chỉnh sửa hiện tại.",
  "switchMode.confirmPhrase": "Việc chuyển đổi chế độ trò chuyện sẽ kết thúc phiên chỉnh sửa hiện tại.",
  "title4": "Trò chuyện",
  "toggle.chatControl": "Điều khiển trò chuyện",
  "toggle.chatControlsDescription": "Chuyển đổi khả năng hiển thị của các điều khiển bố cục trong thanh tiêu đề",
  "toggleChat": "Chuyển đổi trò chuyện",
  "upgradeChat": "Nâng cấp gói GitHub Copilot",
  "upgradePlan": "Nâng cấp gói GitHub Copilot",
  "upgradePro": "Nâng cấp lên GitHub Copilot Pro",
  "upgradeToPro": "Nâng cấp lên GitHub Copilot Pro (miễn phí 30 ngày đầu tiên) để:\r\n- Hoàn thành mã không giới hạn\r\n- Tin nhắn trò chuyện không giới hạn\r\n- Truy cập vào các mô hình cao cấp"
},
"vs/workbench/contrib/chat/browser/actions/chatClearActions": {
  "chat.newChat.label": "Trò chuyện mới",
  "chat.newEdits.label": "Trò chuyện mới",
  "chat.redoEdit.label": "Làm lại yêu cầu cuối cùng",
  "chat.redoEdit.label2": "Làm lại",
  "chat.redoEdit.tooltip": "Áp dụng lại các thay đổi và trò chuyện trong không gian làm việc đã bị hủy",
  "chat.undoEdit.label": "Hoàn tác yêu cầu cuối cùng"
},
"vs/workbench/contrib/chat/browser/actions/chatCodeblockActions": {
  "interactive.applyInEditor.label": "Áp dụng trong trình chỉnh sửa",
  "interactive.applyInEditorWithURL.label": "Áp dụng cho {0}",
  "interactive.compare.apply": "Áp dụng chỉnh sửa",
  "interactive.compare.discard": "Hủy chỉnh sửa",
  "interactive.copyCodeBlock.label": "Sao chép",
  "interactive.insertCodeBlock.label": "Chèn vào con trỏ",
  "interactive.insertIntoNewFile.label": "Chèn vào tệp mới",
  "interactive.nextCodeBlock.label": "Khối mã tiếp theo",
  "interactive.previousCodeBlock.label": "Khối mã trước đó",
  "interactive.runInTerminal.label": "Chèn vào terminal"
},
"vs/workbench/contrib/chat/browser/actions/chatContext": {
  "chatContext.attachScreenshot.labelElectron.Window": "Cắt cửa sổ màn hình",
  "chatContext.attachScreenshot.labelWeb": "Cắt màn hình",
  "chatContext.editors": "Trình chỉnh sửa đã mở",
  "chatContext.relatedFiles": "Tệp liên quan",
  "chatContext.tools": "Công cụ...",
  "chatContext.tools.placeholder": "Chọn một công cụ",
  "imageFromClipboard": "Hình ảnh từ bảng tạm",
  "pastedImage": "Hình ảnh đã dán",
  "relatedFiles": "Thêm tệp liên quan vào không gian làm việc"
},
"vs/workbench/contrib/chat/browser/actions/chatContextActions": {
  "chat.insertSearchResults": "Thêm kết quả tìm kiếm vào trò chuyện",
  "chatContext.attach.placeholder": "Tìm kiếm tệp đính kèm",
  "goBack": "Quay lại ↩",
  "workbench.action.chat.attachContext.label.2": "Thêm ngữ cảnh...",
  "workbench.action.chat.attachFile.label": "Thêm tệp vào trò chuyện",
  "workbench.action.chat.attachFolder.label": "Thêm thư mục vào trò chuyện",
  "workbench.action.chat.attachSelection.label": "Thêm lựa chọn vào trò chuyện"
},
"vs/workbench/contrib/chat/browser/actions/chatCopyActions": {
  "interactive.copyAll.label": "Sao chép tất cả",
  "interactive.copyItem.label": "Sao chép"
},
"vs/workbench/contrib/chat/browser/actions/chatDeveloperActions": {
  "workbench.action.chat.logChatIndex.label": "Ghi lại chỉ mục trò chuyện",
  "workbench.action.chat.logInputHistory.label": "Ghi lại lịch sử nhập liệu trò chuyện"
},
"vs/workbench/contrib/chat/browser/actions/chatExecuteActions": {
  "actions.chat.createRemoteJob": "Ủy thác cho tác nhân mã hóa",
  "actions.chat.submitWithCodebase": "Gửi với {0}",
  "analyzingChatHistory": "Phân tích lịch sử trò chuyện",
  "attachedFiles": "Người dùng đã đính kèm các tệp sau từ không gian làm việc của họ:",
  "chat.newChat.label": "Gửi đến trò chuyện mới",
  "chat.remove.confirmation.checkbox": "Không hỏi lại",
  "chat.remove.confirmation.message2": "Điều này sẽ xóa tất cả các yêu cầu tiếp theo và hoàn tác các thay đổi được thực hiện trong {0}. Bạn có muốn tiếp tục?",
  "chat.remove.confirmation.multipleEdits.message": "Điều này sẽ xóa tất cả các yêu cầu tiếp theo và hoàn tác các thay đổi được thực hiện trong các tệp {0} của tập hợp làm việc. Bạn có muốn tiếp tục?",
  "chat.remove.confirmation.primaryButton": "Có",
  "chat.remove.confirmation.title": "Bạn có muốn hoàn tác {0} chỉnh sửa?",
  "chat.removeLast.confirmation.message2": "Điều này sẽ xóa yêu cầu cuối cùng và hoàn tác các thay đổi được thực hiện trong {0}. Bạn có muốn tiếp tục?",
  "chat.removeLast.confirmation.multipleEdits.message": "Điều này sẽ xóa yêu cầu cuối cùng và hoàn tác các thay đổi được thực hiện trong các tệp {0} của tập hợp làm việc. Bạn có muốn tiếp tục?",
  "chat.removeLast.confirmation.title": "Bạn có muốn hoàn tác chỉnh sửa cuối cùng?",
  "creatingRemoteJob": "Ủy thác cho tác nhân mã hóa",
  "edits.submit.label": "Gửi",
  "interactive.cancel.label": "Hủy",
  "interactive.cancelEdit.label": "Hủy chỉnh sửa",
  "interactive.changeModel.label": "Thay đổi mô hình",
  "interactive.openModePicker.label": "Mở bộ chọn chế độ",
  "interactive.openModelPicker.label": "Mở bộ chọn mô hình",
  "interactive.submit.label": "Gửi và phân phối",
  "interactive.submit.panel.label": "Gửi đến phiên chỉnh sửa",
  "interactive.submitWithoutDispatch.label": "Gửi",
  "interactive.switchToNextModel.label": "Chuyển sang mô hình tiếp theo",
  "interactive.toggleAgent.label": "Chuyển sang chế độ trò chuyện tiếp theo",