      "resourcePath": "Ruta de acceso completa del recurso",
      "resourceScheme": "Esquema del recurso",
      "resourceSet": "Si un recurso está presente o no",
      "sideBarFocus": "Si la barra lateral tiene el foco del teclado",
      "sideBarVisible": "Si la barra lateral es visible",
      "sideBySideEditorActive": "Si un editor en paralelo está activo",
      "splitEditorsVertically": "Si los editores se dividen verticalmente",
      "statusBarFocused": "Si la barra de estado tiene el foco del teclado",
      "temporaryWorkspace": "El esquema del área de trabajo actual procede de un sistema de archivos temporal.",
      "textCompareEditorActive": "Si hay un editor de comparación de texto activo",
      "textCompareEditorVisible": "Si el editor de comparación de texto está visible",
      "titleBarStyle": "Estilo de la barra de título de la ventana",
      "titleBarVisible": "Si la barra de título está visible",
      "twoEditorsSelectedInGroup": "Si se han seleccionado exactamente dos editores en un grupo de editores",
      "virtualWorkspace": "El esquema del área de trabajo actual procede de un sistema de archivos virtual o una cadena vacía.",
      "workbenchState": "Variante del área de trabajo abierta en la ventana, que puede ser \"vacía\" (sin área de trabajo), \"carpeta\" (única carpeta) o \"área de trabajo\" (área de trabajo con varias raíces)",
      "workspaceFolderCount": "Número de carpetas raíz en el área de trabajo"
    },
    "vs/workbench/common/editor": {
      "builtinProviderDisplayName": "Integrado",
      "configureEditorLargeFileConfirmation": "Configurar límite",
      "openLargeFile": "Abrir de todos modos",
      "promptOpenWith.defaultEditor.displayName": "Editor de texto"
    },
    "vs/workbench/common/editor/diffEditorInput": {
      "sideBySideLabels": "{0} ↔ {1}"
    },
    "vs/workbench/common/editor/sideBySideEditorInput": {
      "sideBySideLabels": "{0} - {1}"
    },
    "vs/workbench/common/editor/textEditorModel": {
      "languageAutoDetected": "El idioma {0} se detectó y estableció automáticamente como modo de idioma."
    },
    "vs/workbench/common/theme": {
      "activityBarActiveBackground": "Color de fondo de la barra de actividad para el elemento activo. La barra de actividad aparece en el extremo izquierdo o derecho y permite cambiar entre las vistas de la barra lateral.",
      "activityBarActiveBorder": "Color del borde de la barra de actividad para el elemento activo. La barra de actividad aparece en el extremo izquierdo o derecho y permite alternar entre las vistas de la barra lateral.",
      "activityBarActiveFocusBorder": "Color de borde de foco de la barra de actividad para el elemento activo. La barra de actividad se muestra en el extremo izquierdo o derecho y permite cambiar entre las vistas de la barra lateral.",
      "activityBarBackground": "Color de fondo de la barra de actividad, que se muestra en el lado izquierdo o derecho y que permite cambiar entre diferentes vistas de la barra lateral.",
      "activityBarBadgeBackground": "Color de fondo de distintivo de notificación de actividad. La barra de actividad se muestra en el extremo izquierdo o derecho y permite cambiar entre vistas de la barra lateral.",
      "activityBarBadgeForeground": "Color de primer plano de distintivo de notificación de actividad. La barra de actividad se muestra en el extremo izquierdo o derecho y permite cambiar entre vistas de la barra lateral.",
      "activityBarBorder": "Color de borde de la barra de actividad que separa la barra lateral. La barra de actividad se muestra en el extremo derecho o izquierdo y permite cambiar entre las vistas de la barra lateral.",
      "activityBarDragAndDropBorder": "Color de arrastrar y colocar comentarios de la barra de actividad. La barra de actividad se muestra en el extremo izquierdo o derecho y permite cambiar entre vistas de la barra lateral.",
      "activityBarForeground": "Color de primer plano del elemento de barra de actividad cuando está activo. La barra de actividad se muestra en el lado izquierdo o derecho y permite cambiar entre diferentes vistas de la barra lateral.",
      "activityBarInActiveForeground": "Color de primer plano del elemento de barra de actividad cuando está inactivo. La barra de actividad se muestra en el lado izquierdo o derecho y permite cambiar entre diferentes vistas de la barra lateral.",
      "activityBarTop": "Color de primer plano activo del elemento en la barra actividad cuando está en la parte superior o inferior. La actividad permite cambiar entre las vistas de la barra lateral.",
      "activityBarTopActiveBackground": "Color de fondo del elemento activo en la barra actividad cuando está en la parte superior o inferior. La actividad permite cambiar entre vistas de la barra lateral.",
      "activityBarTopActiveFocusBorder": "Color del borde del foco para el elemento activo en la barra actividad cuando está en la parte superior o inferior. La actividad permite cambiar entre las vistas de la barra lateral.",
      "activityBarTopBackground": "Color de fondo de la barra de actividad cuando se establece en superior o inferior.",
      "activityBarTopDragAndDropBorder": "Arrastre y coloque el color de comentarios de los elementos de la barra de actividad cuando esté en la parte superior o inferior. La actividad permite cambiar entre las vistas de la barra lateral.",
      "activityBarTopInActiveForeground": "Color de primer plano inactivo del elemento en la barra actividad cuando está en la parte superior o inferior. La actividad permite cambiar entre las vistas de la barra lateral.",
      "banner.background": "Color de fondo de la pancarta. La pancarta se muestra en la barra de título de la ventana.",
      "banner.foreground": "Color de primer plano de la pancarta. La pancarta se muestra en la barra de título de la ventana.",
      "banner.iconForeground": "Color del icono de la pancarta. La pancarta se muestra en la barra de título de la ventana.",
      "commandCenter-activeBackground": "Color de fondo activo del centro de comandos",
      "commandCenter-activeBorder": "Color del borde activo del centro de comandos",
      "commandCenter-activeForeground": "Color de primer plano activo del centro de comandos",
      "commandCenter-background": "Color de fondo del centro de comandos",
      "commandCenter-border": "Color del borde del centro de comandos",
      "commandCenter-foreground": "Color de primer plano del centro de comandos",
      "commandCenter-inactiveBorder": "Color de borde del centro de comandos cuando la ventana está inactiva",
      "commandCenter-inactiveForeground": "Color de primer plano del centro de comandos cuando la ventana está inactiva",
      "editorDragAndDropBackground": "Color de fondo cuando se arrastran los editores. El color debería tener transparencia para que el contenido del editor pueda brillar a su través.",
      "editorDropIntoPromptBackground": "Color de fondo del texto que se muestra sobre los editores al arrastrar archivos. Este texto informa al usuario de que puede mantener el desplazamiento para colocarlo en el editor.",
      "editorDropIntoPromptBorder": "Color del borde del texto que se muestra sobre los editores al arrastrar archivos. Este texto informa al usuario de que puede mantener el turno para colocarlo en el editor.",
      "editorDropIntoPromptForeground": "Color de primer plano del texto que se muestra sobre los editores al arrastrar archivos. Este texto informa al usuario de que puede mantener el turno para colocarlo en el editor.",
      "editorGroupBorder": "Color para separar varios grupos de editores entre sí. Los grupos de editores son los contenedores de los editores.",
      "editorGroupEmptyBackground": "Color de fondo de un grupo de editores vacío. Los grupos de editores son los contenedores de los editores.",
      "editorGroupFocusedEmptyBorder": "Color del borde de un grupo de editores vacío que tiene el foco. Los grupos de editores son los contenedores de los editores.",
      "editorGroupHeaderBackground": "Color de fondo del encabezado del título del grupo de editores cuando (`\"workbench.editor.showTabs\": \"single\"`). Los grupos de editores son los contenedores de editores.",
      "editorPaneBackground": "Color de fondo del panel del editor visible a la izquierda y a la derecha del diseño de editor centrado.",
      "editorTitleContainerBorder": "Color de borde del encabezado de título del grupo de editores. Los grupos de editores son los contenedores de los editores.",
      "extensionBadge.remoteBackground": "Color de fondo de la insignia remota en la vista de extensiones.",
      "extensionBadge.remoteForeground": "Color de primer plano de la insignia remota en la vista de extensiones.",
      "lastPinnedTabBorder": "Borde para separar las pestañas entre sí. Las pestañas son contenedores de editores en el área de editores. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "menubarSelectionBackground": "Color de fondo del elemento de menú seleccionado en la barra de menús.",
      "menubarSelectionBorder": "Color del borde del elemento de menú seleccionado en la barra de menús.",
      "menubarSelectionForeground": "Color de primer plano del elemento de menú seleccionado en la barra de menús.",
      "notificationCenterBorder": "Color del borde del centro de notificaciones. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationCenterHeaderBackground": "Color de fondo del encabezado del centro de notificaciones. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationCenterHeaderForeground": "Color de primer plano del encabezado del centro de notificaciones. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationToastBorder": "Color del borde de las notificaciones del sistema. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationsBackground": "Color de fondo de las notificaciones. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationsBorder": "Color de borde que separa las notificaciones en el centro de notificaciones. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationsErrorIconForeground": "Color utilizado para el icono de las notificaciones de error. Las notificaciones se muestran desde la parte inferior derecha de la ventana.",
      "notificationsForeground": "Color de primer plano de las notificaciones. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationsInfoIconForeground": "Color utilizado para el icono de las notificaciones de información. Las notificaciones se muestran desde la parte inferior derecha de la ventana.",
      "notificationsLink": "Color de primer plano de los vínculos de las notificaciones. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "notificationsWarningIconForeground": "Color utilizado para el icono de las notificaciones de advertencia. Las notificaciones se deslizan desde la parte inferior derecha de la ventana.",
      "outputViewBackground": "Color de fondo de vista de salida.",
      "outputViewStickyScrollBackground": "Color de fondo de desplazamiento permanente de la vista de salida.",
      "panelActiveTitleBorder": "Color de borde del título del panel activo. Los paneles se muestran debajo del área del editor y contienen vistas como Salida y Terminal integrado.",
      "panelActiveTitleForeground": "Color del título del panel activo. Los paneles se muestran debajo del área del editor y contienen vistas como Salida y Terminal integrado.",
      "panelBackground": "Color de fondo del panel. Los paneles se muestran debajo del área de editores y contienen vistas, como Salida y Terminal integrado.",
      "panelBorder": "El color del borde superior del panel que lo separa del editor. Los paneles se muestran debajo del área de editores y contienen vistas, como la salida y la terminal integrada.",
      "panelDragAndDropBorder": "Color de arrastrar y colocar comentarios para los títulos del panel. Los paneles se muestran debajo del área del editor y contienen vistas como salida y terminal integrado.",
      "panelInactiveTitleForeground": "Color del título del panel inactivo. Los paneles se muestran debajo del área del editor y contienen vistas como Salida y Terminal integrado.",
      "panelInputBorder": "Límite de cuadro de entrada para entradas del panel.",
      "panelSectionBorder": "Color de borde de la sección del panel que se usa cuando varias vistas se apilan horizontalmente en el panel. Los paneles se muestran debajo del área del editor y contienen vistas como la salida y el terminal integrado. Las secciones de panel son vistas anidadas en los paneles.",
      "panelSectionDragAndDropBackground": "Color de arrastrar y colocar comentarios para las secciones del panel. El color debe tener transparencia de modo que las secciones del panel puedan brillar a través de él. Los paneles se muestran debajo del área del editor y contienen vistas como salida y terminal integrado. Las secciones de panel son vistas anidadas en los paneles.",
      "panelSectionHeaderBackground": "Color de fondo del encabezado de la sección del panel. Los paneles se muestran debajo del área del editor y contienen vistas como salida y terminal integrado. Las secciones de panel son vistas anidadas en los paneles.",
      "panelSectionHeaderBorder": "Color de borde del encabezado de la sección del panel que se usa cuando varias vistas se apilan verticalmente en el panel. Los paneles se muestran debajo del área del editor y contienen vistas como la salida y el terminal integrado. Las secciones de panel son vistas anidadas en los paneles.",
      "panelSectionHeaderForeground": "Color de primer plano del encabezado de la sección del panel. Los paneles se muestran debajo del área del editor y contienen vistas como la salida y el terminal integrado. Las secciones de panel son vistas anidadas en los paneles.",
      "panelStickyScrollBackground": "Color de fondo del desplazamiento permanente en el panel.",
      "panelStickyScrollBorder": "Color de borde del desplazamiento permanente en el panel.",
      "panelStickyScrollShadow": "Color de sombra del desplazamiento permanente en el panel.",
      "panelTitleBadgeBackground": "Color de fondo del distintivo del título del panel. Los paneles se muestran debajo del área del editor y contienen vistas como la salida y el terminal integrado.",
      "panelTitleBadgeForeground": "Color de primer plano del distintivo del título del panel. Los paneles se muestran debajo del área del editor y contienen vistas como la salida y el terminal integrado.",
      "panelTitleBorder": "Color del borde del título del panel en la parte inferior, separando el título de las vistas. Los paneles se muestran debajo del área del editor y contienen vistas como la salida y el terminal integrado.",
      "profileBadgeBackground": "Color de fondo del distintivo de perfil. El distintivo de perfil se muestra en la parte superior del icono de engranaje de configuración de la barra de actividad.",
      "profileBadgeForeground": "Color de primer plano del distintivo de perfil. El distintivo de perfil se muestra en la parte superior del icono de engranaje de configuración de la barra de actividad.",
      "sideBarActivityBarTopBorder": "Color de borde entre la barra de actividad en la parte superior e inferior y las vistas.",
      "sideBarBackground": "Color de fondo de la barra lateral, que es el contenedor de vistas como Explorador y Búsqueda.",
      "sideBarBorder": "Color de borde de la barra lateral en el lado que separa el editor. La barra lateral es el contenedor de vistas como Explorador y Búsqueda.",
      "sideBarDragAndDropBackground": "Color de arrastrar y colocar comentarios para las secciones de la barra lateral. El color debe tener transparencia para permitir que se vean las secciones de la barra lateral, que es el contenedor para vistas como la del explorador o la de búsqueda. Las secciones de la barra lateral son vistas anidadas en la barra lateral.",
      "sideBarForeground": "Color de primer plano de la barra lateral, que es el contenedor de vistas como Explorador y Búsqueda.",
      "sideBarSectionHeaderBackground": "Color de fondo del encabezado de sección de la barra lateral. La barra lateral es el contenedor de vistas, como el explorador y la búsqueda. Las secciones de la barra lateral son vistas anidadas en la barra lateral.",
      "sideBarSectionHeaderBorder": "Color de borde del encabezado de sección de la barra lateral. La barra lateral es el contenedor de vistas, como el explorador y la búsqueda. Las secciones de la barra lateral son vistas anidadas en la barra lateral.",
      "sideBarSectionHeaderForeground": "Color de primer plano del encabezado de sección de la barra lateral. La barra lateral es el contenedor de vistas, como el explorador y la búsqueda. Las secciones de la barra lateral son vistas anidadas en la barra lateral.",
      "sideBarStickyScrollBackground": "Color de fondo del desplazamiento permanente en la barra lateral.",
      "sideBarStickyScrollBorder": "Color de borde del desplazamiento permanente en la barra lateral.",
      "sideBarStickyScrollShadow": "Color de sombra del desplazamiento permanente en la barra lateral.",
      "sideBarTitleBackground": "Color de fondo de título de barra lateral. La barra lateral es el contenedor de vistas como Explorador y Búsqueda.",
      "sideBarTitleBorder": "Color del borde del título de la barra lateral en la parte inferior, separando el título de las vistas. La barra lateral es el contenedor de vistas como Explorador y Búsqueda.",
      "sideBarTitleForeground": "Color de primer plano del título de la barra lateral, que es el contenedor de vistas como Explorador y Búsqueda.",
      "sideBySideEditor.horizontalBorder": "Color para separar dos editores entre sí cuando se muestran en paralelo en un grupo de editores de arriba a abajo.",
      "sideBySideEditor.verticalBorder": "Color para separar dos editores entre sí cuando se muestran en paralelo en un grupo de editores de izquierda a derecha.",
      "statusBarBackground": "Color de fondo de la barra de estado cuando se abre un área de trabajo o una carpeta. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarBorder": "Color de borde de la barra de estado que separa la barra lateral y el editor. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarErrorItemBackground": "Color de fondo de los elementos de error en la barra de estado. Los elementos de error se destacan de otras entradas de la barra de estado para indicar condiciones de error. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarErrorItemForeground": "Color de primer plano de los elementos de error en la barra de estado. Los elementos de error se destacan de otras entradas de la barra de estado para indicar condiciones de error. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarErrorItemHoverBackground": "Color de fondo de los elementos de error en la barra de estado al mantener el puntero sobre ellos. Los elementos de error se destacan de otras entradas de la barra de estado para indicar condiciones de error. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarErrorItemHoverForeground": "Color de primer plano de los elementos de error en la barra de estado al mantener el puntero sobre ellos. Los elementos de error se destacan de otras entradas de la barra de estado para indicar condiciones de error. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarFocusBorder": "Color de borde de la barra de estado cuando se centra en la navegación del teclado. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarForeground": "Color de primer plano de la barra de estado cuando se abre un área de trabajo o una carpeta. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarItemActiveBackground": "Color de fondo de un elemento de la barra de estado al hacer clic. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarItemCompactHoverBackground": "Color de fondo de un elemento de la barra de estado al mantener el puntero sobre un elemento que contiene varios tipos de información que se muestran. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarItemFocusBorder": "Color de borde del elemento de la barra de estado cuando se centra en la navegación del teclado. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarItemHoverBackground": "Color de fondo de un elemento de la barra de estado al mantener el puntero. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarItemHoverForeground": "Color de primer plano del elemento de la barra de estado al mantener el puntero sobre él. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarItemOfflineBackground": "Color de fondo del elemento de la barra de estado cuando el área de trabajo está sin conexión.",
      "statusBarItemOfflineForeground": "Color de primer plano del elemento de la barra de estado cuando el área de trabajo está sin conexión.",
      "statusBarItemRemoteBackground": "Color de fondo para el indicador remoto en la barra de estado.",
      "statusBarItemRemoteForeground": "Color de primer plano para el indicador remoto en la barra de estado.",
      "statusBarNoFolderBackground": "Color de fondo de la barra de estado cuando no hay ninguna carpeta abierta. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarNoFolderBorder": "Color de borde de la barra de estado que separa la barra lateral y el editor cuando no hay ninguna carpeta abierta. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarNoFolderForeground": "Color de primer plano de la barra de estado cuando no hay ninguna carpeta abierta. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarOfflineItemHoverBackground": "Color de fondo del elemento de la barra de estado cuando el área de trabajo está sin conexión.",
      "statusBarOfflineItemHoverForeground": "Color de primer plano del elemento de la barra de estado cuando el área de trabajo está sin conexión.",
      "statusBarProminentItemBackground": "Color de fondo de elementos destacados de la barra de estado. Los artículos prominentes se destacan de otras entradas de la barra de estado para indicar importancia. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarProminentItemForeground": "Color de primer plano de elementos destacados de la barra de estado. Los artículos prominentes se destacan de otras entradas de la barra de estado para indicar importancia. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarProminentItemHoverBackground": "Barra de estado elementos prominentes color de fondo cuando se activa. Los artículos prominentes se destacan de otras entradas de la barra de estado para indicar importancia. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarProminentItemHoverForeground": "Color de primer plano de los elementos prominentes de la barra de estado al mantener el puntero sobre ellos. Los artículos prominentes se destacan de otras entradas de la barra de estado para indicar importancia. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarRemoteItemHoverBackground": "Color de fondo para el indicador remoto en la barra de estado al mantener el puntero sobre él.",
      "statusBarRemoteItemHoverForeground": "Color de primer plano para el indicador remoto en la barra de estado al mantener el puntero sobre él.",
      "statusBarWarningItemBackground": "Color de fondo de los elementos de advertencia en la barra de estado. Los elementos de advertencia se destacan de otras entradas de la barra de estado para indicar condiciones de advertencia. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarWarningItemForeground": "Color de primer plano de los elementos de advertencia en la barra de estado. Los elementos de advertencia se destacan de otras entradas de la barra de estado para indicar condiciones de advertencia. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarWarningItemHoverBackground": "Color de fondo de los elementos de aviso en la barra de estado al mantener el puntero sobre ellos. Los elementos de advertencia se destacan de otras entradas de la barra de estado para indicar condiciones de advertencia. La barra de estado se muestra en la parte inferior de la ventana.",
      "statusBarWarningItemHoverForeground": "Color de primer plano de los elementos de aviso en la barra de estado al mantener el puntero sobre ellos. Los elementos de advertencia se destacan de otras entradas de la barra de estado para indicar condiciones de advertencia. La barra de estado se muestra en la parte inferior de la ventana.",
      "tabActiveBackground": "Color de fondo de la pestaña activa. Las pestañas son los contenedores de los editores en el área de editores. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabActiveBorder": "Borde en la parte inferior de una ficha activa. Las fichas son los contenedores para los editores en el área de edición. Múltiple pestañas pueden abrirse en un grupo de editor. Puede haber múltiples grupos de editor. ",
      "tabActiveBorderTop": "Borde a la parte superior de una pestaña activa. Las pestañas son los contenedores para los editores en el área del editor. Se pueden abrir múltiples pestañas en un grupo de editores. Puede haber múltiples grupos de editores.",
      "tabActiveForeground": "Color de primer plano de la pestaña activa en un grupo activo. Las pestañas son los contenedores de los editores en el área de editores. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabActiveModifiedBorder": "Borde en la parte superior de las pestañas activas modificadas en un grupo activo. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabActiveUnfocusedBorder": "Borde en la parte inferior de una pestaña activa para un grupo no seleccionado. Las pestañas son los contenedores para los editores en el área del editor. Se pueden abrir múltiples pestañas en un grupo de editores. Puede haber múltiples grupos de editores.",
      "tabActiveUnfocusedBorderTop": "Borde en la parte superior de una pestaña activa para un grupo no seleccionado. Las pestañas son los contenedores para los editores en el área del editor. Se pueden abrir múltiples pestañas en un grupo de editores. Puede haber múltiples grupos de editores.",
      "tabBorder": "Borde para separar las pestañas entre sí. Las pestañas son contenedores de editores en el área de editores. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabDragAndDropBorder": "Borde entre pestañas para indicar que se puede insertar una pestaña entre dos pestañas. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabHoverBackground": "Color de fondo de la pestaña activa al mantener el puntero. Las pestañas son los contenedores de los editores en el área de editores. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabHoverBorder": "Borde para resaltar tabulaciones cuando se activan. Las fichas son los contenedores para los editores en el área del editor. Se pueden abrir varias fichas en un grupo de editores. Puede haber varios grupos de editores. ",
      "tabHoverForeground": "Color de primer plano de la pestaña al mantener el puntero. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores y puede haber varios grupos de este tipo.",
      "tabInactiveBackground": "Color de fondo de la pestaña inactiva. Las pestañas son los contenedores de los editores en el área de editores. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabInactiveForeground": "Color de primer plano de la pestaña inactiva en un grupo activo. Las pestañas son los contenedores de los editores en el área de editores. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabInactiveModifiedBorder": "Borde en la parte superior de las pestañas inactivas modificadas en un grupo activo. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabSelectedBackground": "Fondo de una pestaña seleccionada. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabSelectedBorderTop": "Borde en la parte superior de una pestaña seleccionada. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabSelectedForeground": "Primer plano de una pestaña seleccionada. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabUnfocusedActiveBackground": "Color de fondo de la pestaña activa en un grupo no enfocado. Las pestañas son los contenedores para los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editor. Puede haber varios grupos de editor.",
      "tabUnfocusedActiveForeground": "Color de primer plano de la ficha activa en un grupo que no tiene el foco. Las fichas son los contenedores de los editores en el área de editores. Se pueden abrir varias fichas en un grupo de editores. Puede haber varios grupos de editores. ",
      "tabUnfocusedHoverBackground": "Color de fondo de tabulación en un grupo no enfocado cuando se pasa. Las fichas son los contenedores para los editores en el área del editor. Se pueden abrir varias fichas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabUnfocusedHoverBorder": "Borde para resaltar tabulaciones en un grupo no enfocado cuando se activan. Las pestañas son los contenedores para los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "tabUnfocusedHoverForeground": "Color de primer plano de la pestaña en un grupo sin foco al mantener el puntero. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores y puede haber varios grupos de este tipo.",
      "tabUnfocusedInactiveBackground": "Color de fondo de la pestaña inactiva en un grupo sin foco. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores y puede haber varios grupos de este tipo.",
      "tabUnfocusedInactiveForeground": "Color de primer plano de las fichas inactivas en un grupo que no tiene el foco. Las fichas son los contenedores de los editores en el área de editores. Se pueden abrir varias fichas en un grupo de editores. Puede haber varios grupos de editores. ",
      "tabsContainerBackground": "Color de fondo del encabezado del título del grupo de editores cuando las fichas están habilitadas. Los grupos de editores son contenedores de editores.",
      "tabsContainerBorder": "Color de borde del encabezado del título del grupo de editores cuando las fichas están habilitadas. Los grupos de editores son contenedores de editores.",
      "titleBarActiveBackground": "Fondo de la barra de título cuando la ventana está activa.",
      "titleBarActiveForeground": "Primer plano de la barra de título cuando la ventana está activa.",
      "titleBarBorder": "Color de borde de la barra de título.",
      "titleBarInactiveBackground": "Fondo de la barra de título cuando la ventana está inactiva.",
      "titleBarInactiveForeground": "Primer plano de la barra de título cuando la ventana está inactiva.",
      "unfocusedActiveModifiedBorder": "Borde en la parte superior de las pestañas activas modificadas en un grupo sin foco. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "unfocusedINactiveModifiedBorder": "Borde en la parte superior de las pestañas inactivas modificadas en un grupo sin foco. Las pestañas son los contenedores de los editores en el área del editor. Se pueden abrir varias pestañas en un grupo de editores. Puede haber varios grupos de editores.",
      "windowActiveBorder": "Color que se usa para el borde de la ventana cuando está activa en macOS o Linux. Requiere un estilo de barra de título personalizado y controles de ventana personalizados u ocultos en Linux.",
      "windowInactiveBorder": "Color que se usa para el borde de la ventana cuando está inactiva en macOS o Linux. Requiere un estilo de barra de título personalizado y controles de ventana personalizados u ocultos en Linux."
    },
    "vs/workbench/common/views": {
      "defaultViewIcon": "Icono de vista predeterminado.",
      "duplicateId": "Una vista con id \"{0}\" ya está registrada",
      "treeView.notRegistered": "No se ha registrado ninguna vista del árbol con el id. \"{0}\".",
      "views log": "Vistas"
    },
    "vs/workbench/electron-browser/actions/developerActions": {
      "configureRuntimeArguments": "Configurar argumentos en tiempo de ejecución",
      "reloadWindowWithExtensionsDisabled": "Recargar con extensiones desactivadas",
      "revealUserDataFolder": "Revelar carpeta de datos de usuario",
      "showGPUInfo": "Mostrar información de GPU",
      "stopTracing": "Detener seguimiento",
      "stopTracing.button": "&&Volver a iniciar y habilitar el seguimiento",
      "stopTracing.detail": "Esto puede tardar hasta un minuto en completarse.",
      "stopTracing.message": "El seguimiento requiere iniciarse con un argumento '--trace'",
      "stopTracing.title": "Creando archivo de seguimiento...",
      "toggleDevTools": "Alternar herramientas de desarrollo"
    },
    "vs/workbench/electron-browser/actions/installActions": {
      "install": "Instalar el comando '{0}' en PATH",
      "shellCommand": "Comando shell",
      "successFrom": "El comando shell '{0}' se desinstaló correctamente de PATH.",
      "successIn": "El comando shell '{0}' se instaló correctamente en PATH.",
      "uninstall": "Desinstalar el comando '{0}' de PATH"
    },
    "vs/workbench/electron-browser/actions/windowActions": {
      "close": "Cerrar ventana",
      "closeWindow": "Cerrar ventana",
      "current": "Ventana actual",
      "disableWindowAlwaysOnTop": "Desactivar Siempre visible",
      "enableWindowAlwaysOnTop": "Activar Siempre visible",
      "miCloseWindow": "C&&errar ventana",
      "miZoomIn": "&&Ampliar",
      "miZoomOut": "&&Alejar",
      "miZoomReset": "&&Restablecer zoom",
      "quickSwitchWindow": "Cambio Rápido de Ventana...",
      "switchWindow": "Cambiar de Ventana...",
      "switchWindowPlaceHolder": "Seleccionar una ventana a la que cambiar",
      "toggleWindowAlwaysOnTop": "Alternar ventana siempre visible",
      "windowDirtyAriaLabel": "{0}, ventana con cambios sin guardar",
      "windowGroup": "grupo de ventanas",
      "zoomIn": "Acercar",
      "zoomOut": "Alejar",
      "zoomReset": "Restablecer zoom"
    },
    "vs/workbench/electron-browser/desktop.contribution": {
      "application.shellEnvironmentResolutionTimeout": "Controla el tiempo de espera en segundos antes de dejar de resolver el entorno de shell cuando la aplicación no se ha iniciado ya desde un terminal. Consulte nuestra [documentation](https://go.microsoft.com/fwlink/?linkid=2149667) para obtener más información.",
      "argv.crashReporterId": "Identificador único que se usa para correlacionar los informes de bloqueo enviados desde esta instancia de la aplicación.",
      "argv.disableChromiumSandbox": "Deshabilita el espacio aislado de Chromium. Esto es útil cuando se ejecuta VS Code con privilegios elevados en Linux y se ejecuta en AppLocker en Windows.",
      "argv.disableHardwareAcceleration": "Deshabilita la aceleración de hardware. Solo cambie esta opción si encuentra problemas gráficos.",
      "argv.disableLcdText": "Deshabilita el suavizado de contorno de la fuente LCD.",
      "argv.enableCrashReporter": "Permite deshabilitar el informe de bloqueo; debe reiniciar la aplicación si se cambia el valor.",
      "argv.enableRDPDisplayTracking": "Garantiza que las ventanas maximizadas se restauren a la pantalla correcta durante la reconexión de RDP.",
      "argv.enebleProposedApi": "Habilite las API propuestas para una lista de identificadores de extensiones (como \"vscode. git\"). Las API propuestas son inestables y están sujetas a interrupciones sin advertencia en cualquier momento. Esta operación solo debe establecerse para el desarrollo de extensiones y para pruebas.",
      "argv.force-renderer-accessibility": "Fuerza el acceso al renderizador. Solo cambie esto si está utilizando un lector de pantalla en Linux. En otras plataformas, el renderizador será accesible automáticamente. Esta marca se establece automáticamente si tiene editor.accessibilitySupport: on.",
      "argv.forceColorProfile": "Permite anular el perfil de color que se va a utilizar. Si le parece que los colores están mal, intente establecer esto en \"srgb\" y reinicie.",
      "argv.locale": "Idioma de visualización que se va a utilizar. La elección de un idioma diferente requiere la instalación del paquete de idioma asociado.",
      "argv.logLevel": "Nivel de registro a utilizar. Por defecto es \"info\". Los valores permitidos son \"error\", \"warn\", \"info\", \"debug\", \"trace\", \"off\".",
      "argv.passwordStore": "Configura el back-end que se usa para almacenar secretos en Linux. Este argumento se omite en Windows y macOS.",
      "argv.proxyBypassList": "Omita cualquier proxy especificado para la lista de hosts determinada separada por punto y coma. Valor de ejemplo \"<local>;*.microsoft.com;*foo.com; 1.2.3.4:5678\", usará el servidor proxy para todos los hosts excepto para las direcciones locales (localhost, 127.0.0.1, etc.), microsoft.com subdominios, hosts que contienen el sufijo foo.com y cualquier elemento en 1.2.3.4:5678",
      "argv.remoteDebuggingPort": "Especifica el puerto que se va a usar para la depuración remota.",
      "argv.useInMemorySecretStorage": "Garantiza que se usará un almacén en memoria para el almacenamiento de secretos en lugar de usar el almacén de credenciales del sistema operativo. Suele usarse al ejecutar VS Code pruebas de extensión o cuando tiene dificultades con el almacén de credenciales.",
      "closeWhenEmpty": "Controla si, al cerrar el último editor, debe cerrarse también la ventana. Esta configuración se aplica solo a ventanas que no muestran carpetas.",
      "confirmSaveUntitledWorkspace": "Controla si se muestra un cuadro de diálogo de confirmación que solicita guardar o descartar un área de trabajo sin título abierta en la ventana al cambiar a otra área de trabajo. Si deshabilita el cuadro de diálogo de confirmación, siempre se descartará el área de trabajo sin título.",
      "controlsStyle": "Ajuste la apariencia de los controles de la ventana para que sean nativos del sistema operativo, personalizados u ocultos. Los cambios requieren un reinicio completo para aplicarse.",
      "dialogStyle": "Ajustar la apariencia de los cuadros de diálogo para que sean nativos del sistema operativo o personalizados.",
      "enableCrashReporterDeprecated": "Si esta configuración es false, no se enviará ningún dato de telemetría independientemente del valor de la nueva configuración. En desuso debido a la combinación en la configuración de {0}.",
      "keyboardConfigurationTitle": "Teclado",
      "mergeAllWindowTabs": "Combinar todas las ventanas",
      "miExit": "S&&alir",
      "moveWindowTabToNewWindow": "Mover pestaña de ventana a una nueva ventana",
      "newTab": "Pestaña Nueva ventana",
      "newWindowDimensions": "Controla las dimensiones de apertura de una nueva ventana cuando ya existe al menos una ventana abierta. Tenga en cuenta que esta configuración no afecta a la primera ventana abierta, que siempre se restaurará al tamaño y ubicación en las que se dejó antes de cerrarla",
      "openWithoutArgumentsInNewWindow": "Controla si debe abrirse una ventana nueva vacía cuando se inicia una segunda instancia sin argumentos o si debe obtener el foco la última instancia en ejecución.\r\nTenga en cuenta que aún puede haber casos en los que este valor se ignore (por ejemplo, al usar la opción de la lí­nea de comandos \"--new-window\" o \"--reuse-window\"). ",
      "restoreFullscreen": "Controla si una ventana se debe restaurar al modo de pantalla completa si se salió de ella en dicho modo.",
      "restoreWindows": "Controla cómo se restauran las ventanas y los editores que contienen al abrir.",
      "security.promptForLocalFileProtocolHandling": "Si se habilita, un cuadro de diálogo solicitará confirmación cada vez que un archivo o área de trabajo local se abra a través de un controlador de protocolo.",
      "security.promptForRemoteFileProtocolHandling": "Si se habilita, un cuadro de diálogo solicitará confirmación cada vez que un archivo o área de trabajo remoto se abra a través de un controlador de protocolo.",
      "showNextWindowTab": "Mostrar siguiente pestaña de ventana",
      "showPreviousTab": "Mostrar pestaña de ventana anterior",
      "telemetry.enableCrashReporting": "Habilite los informes de bloqueo para que se recopilen. Esto nos ayuda a mejorar la estabilidad. \r\nEsta opción requiere reiniciar para surtir efecto.",
      "telemetryConfigurationTitle": "Telemetría",
      "titleBarStyle": "Ajustar la apariencia de la barra de título de la ventana para que sea nativa por el sistema operativo o personalizada. Los cambios requieren un reinicio completo para aplicarse.",
      "toggleWindowTabsBar": "Alternar barra de pestañas de ventana",
      "touchbar.enabled": "Habilita los botones de macOS Touchbar en el teclado si están disponibles.",
      "touchbar.ignored": "Conjunto de identificadores para las entradas de la barra táctil que no deben aparecer (por ejemplo, \"workbench.action.navigateBack\").",
      "window.border.color": "{0}: color específico en formato hexadecimal, RGB, RGBA, HSL, HSLA",
      "window.border.default": "{0}: respetar la configuración del tema de color, volver a la configuración de Windows",
      "window.border.off": "{0}: desactivar los colores de borde",
      "window.border.prefix": "Controla el color del borde de la ventana:",
      "window.border.suffix": "Use {0} para establecer diferentes colores para las ventanas activas e inactivas. Esta configuración se ignora cuando {1} se establece en {2}.",
      "window.border.system": "{0}: respetar únicamente la configuración de Windows",
      "window.clickThroughInactive": "Si está habilitado, haciendo clic en una ventana inactiva, activará dicha ventana y disparará el elemento bajo el cursor del ratón si éste es clicable. Si está deshabilitado, haciendo clic en cualquier lugar en una ventana inactiva, solo activará la misma y será necesario un segundo clic en el elemento. ",
      "window.customTitleBarVisibility": "Ajustar cuándo se debe mostrar la barra de título personalizada. La barra de título personalizada se puede ocultar cuando se está en modo de pantalla completa con \"windowed\". La barra de título personalizada solo se puede ocultar si no está en modo de pantalla completa con \"nunca\" cuando {0} se establece en \"nativo\".",
      "window.customTitleBarVisibility.auto": "Cambia automáticamente la visibilidad de la barra de título personalizada.",
      "window.customTitleBarVisibility.never": "Ocultar la barra de título personalizada cuando {0} esté establecido en \"native\".",
      "window.customTitleBarVisibility.windowed": "Ocultar barra de título personalizada en pantalla completa. Cuando no esté en pantalla completa, cambiar automáticamente la visibilidad de la barra de título personalizada.",
      "window.doubleClickIconToClose": "Si está habilitada, esta configuración cerrará la ventana cuando se haga doble clic en el icono de aplicación de la barra de título. El icono no podrá arrastrar la ventana. Esta configuración solo es efectiva si `{0}` está establecido en `custom`.",
      "window.menuStyle": "Ajuste el estilo del menú para que sea nativo del sistema operativo, personalizado o heredado del estilo de barra de título definido en {0}. Esto también afecta a la apariencia del menú contextual. Los cambios requieren un reinicio completo para aplicarse.",
      "window.menuStyle.custom": "Use el menú personalizado.",
      "window.menuStyle.custom.mac": "Use el menú contextual personalizado.",
      "window.menuStyle.inherit": "Coincide el estilo de menú con el estilo de barra de título definido en {0}.",
      "window.menuStyle.inherit.mac": "Coincide el estilo de menú contextual con el estilo de barra de título definido en {0}.",
      "window.menuStyle.mac": "Ajuste las apariencias del menú contextual para que sea nativo del sistema operativo, personalizado o heredado del estilo de barra de título definido en {0}.",
      "window.menuStyle.native": "Use el menú nativo. Esto se omite cuando {0} se establece en {1}.",
      "window.menuStyle.native.mac": "Use el menú contextual nativo.",
      "window.nativeFullScreen": "Controla si debe usarse el modo nativo de pantalla completa en macOS. Deshabilite esta opción para evitar que macOS cree un espacio nuevo cuando cambie a pantalla completa.",
      "window.nativeTabs": "Habilita las pestañas de ventana nativas de macOS. Tenga en cuenta que los cambios requieren que reinicie el equipo y las pestañas nativas deshabilitan cualquier estilo de barra de título personalizado que haya configurado.",
      "window.newWindowDimensions.default": "Abrir las nuevas ventanas en el centro de la pantalla.",
      "window.newWindowDimensions.fullscreen": "Abrir las nuevas ventanas en modo de pantalla completa.",
      "window.newWindowDimensions.inherit": "Abrir las nuevas ventanas con la misma dimensión que la última activa.",
      "window.newWindowDimensions.maximized": "Abrir las nuevas ventanas maximizadas.",
      "window.newWindowDimensions.offset": "Abra nuevas ventanas con la misma dimensión que la última activa con una posición de desfase.",
      "window.openWithoutArgumentsInNewWindow.off": "Aplique el foco a la última instancia en ejecución activa.",
      "window.openWithoutArgumentsInNewWindow.on": "Abra una ventana nueva vacía.",
      "window.reopenFolders.all": "Volver a abrir todas las ventanas, a menos que se abra una carpeta, un área de trabajo o un archivo (por ejemplo, desde la línea de comandos). Si se abre un archivo, reemplazará cualquiera de los editores que se abrieron anteriormente en una ventana.",
      "window.reopenFolders.folders": "Volver a abrir todas las ventanas que tuvieran carpetas o áreas de trabajo abiertas, a menos que se abra una carpeta, un área de trabajo o un archivo (por ejemplo, desde la línea de comandos). Si se abre un archivo, reemplazará cualquiera de los editores que se abrieron anteriormente en una ventana.",
      "window.reopenFolders.none": "No volver a abrir nunca una ventana. Si no se abre una carpeta o un área de trabajo (por ejemplo, desde la línea de comandos), aparecerá una ventana vacía.",
      "window.reopenFolders.one": "Volver a abrir la última ventana activa, a menos que se abra una carpeta, un área de trabajo o un archivo (por ejemplo, desde la línea de comandos). Si se abre un archivo, reemplazará cualquiera de los editores que se abrieron anteriormente en una ventana.",
      "window.reopenFolders.preserve": "Vuelva a abrir siempre todas las ventanas. Si se abre una carpeta o un área de trabajo (por ejemplo, desde la línea de comandos), se abre como ventana nueva, a menos que se hubiera abierto antes. Si se abren archivos, se abrirán en una de las ventanas restauradas junto con los editores que se abrieron anteriormente.",
      "windowConfigurationTitle": "Ventana",
      "zoomLevel": "Ajuste el nivel de zoom predeterminado para todas las ventanas. Cada incremento por encima de '0' (por ejemplo, '1') o por debajo (por ejemplo, '-1') representa un zoom '20 %' mayor o menor. También puede escribir decimales para ajustar el nivel de zoom con una granularidad más fina. Consulte {0} para configurar si los comandos \"Acercar\" y \"Alejar\" aplican el nivel de zoom a todas las ventanas o solo a la ventana activa.",
      "zoomPerWindow": "Controla si los comandos \"Acercar\" y \"Alejar\" aplican el nivel de zoom a todas las ventanas o solo a la ventana activa. Consulte {0} para configurar un nivel de zoom predeterminado para todas las ventanas."
    },
    "vs/workbench/electron-browser/desktop.main": {
      "join.closeStorage": "Guardando el estado de la interfaz de usuario"
    },
    "vs/workbench/electron-browser/parts/dialogs/dialogHandler": {
      "copy": "&&Copiar",
      "okButton": "Aceptar"
    },
    "vs/workbench/electron-browser/window": {
      "appRootWarning.banner": "Los archivos que almacene en la carpeta de instalación ('{0}') se pueden SOBRESCRIBIR o ELIMINAR DE MANERA IRREVERSIBLE sin previo aviso en el momento de la actualización.",
      "configure": "Configurar",
      "downloadArmBuild": "Descargar",
      "keychainWriteError": "Error al escribir la información de inicio de sesión en la cadena de claves: '{0}'.",
      "learnMore": "Más información",
      "loginButton": "&&Iniciar sesión",
      "password": "Contraseña",
      "proxyAuthRequired": "Autenticación proxy requerida",
      "proxyDetail": "El proxy {0} requiere un nombre de usuario y una contraseña.",
      "rememberCredentials": "Recordar mis credenciales",
      "resolveShellEnvironment": "Resolviendo el entorno de shell...",
      "restart": "Reiniciar",
      "runningAsRoot": "No se recomienda ejecutar {0} como usuario raíz.",
      "runningTranslated": "Está ejecutando una versión emulada de {0}. Para obtener un mejor rendimiento, descargue la versión arm64 nativa de la compilación {0} para su máquina.",
      "sharedProcessCrash": "Un proceso en segundo plano compartido finalizó inesperadamente. Reinicie la aplicación para recuperarla.",
      "showArgvParseWarning": "El archivo de argumentos para el tiempo de ejecución 'argv.json' contiene errores. Corríjalos y reinicie.",
      "showArgvParseWarningAction": "Abrir archivo",
      "shutdownErrorClose": "Un error inesperado impidió que se cerrara la ventana",
      "shutdownErrorDetail": "Error: {0}",
      "shutdownErrorLoad": "Un error inesperado impidió cambiar el área de trabajo",
      "shutdownErrorQuit": "Un error inesperado impidió que la aplicación se cerrara",
      "shutdownErrorReload": "Un error inesperado impidió que se recargara la ventana",
      "shutdownForceClose": "Cerrar de todos modos",
      "shutdownForceLoad": "Cambiar de todos modos",
      "shutdownForceQuit": "Salir de todos modos",
      "shutdownForceReload": "Recargar de todos modos",
      "shutdownTitleClose": "Cerrar la ventana está tardando un poco más de lo esperado...",
      "shutdownTitleLoad": "El cambio del área de trabajo está tardando un poco más de lo esperado...",
      "shutdownTitleQuit": "Salir de la aplicación está tardando un poco más de lo esperado...",
      "shutdownTitleReload": "Volver a cargar la ventana está tardando un poco más de lo esperado...",
      "status.windowZoom": "Zoom de ventana",
      "troubleshooting": "Guía de solución de problemas",
      "username": "Nombre de usuario",
      "willShutdownDetail": "Las siguientes operaciones aún se están ejecutando: \r\n{0}",
      "zoomIn": "Acercar",
      "zoomNumber": "Nivel de zoom: {0} ({1} %)",
      "zoomOut": "Alejar",
      "zoomReset": "Restablecer",
      "zoomResetLabel": "{0} ({1})",
      "zoomSettings": "Configuración"
    },
    "vs/workbench/contrib/accessibility/browser/accessibilityConfiguration": {
      "accessibility.debugWatchVariableAnnouncements": "Controla si se deben anunciar los cambios de variables en la vista de inspección de depuración.",
      "accessibility.hideAccessibleView": "Controla si la vista accesible está oculta.",
      "accessibility.openChatEditedFiles": "Controla si los archivos deben abrirse cuando el agente de chat ha aplicado cambios a los mismos.",
      "accessibility.replEditor.readLastExecutedOutput": "Controla si se anunciará la salida de una ejecución en la REPL nativa.",
      "accessibility.signalOptions.debouncePositionChanges": "Si se deben anular los cambios de posición o no",
      "accessibility.signalOptions.delays.errorAtPosition.announcement": "El retraso en milisegundos antes de que se realice un anuncio cuando hay un error en la posición.",
      "accessibility.signalOptions.delays.errorAtPosition.sound": "El retraso en milisegundos antes de que se reproduzca un sonido cuando hay un error en la posición.",
      "accessibility.signalOptions.delays.general.announcement": "El retraso en milisegundos antes de que se realice un anuncio.",
      "accessibility.signalOptions.delays.general.sound": "El retraso en milisegundos antes de que se reproduzca un sonido.",
      "accessibility.signalOptions.delays.warningAtPosition.announcement": "El retraso en milisegundos antes de que se realice un anuncio cuando hay una advertencia en la posición.",
      "accessibility.signalOptions.delays.warningAtPosition.sound": "El retraso en milisegundos antes de que se reproduzca un sonido cuando hay una advertencia en la posición.",
      "accessibility.signalOptions.volume": "Volumen de las indicaciones de sonido en porcentaje (0-100).",
      "accessibility.signals.chatEditModifiedFile": "Reproduce una señal de sonido o audio al mostrar un archivo con cambios de las ediciones de chat",
      "accessibility.signals.chatEditModifiedFile.sound": "Reproduce un sonido al mostrar un archivo con cambios de las ediciones de chat",
      "accessibility.signals.chatRequestSent": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando se realiza una solicitud de chat.",
      "accessibility.signals.chatRequestSent.announcement": "Anuncia cuando se realiza una solicitud de chat.",
      "accessibility.signals.chatRequestSent.sound": "Reproduce un sonido cuando se realiza una solicitud de chat.",
      "accessibility.signals.chatResponseReceived": "Reproduce una señal de sonido o audio cuando se recibe la respuesta.",
      "accessibility.signals.chatResponseReceived.sound": "Reproduce un sonido cuando se ha recibido la respuesta.",
      "accessibility.signals.chatUserActionRequired": "Reproduce una señal, sonido (indicación de audio) y/o anuncio (alerta), cuando se requiere una acción del usuario en el chat.",
      "accessibility.signals.chatUserActionRequired.announcement": "Anuncia cuándo se requiere una acción del usuario en el chat, incluida información sobre la acción y cómo realizarla.",
      "accessibility.signals.chatUserActionRequired.sound": "Reproduce un sonido cuando se requiere la acción del usuario en el chat.",
      "accessibility.signals.clear": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando se borra una característica (por ejemplo, el terminal, la Consola de depuración o el Canal de salida).",
      "accessibility.signals.clear.announcement": "Anuncia cuando se borra una característica.",
      "accessibility.signals.clear.sound": "Reproduce un sonido cuando se borra una característica.",
      "accessibility.signals.codeActionApplied": "Reproduce una indicación de sonido o audio cuando se ha aplicado la acción de código.",
      "accessibility.signals.codeActionApplied.sound": "Reproduce un sonido cuando se ha aplicado la acción de código.",
      "accessibility.signals.codeActionTriggered": "Reproduce una indicación de sonido o audio cuando se ha desencadenado una acción de código.",
      "accessibility.signals.codeActionTriggered.sound": "Reproduce un sonido cuando se ha desencadenado una acción de código.",
      "accessibility.signals.diffLineDeleted": "Reproduce un sonido o pista de audio cuando el foco se mueve a una línea eliminada en el Modo de visualizador de diferencias accesibles o al cambio siguiente o anterior.",
      "accessibility.signals.diffLineDeleted.sound": "Reproduce un sonido cuando el foco se mueve a una línea eliminada en modo de Visualizador de diferencias accesible o al cambio siguiente o anterior.",
      "accessibility.signals.diffLineInserted": "Reproduce una pista de sonido o audio cuando el foco se mueve a una línea insertada en el Modo de visualizador de diferencias accesibles o al cambio siguiente o anterior.",
      "accessibility.signals.diffLineModified": "Reproduce un sonido o pista de audio cuando el foco se mueve a una línea modificada en el modo Visor de diferencias accesibles o al cambio siguiente o anterior.",
      "accessibility.signals.diffLineModified.sound": "Reproduce un sonido cuando el foco se mueve a una línea modificada en el modo Visor de diferencias accesibles o al cambio siguiente o anterior.",
      "accessibility.signals.editsKept": "Reproduce una señal de sonido (indicación de audio) o anuncio (alerta) cuando se conservan las ediciones.",
      "accessibility.signals.editsKept.announcement": "Anuncia cuándo se conservan las ediciones.",
      "accessibility.signals.editsKept.sound": "Reproduce un sonido cuando se conservan las ediciones.",
      "accessibility.signals.editsUndone": "Reproduce una señal de sonido (indicación de audio) o anuncio (alerta) cuando se han deshecho las ediciones.",
      "accessibility.signals.editsUndone.announcement": "Anuncia cuándo se han deshecho las ediciones.",
      "accessibility.signals.editsUndone.sound": "Reproduce un sonido cuando se han deshecho las ediciones.",
      "accessibility.signals.format": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando se formatea un archivo o bloc de notas.",
      "accessibility.signals.format.always": "Reproduce el sonido siempre que se da formato a un archivo, incluso si se establece en formato al guardar, escribir, pegar o ejecutar una celda.",
      "accessibility.signals.format.announcement": "Anuncia cuando se da formato a un archivo o bloc de notas.",
      "accessibility.signals.format.announcement.always": "Anuncia cada vez que se da formato a un archivo, incluido si se establece en formato al guardar, escribir, pegar o ejecutar una celda.",
      "accessibility.signals.format.announcement.never": "Nunca hace anuncios.",
      "accessibility.signals.format.announcement.userGesture": "Anuncia cuando un usuario da formato explícitamente a un archivo.",
      "accessibility.signals.format.never": "Nunca reproduce el sonido.",
      "accessibility.signals.format.sound": "Reproduce un sonido cuando se da formato a un archivo o bloc de notas.",
      "accessibility.signals.format.userGesture": "Reproduce el sonido cuando un usuario da formato explícitamente a un archivo.",
      "accessibility.signals.lineHasBreakpoint": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando la línea activa tiene un punto de interrupción.",
      "accessibility.signals.lineHasBreakpoint.announcement": "Anuncia cuando la línea activa tiene un punto de interrupción.",
      "accessibility.signals.lineHasBreakpoint.sound": "Reproduce un sonido cuando la línea activa tiene un punto de interrupción.",
      "accessibility.signals.lineHasError": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando la línea activa tiene un error.",
      "accessibility.signals.lineHasError.announcement": "Anuncia cuando la línea activa tiene un error.",
      "accessibility.signals.lineHasError.sound": "Reproduce un sonido cuando la línea activa tiene un error.",
      "accessibility.signals.lineHasFoldedArea": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta): la línea activa tiene un área doblada que se puede desplegar.",
      "accessibility.signals.lineHasFoldedArea.announcement": "Anuncia cuando la línea activa tiene un área doblada que se puede expandir.",
      "accessibility.signals.lineHasFoldedArea.sound": "Reproduce un sonido cuando la línea activa tiene un área doblada que se puede desplegar.",
      "accessibility.signals.lineHasInlineSuggestion": "Reproduce una indicación de sonido o audio cuando la línea activa tiene una sugerencia en línea.",
      "accessibility.signals.lineHasInlineSuggestion.sound": "Reproduce un sonido cuando la línea activa tiene una sugerencia insertada.",
      "accessibility.signals.lineHasWarning": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando la línea activa tiene una advertencia.",
      "accessibility.signals.lineHasWarning.announcement": "Anuncia cuando la línea activa tiene una advertencia.",
      "accessibility.signals.lineHasWarning.sound": "Reproduce un sonido cuando la línea activa tiene una advertencia.",
      "accessibility.signals.nextEditSuggestion": "Reproduce una señal: sonido o aviso (alerta) cuando hay una nueva sugerencia de edición.",
      "accessibility.signals.nextEditSuggestion.announcement": "Anuncia cuando hay una nueva sugerencia de edición.",
      "accessibility.signals.nextEditSuggestion.sound": "Reproduce un sonido cuando hay una nueva sugerencia de edición.",
      "accessibility.signals.noInlayHints": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) al intentar leer una línea con sugerencias de incrustación que no tiene sugerencias de incrustación.",
      "accessibility.signals.noInlayHints.announcement": "Anuncia cuando se intenta leer una línea con sugerencias de incrustación que no tiene sugerencias de incrustación.",
      "accessibility.signals.noInlayHints.sound": "Reproduce un sonido al intentar leer una línea con sugerencias de incrustación que no tiene sugerencias de incrustación.",
      "accessibility.signals.notebookCellCompleted": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando se completa correctamente la ejecución de una celda del bloc de notas.",
      "accessibility.signals.notebookCellCompleted.announcement": "Anuncia cuando se completa correctamente la ejecución de una celda del cuaderno.",
      "accessibility.signals.notebookCellCompleted.sound": "Reproduce un sonido cuando la ejecución de una celda del bloc de notas se completa correctamente.",
      "accessibility.signals.notebookCellFailed": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando se produce un error en la ejecución de una celda del cuaderno.",
      "accessibility.signals.notebookCellFailed.announcement": "Anuncia cuando se produce un error en la ejecución de una celda del cuaderno.",
      "accessibility.signals.notebookCellFailed.sound": "Reproduce un sonido cuando se produce un error en la ejecución de una celda del bloc de notas.",
      "accessibility.signals.onDebugBreak": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando el depurador se detiene en un punto de interrupción.",
      "accessibility.signals.onDebugBreak.announcement": "Anuncia cuando se detuvo el depurador en un punto de interrupción.",
      "accessibility.signals.onDebugBreak.sound": "Reproduce un sonido cuando el depurador se detiene en un punto de interrupción.",
      "accessibility.signals.positionHasError": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando la línea activa tiene una advertencia.",
      "accessibility.signals.positionHasError.announcement": "Anuncia cuando la línea activa tiene una advertencia.",
      "accessibility.signals.positionHasError.sound": "Reproduce un sonido cuando la línea activa tiene una advertencia.",
      "accessibility.signals.positionHasWarning": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando la línea activa tiene una advertencia.",
      "accessibility.signals.positionHasWarning.announcement": "Anuncia cuando la línea activa tiene una advertencia.",
      "accessibility.signals.positionHasWarning.sound": "Reproduce un sonido cuando la línea activa tiene una advertencia.",
      "accessibility.signals.progress": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) en bucle mientras se produce el progreso.",
      "accessibility.signals.progress.announcement": "Alertas en bucle mientras se produce el progreso.",
      "accessibility.signals.progress.sound": "Reproduce un sonido en bucle mientras se produce el progreso.",
      "accessibility.signals.save": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando se guarda un archivo.",
      "accessibility.signals.save.announcement": "Anuncia cuando se guarda un archivo.",
      "accessibility.signals.save.announcement.always": "Anuncia cuándo se guarda un archivo, incluso si se guarda automáticamente.",
      "accessibility.signals.save.announcement.never": "Nunca reproduce el anuncio.",
      "accessibility.signals.save.announcement.userGesture": "Anuncia cuándo un usuario guarda explícitamente un archivo.",
      "accessibility.signals.save.sound": "Reproduce un sonido cuando se guarda un archivo.",
      "accessibility.signals.save.sound.always": "Reproduce el sonido cada vez que se guarda un archivo, incluido el guardado automático.",
      "accessibility.signals.save.sound.never": "Nunca reproduce el sonido.",
      "accessibility.signals.save.sound.userGesture": "Reproduce el sonido cuando un usuario guarda explícitamente un archivo.",
      "accessibility.signals.sound": "Reproduce un sonido cuando el foco se mueve a una línea insertada en el modo Visor de diferencias accesibles o al cambio siguiente o anterior.",
      "accessibility.signals.taskCompleted": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando se completa una tarea.",
      "accessibility.signals.taskCompleted.announcement": "Anuncia cuando se completa una tarea.",
      "accessibility.signals.taskCompleted.sound": "Reproduce un sonido cuando se completa una tarea.",
      "accessibility.signals.taskFailed": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando se produce un error en una tarea (código de salida distinto de cero).",
      "accessibility.signals.taskFailed.announcement": "Anuncia cuando se produce un error en una tarea (código de salida distinto de cero).",
      "accessibility.signals.taskFailed.sound": "Reproduce un sonido cuando se produce un error en una tarea (código de salida distinto de cero).",
      "accessibility.signals.terminalBell": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando suena la campana del terminal.",
      "accessibility.signals.terminalBell.announcement": "Anuncia cuando suena la campana del terminal.",
      "accessibility.signals.terminalBell.sound": "Reproduce un sonido cuando suena la campana del terminal.",
      "accessibility.signals.terminalCommandFailed": "Reproduce una señal o sonido (pista de audio) y/o anuncio (alerta) cuando se produce un error en un comando de terminal (código de salida distinto de cero) o cuando se navega a un comando con dicho código de salida en la vista accesible.",
      "accessibility.signals.terminalCommandFailed.announcement": "Anuncia cuando se produce un error en un comando de terminal (código de salida distinto de cero) o cuando se navega a un comando con este tipo de código de salida en la vista accesible.",
      "accessibility.signals.terminalCommandFailed.sound": "Reproduce un sonido cuando se produce un error en un comando de terminal (código de salida distinto de cero) o cuando se navega a un comando con este tipo de código de salida en la vista accesible.",
      "accessibility.signals.terminalCommandSucceeded": "Reproduce una señal ―sonido (indicador de audio) y/o anuncio (alerta)― cuando un comando de terminal se ejecuta con éxito (código de salida cero) o cuando se navega a un comando con dicho código de salida en la vista accesible.",
      "accessibility.signals.terminalCommandSucceeded.announcement": "Anuncia cuándo se produce un error en un comando de terminal (código de salida distinto de cero) o cuando se navega a un comando con dicho código de salida en la vista accesible.",
      "accessibility.signals.terminalCommandSucceeded.sound": "Reproduce un sonido cuando un comando de terminal se ejecuta correctamente (código de salida cero) o cuando se navega hasta un comando con dicho código de salida en la vista accesible.",
      "accessibility.signals.terminalQuickFix": "Reproduce una señal o sonido (pista de audio) o anuncio (alerta) cuando las correcciones rápidas del terminal están disponibles.",
      "accessibility.signals.terminalQuickFix.announcement": "Anuncia cuando están disponibles las correcciones rápidas del terminal.",
      "accessibility.signals.terminalQuickFix.sound": "Reproduce un sonido cuando hay correcciones rápidas de terminal disponibles.",
      "accessibility.signals.voiceRecordingStarted": "Reproduce un sonido o pista de audio cuando se inicia la grabación de voz.",
      "accessibility.signals.voiceRecordingStarted.sound": "Reproduce un sonido cuando se inicia la grabación de voz.",
      "accessibility.signals.voiceRecordingStopped": "Reproduce un sonido o pista de audio cuando se detiene la grabación de voz.",
      "accessibility.signals.voiceRecordingStopped.sound": "Reproduce un sonido cuando se detiene la grabación de voz.",
      "accessibility.underlineLinks": "Controla si los vínculos deben estar subrayados en el área de trabajo.",
      "accessibility.verboseChatProgressUpdates": "Controla si se deben hacer anuncios detallados del progreso cuando hay una solicitud de chat en curso, incluida información como el texto buscado para <search term> con X resultados, el archivo creado <file_name> o el archivo leído <file path>.",
      "accessibility.voice.autoSynthesize.off": "Deshabilite la característica.",
      "accessibility.voice.autoSynthesize.on": "Habilite la característica. Cuando se habilita un lector de pantalla, tenga en cuenta que esto deshabilitará las actualizaciones de aria.",
      "accessibility.windowTitleOptimized": "Controla si el {0} debe optimizarse para los lectores de pantalla en el modo de lector de pantalla. Cuando se habilita, el título de la ventana se habrá {1} anexado al final.",
      "accessibilityConfigurationTitle": "Accesibilidad",
      "announcement.enabled.auto": "Habilitar anuncio. Solo se reproducirá cuando se encuentre en el modo optimizado del lector de pantalla.",
      "announcement.enabled.off": "Deshabilitar el anuncio.",
      "autoSynthesize": "Si una respuesta textual debe leerse automáticamente en voz alta cuando se usó la voz como entrada. Por ejemplo, en una sesión de chat, una respuesta se sintetiza automáticamente cuando se usa la voz como solicitud de chat.",
      "dimUnfocusedEnabled": "Indica si se van a atenuar los terminales y los editores sin foco, lo que hace que sea más claro a dónde se dirigirá la entrada escrita. Funciona con la mayoría de los editores, excepto aquellos que usan iframes como blocs de notas y editores de vista web de extensión.",
      "dimUnfocusedOpacity": "Fracción de opacidad (de 0,2 a 1,0) que se va a usar para los editores y terminales sin foco. Esto solo surtirá efecto cuando {0} esté habilitado.",
      "replEditor.autoFocusAppendedCell": "Controlar si el foco se debe enviar automáticamente a REPL cuando se ejecuta el código.",
      "sound.enabled.auto": "Habilita el sonido cuando se conecta un lector de pantalla.",
      "sound.enabled.autoWindow": "Habilita el sonido cuando se conecta un lector de pantalla.",
      "sound.enabled.off": "Deshabilitar el sonido.",
      "sound.enabled.on": "Habilitar sonido.",
      "speechLanguage.auto": "Automático (usar idioma para mostrar)",
      "terminal.integrated.accessibleView.closeOnKeyPress": "Al presionar la tecla, cerrar la vista accesible y enfocar el elemento desde el que se invocó.",
      "verbosity.chat.description": "Proporcionar información sobre cómo acceder al menú de ayuda del chat cuando la entrada del chat está centrada.",
      "verbosity.comments": "Proporcione información sobre las acciones que se pueden realizar en el widget de comentarios o en un archivo que contenga comentarios.",
      "verbosity.debug": "Proporciona información sobre cómo acceder al cuadro de diálogo de ayuda de accesibilidad de la consola de depuración cuando se centra la consola de depuración o el viewlet de ejecución y depuración. Tenga en cuenta que se requiere una recarga de la ventana para que esto surta efecto.",
      "verbosity.diffEditor.description": "Proporcionar información sobre cómo navegar por los cambios en el editor de diferencias cuando se centra.",
      "verbosity.diffEditorActive": "Indicar cuándo un editor de diferencias se convierte en el editor activo.",
      "verbosity.emptyEditorHint": "Proporcione información sobre las acciones relevantes en un editor de texto vacío.",
      "verbosity.hover": "Proporcionar información sobre cómo abrir el puntero en una vista accesible.",
      "verbosity.inlineCompletions.description": "Proporcionar información sobre cómo obtener acceso a mantener el mouse durante las finalizaciones de forma insertada y a la vista accesible.",
      "verbosity.interactiveEditor.description": "Proporcionar información sobre cómo acceder al menú de ayuda de accesibilidad del chat del editor insertado y alertar con sugerencias que describen cómo usar la característica cuando la entrada está centrada.",
      "verbosity.keybindingsEditor.description": "Proporcionar información sobre cómo cambiar un enlace de teclado en el editor de enlaces de teclado cuando se centra una fila.",
      "verbosity.notebook": "Proporcione información sobre cómo enfocar el contenedor de celdas o el editor interno cuando se centra una celda del bloc de notas.",
      "verbosity.notification": "Proporcionar información sobre cómo abrir la notificación en una vista accesible.",
      "verbosity.replEditor.description": "Proporcione información acerca de cómo acceder al menú de ayuda de accesibilidad del editor REPL cuando el editor REPL esté centrado.",
      "verbosity.scm": "Proporciona información sobre cómo acceder al menú de ayuda de accesibilidad del control de código fuente cuando la entrada está centrada.",
      "verbosity.terminal.description": "Proporcionar información sobre cómo acceder al menú de ayuda de accesibilidad del terminal cuando el terminal está centrado.",
      "verbosity.walkthrough": "Proporcionar información sobre cómo abrir el tutorial en una vista accesible.",
      "voice.ignoreCodeBlocks": "Indica si se deben omitir los fragmentos de código en la síntesis de texto a voz.",
      "voice.speechLanguage": "El idioma que deben usar la conversión de texto a voz y la conversión de voz en texto. Seleccione \"auto\" para usar el idioma de visualización configurado si es posible. Tenga en cuenta que no todos los idiomas de visualización pueden ser compatibles con el reconocimiento de voz y los sintetizadores.",
      "voice.speechTimeout": "La duración en milisegundos que el reconocimiento de voz de voz permanece activo después de dejar de hablar. Por ejemplo, en una sesión de chat, el texto transcrito se envía automáticamente cuando se acaba el tiempo de espera. Establézcalo en \"0\" para desactivar esta característica."
    },
    "vs/workbench/contrib/accessibility/browser/accessibilityStatus": {
      "screenReaderDetected": "Lector de pantalla optimizado",
      "screenReaderDetectedExplanation.answerLearnMore": "Más información",
      "screenReaderDetectedExplanation.answerNo": "No",
      "screenReaderDetectedExplanation.answerYes": "Sí",
      "screenReaderDetectedExplanation.question": "Se detectó el uso del lector de pantalla. ¿Desea habilitar {0} para optimizar el editor para el uso del lector de pantalla?",
      "status.editor.screenReaderMode": "Modo lector de pantalla"
    },
    "vs/workbench/contrib/accessibility/browser/accessibleView": {
      "accessibility-help": "Ayuda de accesibilidad",
      "accessibility-help-hint": "Ayuda de accesibilidad, {0}",
      "accessible-view": "Vista accesible",
      "accessible-view-hint": "Vista accesible, {0}",
      "accessibleHelpToolbar": "Ayuda de accesibilidad",
      "accessibleViewNextPreviousHint": "Muestra el elemento siguiente{0} o el elemento anterior{1}.",
      "accessibleViewSymbolQuickPickPlaceholder": "Escriba para buscar símbolos",
      "accessibleViewSymbolQuickPickTitle": "Ir al símbolo en la vista accesible",
      "accessibleViewToolbar": "Vista accesible",
      "acessibleViewDisableHint": "\r\nDeshabilite el nivel de detalle de accesibilidad para esta característica{0}.",
      "acessibleViewHint": "Inspeccione esto en la vista accesible con {0}",
      "acessibleViewHintNoKbEither": "Inspeccione esto en la vista accesible mediante el comando Abrir vista accesible, que actualmente no se puede desencadenar mediante el enlace de teclado.",
      "ariaAccessibleViewActions": "Explore acciones como deshabilitar esta sugerencia (Mayús+Tabulador).",
      "ariaAccessibleViewActionsBottom": "Explore acciones como deshabilitar esta sugerencia (Mayús+Tabulador), use Escape para salir de este cuadro de diálogo.",
      "configureKb": "\r\nConfigure enlaces de teclado para comandos que carecen de ellos {0}.",
      "configureKbAssigned": "\r\nConfigure enlaces de teclado para los comandos que ya tienen asignaciones {0}.",
      "disableAccessibilityHelp": "El nivel de detalle de accesibilidad {0} ahora está deshabilitado",
      "exit": "\r\nSalga de este cuadro de diálogo (Escape).",
      "goToSymbolHint": "Vaya a un símbolo{0}.",
      "insertAtCursor": " - Insertar el bloque de código en el cursor{0}.",
      "insertIntoNewFile": " - Insertar el bloque de código en un nuevo archivo{0}.",
      "intro": "En la vista accesible, puede:\r\n",
      "keybindings": "Configurar los enlaces de teclado",
      "openDoc": "\r\nAbra una ventana del explorador con más información relacionada con la accesibilidad{0}.",
      "runInTerminal": " - Ejecutar el bloque de código en el terminal{0}.\r\n",
      "selectKeybinding": "Seleccionar un id. de comando para configurar un enlace de teclado para él",
      "symbolLabel": "({0}) {1}",
      "symbolLabelAria": "({0}) {1}",
      "toolbar": "Vaya a la barra de herramientas (Mayús+Tab)."
    },
    "vs/workbench/contrib/accessibility/browser/accessibleViewActions": {
      "editor.action.accessibilityHelp": "Abrir la ayuda de accesibilidad",
      "editor.action.accessibilityHelpConfigureAssignedKeybindings": "Ayuda de accesibilidad Para configurar enlaces de teclado asignados",
      "editor.action.accessibilityHelpConfigureUnassignedKeybindings": "Ayuda de accesibilidad para configurar enlaces de teclado sin asignar",
      "editor.action.accessibilityHelpOpenHelpLink": "Ayuda de accesibilidad para abrir el vínculo de ayuda",
      "editor.action.accessibleView": "Abrir Vista accesible",
      "editor.action.accessibleViewAcceptInlineCompletionAction": "Aceptar finalización insertada",
      "editor.action.accessibleViewDisableHint": "Deshabilitar sugerencia de vista accesible",
      "editor.action.accessibleViewGoToSymbol": "Ir al símbolo en la vista accesible",
      "editor.action.accessibleViewNext": "Mostrar siguiente en vista accesible",
      "editor.action.accessibleViewNextCodeBlock": "Vista accesible: siguiente bloque de código",
      "editor.action.accessibleViewPrevious": "Mostrar anterior en vista accesible",
      "editor.action.accessibleViewPreviousCodeBlock": "Vista accesible: bloque de código anterior"
    },
    "vs/workbench/contrib/accessibilitySignals/browser/commands": {
      "accessibility.announcement.help": "Ayuda: enumerar anuncios de señal",
      "accessibility.announcement.help.description": "Enumerar todos los anuncios de accesibilidad, alertas, mensajes braille y configurar sus opciones",
      "accessibility.sound.help.description": "Enumerar todos los sonidos, ruidos o indicaciones de audio de accesibilidad y configurar sus opciones",
      "announcement.help.placeholder": "Seleccionar un anuncio para configurar",
      "announcement.help.placeholder.disabled": "El lector de pantalla no está activo. Los anuncios están deshabilitados de forma predeterminada.",
      "announcement.help.settings": "Configurar anuncio",
      "signals.sound.help": "Ayuda: enumerar sonidos de señal",
      "sounds.help.placeholder": "Seleccionar un sonido para reproducir y configurar",
      "sounds.help.settings": "Configurar sonido"
    },
    "vs/workbench/contrib/accessibilitySignals/browser/openDiffEditorAnnouncement": {
      "openDiffEditorAnnouncement": "Editor de diferencias"
    },
    "vs/workbench/contrib/accountEntitlements/browser/accountsEntitlements.contribution": {
      "workbench.accounts.showEntitlements": "When enabled, available entitlements for the account will be shown in the accounts menu."
    },
    "vs/workbench/contrib/audioCues/browser/audioCues.contribution": {
      "audioCues.chatRequestSent": "Reproduce un sonido cuando se realiza una solicitud de chat.",
      "audioCues.chatResponsePending": "Reproduce un sonido en bucle mientras la respuesta está pendiente.",
      "audioCues.chatResponseReceived": "Reproduce un sonido en bucle mientras la respuesta se ha recibido.",
      "audioCues.clear": "Reproduce un sonido cuando se borra una característica (por ejemplo, el terminal, la Consola de depuración o el canal de salida). Cuando esta opción está deshabilitada, una alerta ARIA anunciará \"Borrado\".",
      "audioCues.debouncePositionChanges": "Si se deben anular los cambios de posición o no",
      "audioCues.diffLineDeleted": "Reproduce un sonido cuando el foco se mueve a una línea eliminada en modo de Visualizador de diferencias accesible o al cambio siguiente o anterior.",
      "audioCues.diffLineInserted": "Reproduce un sonido cuando el foco se mueve a una línea insertada en el modo Visor de diferencias accesibles o al cambio siguiente o anterior.",
      "audioCues.diffLineModified": "Reproduce un sonido cuando el foco se mueve a una línea modificada en el modo Visor de diferencias accesibles o al cambio siguiente o anterior.",
      "audioCues.enabled.auto": "Habilita las indicaciones de audio cuando se conecta un lector de pantalla.",
      "audioCues.enabled.off": "Deshabilitar indicaciones de audio.",
      "audioCues.enabled.on": "Habilite indicaciones de audio.",
      "audioCues.format": "Reproduce un sonido cuando se da formato a un archivo o bloc de notas. Consulte también {0}",
      "audioCues.format.always": "Reproduce la indicación de audio siempre que se da formato a un archivo, incluido si se establece en formato al guardar, escribir o pegar o ejecutar una celda.",
      "audioCues.format.never": "Nunca reproduce la indicación de audio.",
      "audioCues.format.userGesture": "Reproduce la indicación de audio cuando un usuario da formato explícitamente a un archivo.",
      "audioCues.lineHasBreakpoint": "Reproduce un sonido cuando la línea activa tiene un punto de interrupción.",
      "audioCues.lineHasError": "Reproduce un sonido cuando la línea activa tiene un error.",
      "audioCues.lineHasFoldedArea": "Reproduce un sonido cuando la línea activa tiene un área doblada que se puede desplegar.",
      "audioCues.lineHasInlineSuggestion": "Reproduce un sonido cuando la línea activa tiene una sugerencia insertada.",
      "audioCues.lineHasWarning": "Reproduce un sonido cuando la línea activa tiene una advertencia.",
      "audioCues.noInlayHints": "Reproduce un sonido al intentar leer una línea con sugerencias de incrustación que no tiene sugerencias de incrustación.",
      "audioCues.notebookCellCompleted": "Reproduce un sonido cuando la ejecución de una celda del bloc de notas se completa correctamente.",
      "audioCues.notebookCellFailed": "Reproduce un sonido cuando se produce un error en la ejecución de una celda del bloc de notas.",
      "audioCues.onDebugBreak": "Reproduce un sonido cuando el depurador se detiene en un punto de interrupción.",
      "audioCues.save": "Reproduce un sonido cuando se guarda un archivo. Consulte también {0}",
      "audioCues.save.always": "Reproduce la indicación de audio cada vez que se guarda un archivo, incluido el guardado automático.",
      "audioCues.save.never": "Nunca reproduce la indicación de audio.",
      "audioCues.save.userGesture": "Reproduce la indicación de audio cuando un usuario guarda explícitamente un archivo.",
      "audioCues.taskCompleted": "Reproduce un sonido cuando se completa una tarea.",
      "audioCues.taskFailed": "Reproduce un sonido cuando se produce un error en una tarea (código de salida distinto de cero).",
      "audioCues.terminalCommandFailed": "Reproduce un sonido cuando se produce un error en un comando de terminal (código de salida distinto de cero).",
      "audioCues.terminalQuickFix": "Reproduce un sonido cuando hay correcciones rápidas de terminal disponibles.",
      "audioCues.volume": "Volumen de las indicaciones de audio en porcentaje (0-100)."
    },
    "vs/workbench/contrib/audioCues/browser/commands": {
      "accessibility.alert.help": "Ayuda: lista de alertas",
      "alerts.help.placeholder": "Inspeccionar y configurar el estado de una alerta",
      "alerts.help.settings": "Habilitar/deshabilitar indicaciones de audio",
      "audioCues.help": "Ayuda: Enumerar indicaciones de audio",
      "audioCues.help.placeholder": "Seleccionar una indicación de audio para reproducir",
      "audioCues.help.settings": "Habilitar/deshabilitar indicaciones de audio",
      "disabled": "Deshabilitado"
    },
    "vs/workbench/contrib/authentication/browser/actions/manageAccountPreferencesForExtensionAction": {
      "accounts": "Cuentas",
      "currentAccount": "Cuenta actual",
      "manageAccountPreferenceForExtension": "Administrar preferencias de cuenta de extensión",
      "noAccountUsage": "Esta extensión aún no se ha usado en ninguna cuenta.",
      "noAccounts": "Esta extensión no usa cuentas actualmente.",
      "pickAProviderTitle": "Administrar preferencias de cuenta de extensión",
      "placeholder v2": "Administrar las preferencias de la cuenta \"{0}\" para {1}...",
      "selectExtension": "Seleccione una extensión para administrar las preferencias de cuenta para",
      "selectProvider": "Seleccione un proveedor de autenticación para el que administrar las preferencias de cuenta",
      "title": "'{0}' preferencias de la cuenta para esta área de trabajo",
      "use new account": "Usar una cuenta nueva..."
    },
    "vs/workbench/contrib/authentication/browser/actions/manageAccountPreferencesForMcpServerAction": {
      "accounts": "Cuentas",
      "currentAccount": "Cuenta actual",
      "manageAccountPreferenceForMcpServer": "Administrar preferencias de cuenta del servidor MCP",
      "noAccountUsage": "Este servidor MCP aún no ha usado ninguna cuenta.",
      "noAccounts": "Actualmente, este servidor MCP no utiliza cuentas.",
      "pickAProviderTitle": "Administrar preferencias de cuenta del servidor MCP",
      "placeholder v2": "Administrar las preferencias de la cuenta \"{0}\" para {1}...",
      "selectProvider": "Seleccione un proveedor de autenticación para el que administrar las preferencias de cuenta",
      "title": "'{0}' preferencias de la cuenta para esta área de trabajo",
      "use new account": "Usar una cuenta nueva..."
    },
    "vs/workbench/contrib/authentication/browser/actions/manageDynamicAuthenticationProvidersAction": {
      "authenticationCategory": "Autenticación",
      "clientId": "Id. de cliente: {0}",
      "confirmDeleteDetail": "Esto eliminará todos los datos de autenticación almacenados para los proveedores seleccionados. Tendrá que volver a autenticarse si utiliza estos proveedores nuevamente.",
      "confirmDeleteMultipleProviders": "¿Está seguro de que quiere quitar {0} proveedores de autenticación dinámica: {1}?",
      "confirmDeleteSingleProvider": "¿Está seguro de que desea eliminar el proveedor de autenticación dinámica \"{0}\"?",
      "noDynamicProviders": "No hay proveedores de autenticación dinámica",
      "noDynamicProvidersDetail": "Aún no se ha utilizado ningún proveedor de autenticación dinámica.",
      "remove": "Quitar",
      "removeDynamicAuthProviders": "Eliminar proveedores de autenticación dinámica",
      "selectProviderToRemove": "Seleccione un proveedor de autenticación dinámica para eliminar"
    },
    "vs/workbench/contrib/authentication/browser/actions/manageTrustedExtensionsForAccountAction": {
      "accountLastUsedDate": "Último uso de esta cuenta {0}",
      "accountPreferences": "Administrar preferencias de cuenta para esta extensión",
      "accounts": "Cuentas",
      "manageExtensions": "Elija qué extensiones pueden acceder a esta cuenta",
      "manageTrustedExtensions": "Administrar extensiones de confianza",
      "manageTrustedExtensions.cancel": "Cancelar",
      "manageTrustedExtensionsForAccount": "Administrar extensiones de confianza para la cuenta",
      "noTrustedExtensions": "Esta cuenta no se ha usado en ninguna extensión.",
      "notUsed": "No ha usado esta cuenta",
      "pickAccount": "Elija una cuenta para la que administrar extensiones de confianza",
      "trustedExtensionTooltip": "Esta extensión es de confianza para Microsoft y\r\nsiempre tiene acceso a esta cuenta",
      "trustedExtensions": "De confianza para Microsoft"
    },
    "vs/workbench/contrib/authentication/browser/actions/manageTrustedMcpServersForAccountAction": {
      "accountLastUsedDate": "Último uso de esta cuenta {0}",
      "accountPreferences": "Administrar preferencias de cuenta para este servidor MCP",
      "accounts": "Cuentas",
      "manageMcpServers": "Elija qué servidores MCP pueden acceder a esta cuenta",
      "manageTrustedMcpServers": "Administrar servidores MCP de confianza",
      "manageTrustedMcpServers.cancel": "Cancelar",
      "manageTrustedMcpServersForAccount": "Administrar servidores MCP de confianza para la cuenta",
      "noTrustedMcpServers": "Esta cuenta no se ha usado en ningún servidor MCP.",
      "notUsed": "No ha usado esta cuenta",
      "pickAccount": "Elija una cuenta para administrar servidores MCP de confianza",
      "trustedMcpServerTooltip": "Este servidor MCP es de confianza para Microsoft y\r\nsiempre tiene acceso a esta cuenta",
      "trustedMcpServers": "De confianza para Microsoft"
    },
    "vs/workbench/contrib/authentication/browser/actions/signOutOfAccountAction": {
      "signOut": "&&Cerrar sesión",
      "signOutMessage": "La cuenta '{0}' ha sido utilizada por:\r\n\r\n{1}\r\n\r\n ¿Cerrar sesión en estas extensiones?",
      "signOutMessageSimple": "¿Cerrar la sesión de \"{0}\"?",
      "signOutOfAccount": "Cerrar sesión en la cuenta"
    },
    "vs/workbench/contrib/authentication/browser/authentication.contribution": {
      "authentication": "Autenticación",
      "authenticationMcpAuthorizationServers": "Servidores de autorización MCP",
      "authenticationid": "Id.",
      "authenticationlabel": "Etiqueta"
    },
    "vs/workbench/contrib/bulkEdit/browser/bulkEditService": {
      "areYouSureQuiteBulkEdit.detail": "\"{0}\" está en curso.",
      "changeWorkspace.message": "¿Está seguro de que desea cambiar el área de trabajo?",
      "closeTheWindow.message": "¿Está seguro de que desea cerrar la ventana?",
      "fileOperation": "Operación de archivos",
      "nothing": "No se realizaron ediciones",
      "quitMessage": "¿Está seguro de que quiere salir?",
      "quitMessageMac": "¿Está seguro de que desea salir?",
      "refactoring.autoSave": "Controla si los archivos que formaron parte de una refactorización se guardan automáticamente",
      "reloadTheWindow.message": "¿Está seguro de que desea volver a cargar la ventana?",
      "summary.0": "No se realizaron ediciones",
      "summary.n0": "{0} ediciones de texto en un archivo",
      "summary.nm": "{0} ediciones de texto en {1} archivos",
      "summary.textFiles": "Se han realizado {0} ediciones de texto en {1} archivos, también creados o eliminados {2} archivos",
      "workspaceEdit": "Edición del área de trabajo"
    },
    "vs/workbench/contrib/bulkEdit/browser/preview/bulkEdit.contribution": {
      "Discard": "Descartar refactorización",
      "apply": "Aplicar refactorización",
      "cat": "Vista previa de refactorización",
      "continue": "&&Continuar",
      "detail": "Pulse \"Continuar\" para descartar la refactorización anterior y continuar con la refactorización actual.",
      "groupByFile": "Agrupar cambios por archivo",
      "groupByType": "Agrupar cambios por tipo",
      "overlap": "Se está previsualizando otra refactorización.",
      "panel": "Vista previa de refactorización",
      "refactorPreviewViewIcon": "Vea el icono de vista previa de refactorización.",
      "toogleSelection": "Alternar cambio"
    },
    "vs/workbench/contrib/bulkEdit/browser/preview/bulkEditPane": {
      "cancel": "Descartar",
      "conflict.1": "No se puede aplicar la refactorización porque \"{0}\" ha cambiado mientras tanto.",
      "conflict.N": "No se puede aplicar la refactorización porque {0} otros archivos han cambiado mientras tanto.",
      "empty.msg": "Invoque una acción de código, como cambiar el nombre, para ver aquí una vista previa de sus cambios.",
      "ok": "Aplicar"
    },
    "vs/workbench/contrib/bulkEdit/browser/preview/bulkEditPreview": {
      "default": "Otro"
    },
    "vs/workbench/contrib/bulkEdit/browser/preview/bulkEditTree": {
      "aria.create": "Creando {0}",
      "aria.createAndEdit": "Creando {0}, también editando texto",
      "aria.del": "línea {0}, quitando {1}",
      "aria.delete": "Eliminando {0}",
      "aria.deleteAndEdit": "Eliminando {0}, también realizando ediciones de texto",
      "aria.editOnly": "{0}, editando el texto",
      "aria.insert": "línea {0}, insertando {1}",
      "aria.rename": "Cambiar el nombre de {0} a {1}",
      "aria.renameAndEdit": "Cambiando el nombre de {0} a {1}, también haciendo ediciones de texto",
      "aria.replace": "Línea {0}, reemplazando {1} por {2}",
      "bulkEdit": "Edición en masa",
      "detail.create": "(creando)",
      "detail.del": "(eliminando)",
      "detail.rename": "(cambio de nombre)",
      "rename.label": "{0} → {1}",
      "title": "{0} - {1}"
    },
    "vs/workbench/contrib/callHierarchy/browser/callHierarchy.contribution": {
      "callHierarchyDirection": "Indica si la jerarquía de llamadas muestra llamadas entrantes o salientes",
      "callHierarchyVisible": "Indica si se muestra la inspección de la jerarquía de llamadas",
      "close": "Cerrar",
      "editorHasCallHierarchyProvider": "Indica si hay disponible un proveedor de jerarquía de llamadas",
      "error": "No se pudo mostrar la jerarquía de llamadas",
      "no.item": "No hay resultados",
      "showIncomingCallsIcons": "Icono de llamadas entrantes en la vista de la jerarquía de llamadas.",
      "showOutgoingCallsIcon": "Icono de llamadas salientes en la vista de la jerarquía de llamadas.",
      "title": "Jerarquía de llamadas de inspección",
      "title.incoming": "Mostrar llamadas entrantes",
      "title.outgoing": "Mostrar llamadas salientes",
      "title.refocus": "Reenfocar jerarquía de llamadas"
    },
    "vs/workbench/contrib/callHierarchy/browser/callHierarchyPeek": {
      "callFrom": "Llamadas desde \"{0}\"",
      "callsTo": "Llamadas de \"{0}\"",
      "empt.callsFrom": "No hay llamadas de \"{0}\"",
      "empt.callsTo": "No hay personas que llamen de \"{0}\"",
      "title.loading": "Cargando..."
    },
    "vs/workbench/contrib/callHierarchy/browser/callHierarchyTree": {
      "from": "llamadas desde {0}",
      "to": "autores de llamada de {0}",
      "tree.aria": "Jerarquía de llamadas"
    },
    "vs/workbench/contrib/chat/browser/actions/chatAccessibilityActions": {
      "chat.category": "Chat",
      "chatNotReady": "La interfaz de chat no está lista.",
      "focusChatConfirmation": "Confirmación del chat de concentración",
      "noChatSession": "No se encontró ninguna sesión de chat activa.",
      "noConfirmationRequired": "No se requiere confirmación de chat"
    },
    "vs/workbench/contrib/chat/browser/actions/chatAccessibilityHelp": {
      "chat.announcement": "Las respuestas del chat se anunciarán a medida que vayan llegando. Una respuesta indicará el número de bloques de código, si los hay, y a continuación el resto de la respuesta.",
      "chat.differencePanel": "La vista de chat del panel es una interfaz persistente que también admite la navegación por las preguntas de seguimiento sugeridas, mientras que la vista de chat rápido es una interfaz transitoria para realizar y ver solicitudes.",
      "chat.differenceQuick": "La vista de chat rápido es una interfaz transitoria para realizar y ver solicitudes, mientras que la vista de chat del panel es una interfaz persistente que también admite la navegación por las preguntas de seguimiento sugeridas.",
      "chat.followUp": "En el cuadro de entrada, vaya a la pregunta de seguimiento sugerida (Mayús+Tabulador) y presione Entrar para ejecutarla.",
      "chat.inspectResponse": "En el cuadro de entrada, inspeccione la última respuesta en la vista accesible{0}.",
      "chat.overview": "La vista de chat rápido consta de un cuadro de entrada y una lista de solicitudes y respuestas. El cuadro de entrada se usa para realizar solicitudes y la lista se usa para mostrar las respuestas.",
      "chat.progressVerbosity": "Mientras se procesa la solicitud de chat, recibirá actualizaciones detalladas del progreso si la solicitud tarda más de 4 segundos. Esto incluye información como el texto buscado para <search term> con X resultados, el archivo creado <file_name> o el archivo leído <file path>. Puede desactivar esto con accessibility.verboseChatProgressUpdates.",
      "chat.requestHistory": "En el cuadro de entrada, utilice las flechas arriba y abajo para navegar por el historial de solicitudes. Edite la entrada y pulse Entrar o el botón de Enviar para ejecutar una nueva solicitud.",
      "chat.signals": "Las señales de accesibilidad se pueden cambiar a través de la configuración con un prefijo de signals.chat. De forma predeterminada, si una solicitud tarda más de 4 segundos, escuchará un sonido que indica que el progreso todavía se está produciendo.",
      "chatAgent.acceptTool": "Para aceptar una acción de la herramienta, utilice el comando Aceptar confirmación de herramienta {0}.",
      "chatAgent.autoApprove": "Para aprobar automáticamente las acciones de la herramienta sin confirmación manual, establézcala {0} en {1} en la configuración.",
      "chatAgent.openEditedFilesSetting": "De forma predeterminada, cuando se realizan modificaciones en los archivos, se abrirán. Para cambiar este comportamiento, establezca accessibility.openChatEditedFiles en false en la configuración.",
      "chatAgent.overview": "La vista del agente de chat se utiliza para aplicar ediciones en los archivos de su área de trabajo, habilitar la ejecución de comandos en el terminal y mucho más.",
      "chatAgent.runCommand": "Para realizar la acción, use el comando de la herramienta Ejecutar comando {0}.",
      "chatAgent.userActionRequired": "Una alerta indicará cuándo se requiere la acción del usuario. Por ejemplo, si el agente quiere ejecutar algo en el terminal, escuchará: Acción requerida: Ejecutar comando en el terminal.",
      "chatEditing.acceptAllFiles": "- Conservar todas las ediciones{0}.",
      "chatEditing.acceptFile": "- Conservar{0} y Deshacer archivo{1}.",
      "chatEditing.acceptHunk": "En el editor, Mantenga{0}, Deshaga{1} o Alterne la Diferencia{2} para el Cambio actual.",
      "chatEditing.discardAllFiles": "- Deshacer todas las ediciones{0}.",
      "chatEditing.expectation": "Cuando se realiza una solicitud, se reproducirá un indicador de progreso mientras se aplican las modificaciones.",
      "chatEditing.format": "Se compone de un cuadro de entrada y un conjunto de trabajo de archivos (Mayús+Tabulador).",
      "chatEditing.helpfulCommands": "Algunos de los comandos útiles son:",
      "chatEditing.openFileInDiff": "- Abrir archivo en{0} de diferencias.",
      "chatEditing.overview": "La vista de edición de chat se usa para aplicar ediciones entre archivos.",
      "chatEditing.removeFileFromWorkingSet": "- Quitar archivo del espacio de trabajo{0}.",
      "chatEditing.review": "Una vez aplicadas las ediciones, se reproducirá un sonido para indicar que el documento se ha abierto y está listo para su revisión. El sonido se puede deshabilitar con accessibility.signals.chatEditModifiedFile.",
      "chatEditing.saveAllFiles": "- Guardar todos los archivos{0}.",
      "chatEditing.sections": "Navegar entre las ediciones del editor con la navegación por la{0} anterior y la siguiente{1}",
      "chatEditing.undoKeepSounds": "Los sonidos se reproducirán cuando se acepte o deshaga un cambio. Los sonidos se pueden deshabilitar con accessibility.signals.editsKept y accessibility.signals.editsUndone.",
      "inlineChat.access": "Se puede activar mediante acciones de código o directamente mediante el comando: Inline Chat: Start Inline Chat{0}.",
      "inlineChat.contextActions": "Las acciones del menú contextual pueden ejecutar una solicitud con el prefijo /. Escriba / para detectar estos comandos listos.",
      "inlineChat.diff": "Una vez en el editor de diferencias, entre en el modo de revisión con {0}. Use las flechas arriba y abajo para desplazarse por las líneas con los cambios propuestos.",
      "inlineChat.fix": "Si se invoca una acción de corrección, una respuesta indicará el problema con el código actual. Se representará un editor de diferencias y se puede acceder a él mediante tabulación.",
      "inlineChat.inspectResponse": "En el cuadro de entrada, inspeccione la respuesta en la vista accesible{0}.",
      "inlineChat.overview": "El chat en línea se realiza dentro de un editor de código y tiene en cuenta la selección actual. Resulta útil para realizar cambios en el editor actual. Por ejemplo, arreglar diagnósticos, documentar o refactorizar código. Tenga en cuenta que el código generado por inteligencia artificial puede ser incorrecto.",
      "inlineChat.requestHistory": "En el cuadro de entrada, use Mostrar anterior{0} y Mostrar siguiente{1} para navegar por el historial de solicitudes. Edite la entrada y use entrar o el botón Enviar para ejecutar una nueva solicitud.",
      "inlineChat.toolbar": "Utilice el tabulador para acceder a partes condicionales como comandos, estado, respuestas a mensajes y mucho más.",
      "workbench.action.chat.announceConfirmation": "Para centrar los cuadros de diálogo de confirmación de chat pendientes, invoque el comando Estado de confirmación del chat{0}.",
      "workbench.action.chat.editing.attachFiles": "- Adjuntar archivos{0}.",
      "workbench.action.chat.focus": "El comando Focus Chat{0} activa la lista de solicitudes y respuestas del chat, por la que se puede navegar con las flechas Arriba y Abajo.",
      "workbench.action.chat.focusInput": "Si desea enfocar el cuadro de entrada para las solicitudes de chat, invoque el comando Focus Chat Input{0}.",
      "workbench.action.chat.newChat": "Para crear una nueva sesión de chat, invoque el comando{0}Nuevo chat.",
      "workbench.action.chat.nextCodeBlock": "Para enfocar el siguiente bloque de código dentro de una respuesta, invoque el comando Chat: Next Code Block{0}.",
      "workbench.action.chat.undoEdits": "- Deshacer Ediciones{0}."
    },
    "vs/workbench/contrib/chat/browser/actions/chatActions": {
      "actions.interactiveSession.focus": "Enfocar lista de chats",
      "agent.newSession": "¿Iniciar nueva sesión?",
      "agent.newSession.confirm": "Sí",
      "agent.newSessionMessage": "Al cambiar el modo de chat, finalizará su sesión de edición actual. ¿Desea cambiar el modo de chat?",
      "chat.category": "Chat",
      "chat.clear.label": "Borrar todos los chats del área de trabajo",
      "chat.editToolApproval.label": "Editar aprobación de herramienta",
      "chat.editToolApproval.title": "Configuración de aprobación para {0}",
      "chat.history.label": "Mostrar chats...",
      "chat.history.recent": "Chats recientes",
      "chat.history.rename": "Cambiar nombre",
      "chat.history.showMore": "Mostrar más...",
      "chat.history.showMoreAgents": "Mostrar más...",
      "chat.openNewChatToTheSide.label": "Abrir el nuevo editor de chat a un lado",
      "chat.toggleDefaultVisibility.label": "Mostrar vista de forma predeterminada",
      "chat.toolApproval.manual": "Requerir siempre aprobación manual",
      "chat.toolApproval.profile": "Aprobar automáticamente a nivel global",
      "chat.toolApproval.session": "Aprobación automática para esta sesión",
      "chat.toolApproval.workspace": "Aprobación automática para esta área de trabajo",
      "chatAndCompletionsQuotaExceeded": "Ha alcanzado la cuota mensual de finalizaciones de código y mensajes de chat.",
      "chatQuotaExceeded": "Ha alcanzado la cuota mensual de mensajes de chat. Todavía tiene disponibles finalizaciones de código gratuitas.",
      "chatQuotaExceededButton": "Se alcanzó la cuota de mensajes de chat del plan GitHub Copilot Free. Haga clic para obtener más detalles.",
      "chatSessions.newChatInSideBar": "Abrir nuevo chat en la barra lateral",
      "chatSessions.openNewChatInNewWindow": "Abrir nuevo chat en nueva ventana",
      "chatWith": "Chatear con la extensión",
      "completionsQuotaExceeded": "Ha alcanzado la cuota mensual de finalizaciones de código. Todavía tienes mensajes de chat gratuitos disponibles.",
      "config.label": "Configurar chat...",
      "configureCompletions": "Configurar finalizaciones de código...",
      "copilotQuotaReached": "Cuota de GitHub Copilot alcanzada",
      "currentChatLabel": "actual",
      "dismiss": "Ignorar",
      "explain": "Explicar",
      "fix": "Corregir",
      "generateCode": "Generar código",
      "generateDocs": "Generar documentos",
      "generateInstructions": "Generar archivo de instrucciones del espacio de trabajo",
      "generateInstructions.short": "Generar instrucciones",
      "generateTests": "Generar pruebas",
      "interactiveSession.clearHistory.label": "Borrar el historial de entradas",
      "interactiveSession.focusInput.label": "Enfocar entrada de chat",
      "interactiveSession.history.clear": "Borrar todos los chats del área de trabajo",
      "interactiveSession.history.delete": "Eliminar",
      "interactiveSession.history.editor": "Abrir en el editor",
      "interactiveSession.history.pick": "Cambiar a chat",
      "interactiveSession.history.title": "Historial de chats del área de trabajo",
      "interactiveSession.history.titleAll": "Historial de chats de todo el área de trabajo",
      "interactiveSession.newChatWindow": "Nueva ventana de chat",
      "interactiveSession.open": "Nuevo Editor de chat",
      "manageChat": "Administrar chat",
      "more": "Más...",
      "newChatTitle": "Nuevo título del chat",
      "openChat": "Abrir chat",
      "openChatFeatureSettings": "Configuración de chat",
      "openChatFeatureSettings.short": "Configuración de chat",
      "openChatMode": "Abrir chat ({0})",
      "quotaResetDate": "La asignación se restablecerá el {0}.",
      "resetTrustedTools": "Confirmaciones de la herramienta de restablecimiento",
      "resetTrustedToolsSuccess": "Se han restablecido las preferencias de confirmación de la herramienta.",
      "review": "Revisión del código",
      "showCopilotUsageExtensions": "Mostrar extensiones usando Copilot",
      "signInToChatSetup": "Inicie sesión para usar las características de IA...",
      "switchChat.confirmPhrase": "Al cambiar de chat, finalizará la sesión de edición actual.",
      "switchMode.confirmPhrase": "Cambiar de modo de chat finalizará su sesión de edición actual.",
      "title4": "Chat",
      "toggle.chatControl": "Controles de chat",
      "toggle.chatControlsDescription": "Alternar visibilidad de los controles de diseño en la barra de título",
      "toggleChat": "Alternar chat",
      "upgradeChat": "Actualizar plan de GitHub Copilot",
      "upgradePlan": "Actualizar plan de GitHub Copilot",
      "upgradePro": "Actualizar a GitHub Copilot Pro",
      "upgradeToPro": "Actualice a GitHub Copilot Pro (los primeros 30 días son gratuitos) para:\r\n- Finalizaciones de código ilimitadas\r\n- Mensajes de chat ilimitados\r\n- Acceso a modelos premium"
    },
    "vs/workbench/contrib/chat/browser/actions/chatClearActions": {
      "chat.newChat.label": "Nuevo chat",
      "chat.newEdits.label": "Nuevo chat",
      "chat.redoEdit.label": "Rehacer la última solicitud",
      "chat.redoEdit.label2": "Rehacer",
      "chat.redoEdit.tooltip": "Volver a aplicar los cambios y el chat del área de trabajo descartados",
      "chat.undoEdit.label": "Deshacer la última solicitud"
    },
    "vs/workbench/contrib/chat/browser/actions/chatCodeblockActions": {
      "interactive.applyInEditor.label": "Aplicar en el editor",
      "interactive.applyInEditorWithURL.label": "Aplicar a {0}",
      "interactive.compare.apply": "Aplicar ediciones",
      "interactive.compare.discard": "Descartar ediciones",
      "interactive.copyCodeBlock.label": "Copiar",
      "interactive.insertCodeBlock.label": "Insertar en el cursor",
      "interactive.insertIntoNewFile.label": "Insertar en nuevo archivo",
      "interactive.nextCodeBlock.label": "Siguiente bloque de código",
      "interactive.previousCodeBlock.label": "Bloque de código anterior",
      "interactive.runInTerminal.label": "Insertar en terminal"
    },
    "vs/workbench/contrib/chat/browser/actions/chatContext": {
      "chatContext.attachScreenshot.labelElectron.Window": "Ventana de recorte de pantalla",
      "chatContext.attachScreenshot.labelWeb": "Recorte de pantalla",
      "chatContext.editors": "Editores abiertos",
      "chatContext.relatedFiles": "Archivos relacionados",
      "chatContext.tools": "Herramientas...",
      "chatContext.tools.placeholder": "Seleccionar una herramienta",
      "imageFromClipboard": "Imagen del Portapapeles",
      "pastedImage": "Imagen pegada",
      "relatedFiles": "Agregar archivos relacionados al espacio de trabajo"
    },
    "vs/workbench/contrib/chat/browser/actions/chatContextActions": {
      "chat.insertSearchResults": "Agregar resultados de la búsqueda al chat",
      "chatContext.attach.placeholder": "Buscar datos adjuntos",
      "goBack": "Volver ↩",
      "workbench.action.chat.attachContext.label.2": "Agregar contexto...",
      "workbench.action.chat.attachFile.label": "Agregar archivo al chat",
      "workbench.action.chat.attachFolder.label": "Agregar carpeta al chat",
      "workbench.action.chat.attachSelection.label": "Agregar selección al chat"
    },
    "vs/workbench/contrib/chat/browser/actions/chatCopyActions": {
      "interactive.copyAll.label": "Copiar todo",
      "interactive.copyItem.label": "Copiar"
    },
    "vs/workbench/contrib/chat/browser/actions/chatDeveloperActions": {
      "workbench.action.chat.logChatIndex.label": "Registrar índice de chat",
      "workbench.action.chat.logInputHistory.label": "Registrar historial de entrada de chat"
    },
    "vs/workbench/contrib/chat/browser/actions/chatExecuteActions": {
      "actions.chat.createRemoteJob": "Delegar al agente de codificación",
      "actions.chat.submitWithCodebase": "Enviar con {0}",
      "analyzingChatHistory": "Análisis del historial de chats",
      "attachedFiles": "El usuario ha adjuntado los siguientes archivos desde su área de trabajo:",
      "chat.newChat.label": "Enviar a nuevo chat",
      "chat.remove.confirmation.checkbox": "No volver a preguntar",
      "chat.remove.confirmation.message2": "Esto quitará todas las solicitudes posteriores y se deshacerán las modificaciones realizadas en {0}. ¿Desea continuar?",
      "chat.remove.confirmation.multipleEdits.message": "Esto quitará todas las solicitudes posteriores y deshacerá las modificaciones realizadas en los archivos {0} del conjunto de trabajo. ¿Desea continuar?",
      "chat.remove.confirmation.primaryButton": "Sí",
      "chat.remove.confirmation.title": "¿Desea deshacer {0} ediciones?",
      "chat.removeLast.confirmation.message2": "Esto quitará la última solicitud y deshará las modificaciones realizadas en {0}. ¿Desea continuar?",
      "chat.removeLast.confirmation.multipleEdits.message": "Esto quitará la última solicitud y deshacerá las modificaciones realizadas en los archivos {0} del conjunto de trabajo. ¿Desea continuar?",
      "chat.removeLast.confirmation.title": "¿Desea deshacer la última edición?",
      "creatingRemoteJob": "Delegación al agente de codificación",
      "edits.submit.label": "Enviar",
      "interactive.cancel.label": "Cancelar",
      "interactive.cancelEdit.label": "Cancelar edición",
      "interactive.changeModel.label": "Cambiar modelo",
      "interactive.openModePicker.label": "Selector de modo abierto",
      "interactive.openModelPicker.label": "Abrir selector de modelos",
      "interactive.submit.label": "Enviar y distribuir",
      "interactive.submit.panel.label": "Enviar a Editar sesión",
      "interactive.submitWithoutDispatch.label": "Enviar",
      "interactive.switchToNextModel.label": "Cambiar al modelo siguiente",
      "interactive.toggleAgent.label": "Cambiar al siguiente modo de chat",
